#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityDecoTool_AirStrike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AirStrikeLeveledPatterns_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C
// 0x0064 (0x06A4 - 0x0640)
class AAbilityDecoTool_AirStrike_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayAttribute                     firingRangeSubBuilding3;                           // 0x0648(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PowerLevel;                                        // 0x064C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FAirStrikeLeveledPatterns              DONOTEDIT_LeveledAirStrikeArrays;                  // 0x0650(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Current_Air_Strike_Sub_Tier_Selection;             // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Current_Level_Max;                                 // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        Current_Unprocessed_Positions_Array;               // 0x0664(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        Position_Array_Cleaned_of_duplicates;              // 0x0670(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 Duplicate_Positions;                               // 0x067C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 Double_Entries;                                    // 0x0688(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Spacing_Between_the_Impacts;                       // 0x0694(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Old_Power_Level;                                   // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Pattern_Needs_to_change;                           // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AbilityDecoTool_AirStrike(int32 EntryPoint);
	void BPOnSetDecoObjectPreview(class AFortDecoHelper* FortDecoHelper_0);
	void BPOnUnEquip();
	void BPOnEquip(class AFortWeapon* OldWeapon);
	void ReceiveBeginPlay();
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper_0);
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper_0);
	void UserConstructionScript();
	void PopulatePositionArrays();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AbilityDecoTool_AirStrike_C">();
	}
	static class AAbilityDecoTool_AirStrike_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilityDecoTool_AirStrike_C>();
	}
};
static_assert(alignof(AAbilityDecoTool_AirStrike_C) == 0x000004, "Wrong alignment on AAbilityDecoTool_AirStrike_C");
static_assert(sizeof(AAbilityDecoTool_AirStrike_C) == 0x0006A4, "Wrong size on AAbilityDecoTool_AirStrike_C");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, UberGraphFrame) == 0x000640, "Member 'AAbilityDecoTool_AirStrike_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, FortPlayerPawn) == 0x000644, "Member 'AAbilityDecoTool_AirStrike_C::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, firingRangeSubBuilding3) == 0x000648, "Member 'AAbilityDecoTool_AirStrike_C::firingRangeSubBuilding3' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, PowerLevel) == 0x00064C, "Member 'AAbilityDecoTool_AirStrike_C::PowerLevel' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, DONOTEDIT_LeveledAirStrikeArrays) == 0x000650, "Member 'AAbilityDecoTool_AirStrike_C::DONOTEDIT_LeveledAirStrikeArrays' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Current_Air_Strike_Sub_Tier_Selection) == 0x00065C, "Member 'AAbilityDecoTool_AirStrike_C::Current_Air_Strike_Sub_Tier_Selection' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Current_Level_Max) == 0x000660, "Member 'AAbilityDecoTool_AirStrike_C::Current_Level_Max' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Current_Unprocessed_Positions_Array) == 0x000664, "Member 'AAbilityDecoTool_AirStrike_C::Current_Unprocessed_Positions_Array' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Position_Array_Cleaned_of_duplicates) == 0x000670, "Member 'AAbilityDecoTool_AirStrike_C::Position_Array_Cleaned_of_duplicates' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Duplicate_Positions) == 0x00067C, "Member 'AAbilityDecoTool_AirStrike_C::Duplicate_Positions' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Double_Entries) == 0x000688, "Member 'AAbilityDecoTool_AirStrike_C::Double_Entries' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Spacing_Between_the_Impacts) == 0x000694, "Member 'AAbilityDecoTool_AirStrike_C::Spacing_Between_the_Impacts' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, FortDecoHelper) == 0x000698, "Member 'AAbilityDecoTool_AirStrike_C::FortDecoHelper' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Old_Power_Level) == 0x00069C, "Member 'AAbilityDecoTool_AirStrike_C::Old_Power_Level' has a wrong offset!");
static_assert(offsetof(AAbilityDecoTool_AirStrike_C, Pattern_Needs_to_change) == 0x0006A0, "Member 'AAbilityDecoTool_AirStrike_C::Pattern_Needs_to_change' has a wrong offset!");

}

#pragma pack(pop)
