#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityDecoTool_AirStrike

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AirStrikesPatterns_structs.hpp"
#include "StrikePatternVectorStruct_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.ExecuteUbergraph_AbilityDecoTool_AirStrike
// 0x0070 (0x0070 - 0x0000)
struct AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper3;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Placement_Preview_AirStrike_C*       K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper2;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortWeapon*                            K2Node_Event_OldWeapon;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Placement_Preview_AirStrike_C*       K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike2; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAirStrikesPatterns                    CallFunc_Array_Get_Item;                           // 0x0044(0x000C)()
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike) == 0x000070, "Wrong size on AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, EntryPoint) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::EntryPoint' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_GetInstigator_ReturnValue) == 0x000004, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000008, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_Event_FortDecoHelper3) == 0x000010, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_Event_FortDecoHelper3' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike) == 0x000018, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_bSuccess2) == 0x00001C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_Event_FortDecoHelper2) == 0x000020, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_Event_FortDecoHelper2' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_HasAuthority_ReturnValue) == 0x000024, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_Event_OldWeapon) == 0x00002C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_Event_OldWeapon' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_Event_FortDecoHelper) == 0x000034, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_Event_FortDecoHelper' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_IsValid_ReturnValue2) == 0x000038, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike2) == 0x00003C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_AsB_Placement_Preview_Air_Strike2' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_DynamicCast_bSuccess3) == 0x000040, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_Array_Get_Item) == 0x000044, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_Add_IntInt_ReturnValue2) == 0x000050, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_Percent_IntInt_ReturnValue) == 0x000054, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_Array_LastIndex_ReturnValue) == 0x000058, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00005C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000060, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000064, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike, K2Node_SwitchInteger_CmpSuccess) == 0x00006C, "Member 'AbilityDecoTool_AirStrike_C_ExecuteUbergraph_AbilityDecoTool_AirStrike::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.BPOnSetDecoObjectPreview
// 0x0004 (0x0004 - 0x0000)
struct AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview final
{
public:
	class AFortDecoHelper*                        FortDecoHelper_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview) == 0x000004, "Wrong size on AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview, FortDecoHelper_0) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_BPOnSetDecoObjectPreview::FortDecoHelper_0' has a wrong offset!");

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.BPOnEquip
// 0x0004 (0x0004 - 0x0000)
struct AbilityDecoTool_AirStrike_C_BPOnEquip final
{
public:
	class AFortWeapon*                            OldWeapon;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_BPOnEquip) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_BPOnEquip");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_BPOnEquip) == 0x000004, "Wrong size on AbilityDecoTool_AirStrike_C_BPOnEquip");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_BPOnEquip, OldWeapon) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_BPOnEquip::OldWeapon' has a wrong offset!");

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.BPPressTrigger
// 0x0004 (0x0004 - 0x0000)
struct AbilityDecoTool_AirStrike_C_BPPressTrigger final
{
public:
	class AFortDecoHelper*                        FortDecoHelper_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_BPPressTrigger) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_BPPressTrigger");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_BPPressTrigger) == 0x000004, "Wrong size on AbilityDecoTool_AirStrike_C_BPPressTrigger");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_BPPressTrigger, FortDecoHelper_0) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_BPPressTrigger::FortDecoHelper_0' has a wrong offset!");

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.BPPressSecondaryFire
// 0x0004 (0x0004 - 0x0000)
struct AbilityDecoTool_AirStrike_C_BPPressSecondaryFire final
{
public:
	class AFortDecoHelper*                        FortDecoHelper_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_BPPressSecondaryFire) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_BPPressSecondaryFire");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_BPPressSecondaryFire) == 0x000004, "Wrong size on AbilityDecoTool_AirStrike_C_BPPressSecondaryFire");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_BPPressSecondaryFire, FortDecoHelper_0) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_BPPressSecondaryFire::FortDecoHelper_0' has a wrong offset!");

// Function AbilityDecoTool_AirStrike.AbilityDecoTool_AirStrike_C.PopulatePositionArrays
// 0x00EC (0x00EC - 0x0000)
struct AbilityDecoTool_AirStrike_C_PopulatePositionArrays final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item2;                          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item3;                          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue2;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item4;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item5;                          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item6;                          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAirStrikesPatterns                    CallFunc_Array_Get_Item7;                          // 0x00D4(0x000C)()
	struct FStrikePatternVectorStruct             CallFunc_Array_Get_Item8;                          // 0x00E0(0x000C)()
};
static_assert(alignof(AbilityDecoTool_AirStrike_C_PopulatePositionArrays) == 0x000004, "Wrong alignment on AbilityDecoTool_AirStrike_C_PopulatePositionArrays");
static_assert(sizeof(AbilityDecoTool_AirStrike_C_PopulatePositionArrays) == 0x0000EC, "Wrong size on AbilityDecoTool_AirStrike_C_PopulatePositionArrays");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_PopulatePositionArrays, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AbilityDecoTool_AirStrike_C_PopulatePositionArrays::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AbilityDecoTool_AirStrike_C_PopulatePositionArrays, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AbilityDecoTool_AirStrike_C_PopulatePositionArrays::Temp_int_Loop_Counter_Variable' has a wrong offset!");
