#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AllowedToSleep

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AllowedToSleep.AllowedToSleep_C.PerformConditionCheckAI
// 0x0014 (0x0014 - 0x0000)
struct AllowedToSleep_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  ControlledPawn;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllowedToSleep_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AllowedToSleep_C_PerformConditionCheckAI) == 0x000004, "Wrong alignment on AllowedToSleep_C_PerformConditionCheckAI");
static_assert(sizeof(AllowedToSleep_C_PerformConditionCheckAI) == 0x000014, "Wrong size on AllowedToSleep_C_PerformConditionCheckAI");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'AllowedToSleep_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, ControlledPawn) == 0x000004, "Member 'AllowedToSleep_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, ReturnValue) == 0x000008, "Member 'AllowedToSleep_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, Temp_bool_Variable) == 0x000009, "Member 'AllowedToSleep_C_PerformConditionCheckAI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, K2Node_DynamicCast_AsFort_AIController) == 0x00000C, "Member 'AllowedToSleep_C_PerformConditionCheckAI::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AllowedToSleep_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AllowedToSleep_C_PerformConditionCheckAI, CallFunc_IsAllowedToSleep_ReturnValue) == 0x000011, "Member 'AllowedToSleep_C_PerformConditionCheckAI::CallFunc_IsAllowedToSleep_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
