#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_AttachAsset

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass AnimNotifyState_AttachAsset.AnimNotifyState_AttachAsset_C
// 0x0028 (0x0044 - 0x001C)
class UAnimNotifyState_AttachAsset_C final : public UAnimNotifyState
{
public:
	struct FAssetAttachment                       Attachment;                                        // 0x001C(0x001C)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UAnimSequence*                          Animation;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Looping;                                           // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation_0, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotifyState_AttachAsset_C">();
	}
	static class UAnimNotifyState_AttachAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_AttachAsset_C>();
	}
};
static_assert(alignof(UAnimNotifyState_AttachAsset_C) == 0x000004, "Wrong alignment on UAnimNotifyState_AttachAsset_C");
static_assert(sizeof(UAnimNotifyState_AttachAsset_C) == 0x000044, "Wrong size on UAnimNotifyState_AttachAsset_C");
static_assert(offsetof(UAnimNotifyState_AttachAsset_C, Attachment) == 0x00001C, "Member 'UAnimNotifyState_AttachAsset_C::Attachment' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AttachAsset_C, Animation) == 0x000038, "Member 'UAnimNotifyState_AttachAsset_C::Animation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AttachAsset_C, Looping) == 0x00003C, "Member 'UAnimNotifyState_AttachAsset_C::Looping' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AttachAsset_C, PlayRate) == 0x000040, "Member 'UAnimNotifyState_AttachAsset_C::PlayRate' has a wrong offset!");

}

#pragma pack(pop)
