#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayFX_WeapType

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass AnimNotify_PlayFX_WeapType.AnimNotify_PlayFX_WeapType_C
// 0x0028 (0x0048 - 0x0020)
class UAnimNotify_PlayFX_WeapType_C final : public UAnimNotify
{
public:
	class FString                                 Socket;                                            // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          Attach;                                            // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_PlayFX_WeapType_C">();
	}
	static class UAnimNotify_PlayFX_WeapType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayFX_WeapType_C>();
	}
};
static_assert(alignof(UAnimNotify_PlayFX_WeapType_C) == 0x000004, "Wrong alignment on UAnimNotify_PlayFX_WeapType_C");
static_assert(sizeof(UAnimNotify_PlayFX_WeapType_C) == 0x000048, "Wrong size on UAnimNotify_PlayFX_WeapType_C");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Socket) == 0x000020, "Member 'UAnimNotify_PlayFX_WeapType_C::Socket' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Attach) == 0x00002C, "Member 'UAnimNotify_PlayFX_WeapType_C::Attach' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Rotation) == 0x000030, "Member 'UAnimNotify_PlayFX_WeapType_C::Rotation' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Location) == 0x00003C, "Member 'UAnimNotify_PlayFX_WeapType_C::Location' has a wrong offset!");

}

#pragma pack(pop)
