#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Ninja_SmokeBomb_Cloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C.ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud
// 0x0230 (0x0230 - 0x0000)
struct AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0060(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00E0(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x017C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn2;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue3;         // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_AOELifespan;                    // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud) == 0x000010, "Wrong alignment on AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud");
static_assert(sizeof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud) == 0x000230, "Wrong size on AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, EntryPoint) == 0x000000, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000005, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000007, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsLocallyControlled_ReturnValue) == 0x00000D, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000060, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000E0, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000160, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_Add_FloatFloat_ReturnValue) == 0x000164, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000168, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherActor2) == 0x00016C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherComp2) == 0x000170, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x000174, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_bFromSweep) == 0x000178, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_SweepResult) == 0x00017C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001FC, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsLocallyControlled_ReturnValue2) == 0x000201, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherActor) == 0x000204, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherComp) == 0x000208, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x00020C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_DynamicCast_AsFort_Player_Pawn2) == 0x000210, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_DynamicCast_AsFort_Player_Pawn2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_DynamicCast_bSuccess2) == 0x000214, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_IsLocallyControlled_ReturnValue3) == 0x000215, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_IsLocallyControlled_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000218, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, K2Node_CustomEvent_AOELifespan) == 0x00021C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::K2Node_CustomEvent_AOELifespan' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000220, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud, CallFunc_FClamp_ReturnValue) == 0x000224, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C.ExtraLifespan
// 0x0004 (0x0004 - 0x0000)
struct AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan final
{
public:
	float                                         AOELifespan_0;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan) == 0x000004, "Wrong alignment on AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan");
static_assert(sizeof(AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan) == 0x000004, "Wrong size on AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan, AOELifespan_0) == 0x000000, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_ExtraLifespan::AOELifespan_0' has a wrong offset!");

// Function AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C.BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C.BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'AOE_Ninja_SmokeBomb_Cloud_C_BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

#pragma pack(pop)
