#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Ninja_DragonSlashTrail

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C.ExecuteUbergraph_AOE_Ninja_DragonSlashTrail
// 0x003C (0x003C - 0x0000)
struct AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0014(0x0004)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail) == 0x000004, "Wrong alignment on AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail");
static_assert(sizeof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail) == 0x00003C, "Wrong size on AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, EntryPoint) == 0x000000, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::EntryPoint' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000014, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, K2Node_ComponentBoundEvent_OtherActor) == 0x000020, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, K2Node_ComponentBoundEvent_OtherComp) == 0x000024, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00002C, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'AOE_Ninja_DragonSlashTrail_C_ExecuteUbergraph_AOE_Ninja_DragonSlashTrail::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C.BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'AOE_Ninja_DragonSlashTrail_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C.OnSetAOEExtentXY
// 0x0018 (0x0018 - 0x0000)
struct AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY final
{
public:
	float                                         CallFunc_BreakVector_X;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY) == 0x000004, "Wrong alignment on AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY");
static_assert(sizeof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY) == 0x000018, "Wrong size on AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY, CallFunc_BreakVector_X) == 0x000000, "Member 'AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY, CallFunc_BreakVector_Y) == 0x000004, "Member 'AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY, CallFunc_BreakVector_Z) == 0x000008, "Member 'AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'AOE_Ninja_DragonSlashTrail_C_OnSetAOEExtentXY::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
