#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Commando_KeepOutExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.ExecuteUbergraph_AOE_Commando_KeepOutExplosion
// 0x0008 (0x0008 - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Radius;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion) == 0x000004, "Wrong alignment on AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion");
static_assert(sizeof(AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion) == 0x000008, "Wrong size on AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion");
static_assert(offsetof(AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion, EntryPoint) == 0x000000, "Member 'AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion, K2Node_CustomEvent_Radius) == 0x000004, "Member 'AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion::K2Node_CustomEvent_Radius' has a wrong offset!");

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.Send_Info
// 0x0004 (0x0004 - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_Send_Info final
{
public:
	float                                         Radius_0;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Commando_KeepOutExplosion_C_Send_Info) == 0x000004, "Wrong alignment on AOE_Commando_KeepOutExplosion_C_Send_Info");
static_assert(sizeof(AOE_Commando_KeepOutExplosion_C_Send_Info) == 0x000004, "Wrong size on AOE_Commando_KeepOutExplosion_C_Send_Info");
static_assert(offsetof(AOE_Commando_KeepOutExplosion_C_Send_Info, Radius_0) == 0x000000, "Member 'AOE_Commando_KeepOutExplosion_C_Send_Info::Radius_0' has a wrong offset!");

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.OnRep_Radius
// 0x000C (0x000C - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_OnRep_Radius final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AOE_Commando_KeepOutExplosion_C_OnRep_Radius) == 0x000004, "Wrong alignment on AOE_Commando_KeepOutExplosion_C_OnRep_Radius");
static_assert(sizeof(AOE_Commando_KeepOutExplosion_C_OnRep_Radius) == 0x00000C, "Wrong size on AOE_Commando_KeepOutExplosion_C_OnRep_Radius");
static_assert(offsetof(AOE_Commando_KeepOutExplosion_C_OnRep_Radius, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'AOE_Commando_KeepOutExplosion_C_OnRep_Radius::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
