#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Base_Deco_Preview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Base_Deco_Preview.B_Base_Deco_Preview_C
// 0x0014 (0x0370 - 0x035C)
class AB_Base_Deco_Preview_C final : public AFortDecoPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x035C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Base_Device;                                    // 0x0360(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          Box;                                               // 0x0364(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Base_Deco_Preview(int32 EntryPoint);
	void OnInitializeDecoPreview(const class ABuildingActor* NewBuildingActor, const class UFortDecoItemDefinition* NewDecoItemDefinition);
	void OnUpdateVisuals(float DeltaSeconds, bool bSafeToPlace);
	void UserConstructionScript();
	void SetupMIDforMeshOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Base_Deco_Preview_C">();
	}
	static class AB_Base_Deco_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Base_Deco_Preview_C>();
	}
};
static_assert(alignof(AB_Base_Deco_Preview_C) == 0x000004, "Wrong alignment on AB_Base_Deco_Preview_C");
static_assert(sizeof(AB_Base_Deco_Preview_C) == 0x000370, "Wrong size on AB_Base_Deco_Preview_C");
static_assert(offsetof(AB_Base_Deco_Preview_C, UberGraphFrame) == 0x00035C, "Member 'AB_Base_Deco_Preview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Base_Deco_Preview_C, SM_Base_Device) == 0x000360, "Member 'AB_Base_Deco_Preview_C::SM_Base_Device' has a wrong offset!");
static_assert(offsetof(AB_Base_Deco_Preview_C, Box) == 0x000364, "Member 'AB_Base_Deco_Preview_C::Box' has a wrong offset!");
static_assert(offsetof(AB_Base_Deco_Preview_C, DefaultSceneRoot) == 0x000368, "Member 'AB_Base_Deco_Preview_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Base_Deco_Preview_C, NewMID) == 0x00036C, "Member 'AB_Base_Deco_Preview_C::NewMID' has a wrong offset!");

}

#pragma pack(pop)
