#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_ProximityMine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_BGA_ProximityMine.B_BGA_ProximityMine_C.ExecuteUbergraph_B_BGA_ProximityMine
// 0x0B44 (0x0B44 - 0x0000)
struct B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Init_Speed;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Gravity;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Activation_Delay;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0058(0x0080)(ConstParm, ContainsInstancedReference)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x00F4(0x0058)()
	float                                         K2Node_Event_Damage;                               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0150(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0174(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x01FC(0x000C)()
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x020C(0x0084)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x02A0(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidTarget_ReturnValue;                // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate2;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue;                 // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x02CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF[0x1];                                      // 0x02CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x02DC(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Explosion_Level;                // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Activation_Radius;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x03B4(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValidTarget_ReturnValue2;               // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0448(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x04D8(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0558(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult2;   // 0x05D8(0x0080)(ContainsInstancedReference)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0658(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665[0x3];                                      // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0674(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x06F4(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue2;                // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult3;      // 0x0798(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0818(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult4;      // 0x0824(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x08A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x08B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue3;                // 0x08BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult5;      // 0x08C8(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0948(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0954(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue4;                // 0x09DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue2;                       // 0x09E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F5[0x3];                                      // 0x09F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x09F8(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult6;      // 0x0A78(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x0AF8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue3;                       // 0x0B04(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0B10(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue4;                       // 0x0B20(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x0B2C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue5;                       // 0x0B38(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine) == 0x000004, "Wrong alignment on B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine");
static_assert(sizeof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine) == 0x000B44, "Wrong size on B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, EntryPoint) == 0x000000, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000006, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_OnSameTeam_ReturnValue) == 0x00000D, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000014, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Init_Speed) == 0x000018, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Init_Speed' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Gravity) == 0x00001C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Gravity' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Activation_Delay) == 0x000020, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Activation_Delay' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_MyComp) == 0x000024, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_Other) == 0x000028, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_OtherComp) == 0x00002C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_bSelfMoved) == 0x000030, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_HitLocation) == 0x000034, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_HitNormal) == 0x000040, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_NormalImpulse) == 0x00004C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_Hit) == 0x000058, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_DynamicCast_AsBuilding_Actor) == 0x0000D8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_DynamicCast_bSuccess) == 0x0000DC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_DynamicCast_AsPawn) == 0x0000E0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_DynamicCast_bSuccess2) == 0x0000E4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_HasAuthority_ReturnValue2) == 0x0000E5, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_int_Array_Index_Variable) == 0x0000E8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetInstigator_ReturnValue) == 0x0000EC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_MakeStruct_GameplayEventData) == 0x0000F4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_Damage) == 0x00014C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_DamageTags) == 0x000150, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_Momentum) == 0x000168, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_HitInfo) == 0x000174, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_InstigatedBy) == 0x0001F4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_DamageCauser) == 0x0001F8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_Event_EffectContext) == 0x0001FC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_GameplayCueEvent_EventType) == 0x000208, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_GameplayCueEvent_Parameters) == 0x00020C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CreateDelegate_OutputDelegate) == 0x000290, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0002A0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Array_Length_ReturnValue) == 0x0002AC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Array_Get_Item) == 0x0002B0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsValidTarget_ReturnValue) == 0x0002B4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsValidTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CreateDelegate_OutputDelegate2) == 0x0002B8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetInstigator_ReturnValue2) == 0x0002C8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsValid_ReturnValue2) == 0x0002CC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetActorTeam_ReturnValue) == 0x0002CD, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_bool_True_if_break_was_hit_Variable) == 0x0002CE, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotator_ReturnValue) == 0x0002D0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x0002DC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Not_PreBool_ReturnValue2) == 0x00035C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Explosion_Level) == 0x000360, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Explosion_Level' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Activation_Radius) == 0x000364, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Activation_Radius' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_PlayerPawn) == 0x000368, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_SwitchInteger_CmpSuccess) == 0x00036C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_DamagedActor) == 0x000370, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Damage) == 0x000374, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_InstigatedBy) == 0x000378, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_DamageCauser) == 0x00037C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_HitLocation) == 0x000380, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_FHitComponent) == 0x00038C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_BoneName) == 0x000390, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_CustomEvent_Momentum) == 0x000398, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_ComponentBoundEvent_OtherActor) == 0x0003A4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_ComponentBoundEvent_OtherComp) == 0x0003A8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0003AC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_ComponentBoundEvent_bFromSweep) == 0x0003B0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, K2Node_ComponentBoundEvent_SweepResult) == 0x0003B4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_IsValidTarget_ReturnValue2) == 0x000434, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_IsValidTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_int_Loop_Counter_Variable) == 0x000438, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Less_IntInt_ReturnValue) == 0x00043C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Add_IntInt_ReturnValue) == 0x000440, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_BooleanAND_ReturnValue) == 0x000444, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_bool_IsClosed_Variable2) == 0x000445, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000448, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_RandomFloatInRange_ReturnValue) == 0x0004C8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotator_ReturnValue2) == 0x0004CC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0004D8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000558, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetRelativeRotation_SweepHitResult2) == 0x0005D8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetRelativeRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000658, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_SetActorRotation_ReturnValue) == 0x000664, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeVector_ReturnValue) == 0x000668, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000674, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x0006F4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Dot_VectorVector_ReturnValue) == 0x000774, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_DegAcos_ReturnValue) == 0x000778, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotFromZ_ReturnValue) == 0x00077C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Less_FloatFloat_ReturnValue) == 0x000788, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotFromZ_ReturnValue2) == 0x00078C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotFromZ_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult3) == 0x000798, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeVector_ReturnValue2) == 0x000818, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult4) == 0x000824, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult4' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeVector_ReturnValue3) == 0x0008A4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_VLerp_ReturnValue) == 0x0008B0, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotFromZ_ReturnValue3) == 0x0008BC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotFromZ_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult5) == 0x0008C8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult5' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_GetSocketLocation_ReturnValue) == 0x000948, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000954, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0009D4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_FClamp_ReturnValue) == 0x0009D8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeRotFromZ_ReturnValue4) == 0x0009DC, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeRotFromZ_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_VLerp_ReturnValue2) == 0x0009E8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_VLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, Temp_bool_Has_Been_Initd_Variable2) == 0x0009F4, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x0009F8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_K2_SetWorldRotation_SweepHitResult6) == 0x000A78, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_K2_SetWorldRotation_SweepHitResult6' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeVector_ReturnValue4) == 0x000AF8, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_VLerp_ReturnValue3) == 0x000B04, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_VLerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_SelectColor_ReturnValue) == 0x000B10, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_VLerp_ReturnValue4) == 0x000B20, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_VLerp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_MakeVector_ReturnValue5) == 0x000B2C, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine, CallFunc_VLerp_ReturnValue5) == 0x000B38, "Member 'B_BGA_ProximityMine_C_ExecuteUbergraph_B_BGA_ProximityMine::CallFunc_VLerp_ReturnValue5' has a wrong offset!");

// Function B_BGA_ProximityMine.B_BGA_ProximityMine_C.BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'B_BGA_ProximityMine_C_BndEvt__S_HalfSphere_Collision_1_Unit_K2Node_ComponentBoundEvent_420_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_BGA_ProximityMine.B_BGA_ProximityMine_C.BaseDied
// 0x0034 (0x0034 - 0x0000)
struct B_BGA_ProximityMine_C_BaseDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Damage;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            InstigatedBy;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   BoneName;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_ProximityMine_C_BaseDied) == 0x000004, "Wrong alignment on B_BGA_ProximityMine_C_BaseDied");
static_assert(sizeof(B_BGA_ProximityMine_C_BaseDied) == 0x000034, "Wrong size on B_BGA_ProximityMine_C_BaseDied");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, DamagedActor) == 0x000000, "Member 'B_BGA_ProximityMine_C_BaseDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, Damage) == 0x000004, "Member 'B_BGA_ProximityMine_C_BaseDied::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, InstigatedBy) == 0x000008, "Member 'B_BGA_ProximityMine_C_BaseDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, DamageCauser) == 0x00000C, "Member 'B_BGA_ProximityMine_C_BaseDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, HitLocation) == 0x000010, "Member 'B_BGA_ProximityMine_C_BaseDied::HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, FHitComponent) == 0x00001C, "Member 'B_BGA_ProximityMine_C_BaseDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, BoneName) == 0x000020, "Member 'B_BGA_ProximityMine_C_BaseDied::BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_BaseDied, Momentum) == 0x000028, "Member 'B_BGA_ProximityMine_C_BaseDied::Momentum' has a wrong offset!");

// Function B_BGA_ProximityMine.B_BGA_ProximityMine_C.SetExplosion
// 0x000C (0x000C - 0x0000)
struct B_BGA_ProximityMine_C_SetExplosion final
{
public:
	int32                                         Explosion_Level;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Activation_Radius_0;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_ProximityMine_C_SetExplosion) == 0x000004, "Wrong alignment on B_BGA_ProximityMine_C_SetExplosion");
static_assert(sizeof(B_BGA_ProximityMine_C_SetExplosion) == 0x00000C, "Wrong size on B_BGA_ProximityMine_C_SetExplosion");
static_assert(offsetof(B_BGA_ProximityMine_C_SetExplosion, Explosion_Level) == 0x000000, "Member 'B_BGA_ProximityMine_C_SetExplosion::Explosion_Level' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_SetExplosion, Activation_Radius_0) == 0x000004, "Member 'B_BGA_ProximityMine_C_SetExplosion::Activation_Radius_0' has a wrong offset!");
static_assert(offsetof(B_BGA_ProximityMine_C_SetExplosion, PlayerPawn) == 0x000008, "Member 'B_BGA_ProximityMine_C_SetExplosion::PlayerPawn' has a wrong offset!");

// Function B_BGA_ProximityMine.B_BGA_ProximityMine_C.GameplayCue.Abilities.Activation.Generic.proxymine
// 0x0088 (0x0088 - 0x0000)
