#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Explorer_OutlanderFragmentBear

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear
// 0x04C8 (0x04C8 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0008(0x0084)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0094(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage2;                              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x0184(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x01A8(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x0230(0x000C)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x024C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0270(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02F8(0x000C)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x031C(0x0080)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x03F0(0x0084)()
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_NewTargetPawn;                  // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x047E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x047F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear) == 0x0004C8, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, EntryPoint) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_GameplayCueEvent_EventType2) == 0x000005, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_GameplayCueEvent_Parameters2) == 0x000008, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000094, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_bBlockingHit) == 0x000114, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_bInitialOverlap) == 0x000115, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_Time) == 0x000118, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_Location) == 0x00011C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_Normal) == 0x000134, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_ImpactNormal) == 0x000140, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_PhysMat) == 0x00014C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_HitComponent) == 0x000154, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_IsValid_ReturnValue) == 0x00017C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_Damage2) == 0x000180, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_DamageTags2) == 0x000184, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_Momentum2) == 0x00019C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_HitInfo2) == 0x0001A8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_InstigatedBy2) == 0x000228, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_DamageCauser2) == 0x00022C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_EffectContext2) == 0x000230, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00023C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_Damage) == 0x000248, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_DamageTags) == 0x00024C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_Momentum) == 0x000264, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_HitInfo) == 0x000270, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_InstigatedBy) == 0x0002F0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_DamageCauser) == 0x0002F4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_Event_EffectContext) == 0x0002F8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_IsValid_ReturnValue2) == 0x000304, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000308, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherActor2) == 0x00030C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherComp2) == 0x000310, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x000314, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_bFromSweep) == 0x000318, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_SweepResult) == 0x00031C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherActor) == 0x00039C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherComp) == 0x0003A0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0003A4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_DynamicCast_AsFort_Pawn) == 0x0003A8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_DynamicCast_bSuccess) == 0x0003AC, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_DynamicCast_AsFort_Pawn2) == 0x0003B0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_DynamicCast_bSuccess2) == 0x0003B4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CreateDelegate_OutputDelegate) == 0x0003B8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0003C8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0003D4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0003E0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_GameplayCueEvent_EventType) == 0x0003EC, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_GameplayCueEvent_Parameters) == 0x0003F0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_SwitchEnum2_CmpSuccess) == 0x000474, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_NewTargetPawn) == 0x000478, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_NewTargetPawn' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_HasAuthority_ReturnValue2) == 0x00047C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00047D, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_BooleanAND_ReturnValue) == 0x00047E, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_IsValid_ReturnValue3) == 0x00047F, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_DamagedActor) == 0x000480, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_Damage) == 0x000484, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_InstigatedBy) == 0x000488, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_DamageCauser) == 0x00048C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_HitLocation) == 0x000490, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_FHitComponent) == 0x00049C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_BoneName) == 0x0004A0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, K2Node_CustomEvent_Momentum) == 0x0004A8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_HasAuthority_ReturnValue3) == 0x0004B4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0004B8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_GetGameTimeInSeconds_ReturnValue2) == 0x0004BC, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_GetGameTimeInSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0004C0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0004C4, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.OnTargetPawnDied
// 0x0034 (0x0034 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Damage;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            InstigatedBy;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   BoneName;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied) == 0x000034, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, DamagedActor) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, Damage) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, InstigatedBy) == 0x000008, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, DamageCauser) == 0x00000C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, HitLocation) == 0x000010, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, FHitComponent) == 0x00001C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, BoneName) == 0x000020, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied, Momentum) == 0x000028, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnTargetPawnDied::Momentum' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.SetTargetPawn
// 0x0004 (0x0004 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn final
{
public:
	class AFortPawn*                              NewTargetPawn;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn) == 0x000004, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn, NewTargetPawn) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_SetTargetPawn::NewTargetPawn' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.GameplayCue.Weapons.Activation
// 0x0088 (0x0088 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation) == 0x000088, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation, EventType) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation::EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation, Parameters) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_GameplayCue_Weapons_Activation::Parameters' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer) == 0x0000BC, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, Damage) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, DamageTags) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, Momentum) == 0x00001C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, HitInfo) == 0x000028, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, InstigatedBy) == 0x0000A8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, DamageCauser) == 0x0000AC, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer, EffectContext) == 0x0000B0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'B_BGA_Explorer_OutlanderFragmentBear_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_BGA_Explorer_OutlanderFragmentBear_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Explorer_OutlanderFragmentBear_C_ReceiveTick) == 0x000004, "Wrong alignment on B_BGA_Explorer_OutlanderFragmentBear_C_ReceiveTick");
static_assert(sizeof(B_BGA_Explorer_OutlanderFragmentBear_C_ReceiveTick) == 0x000004, "Wrong size on B_BGA_Explorer_OutlanderFragmentBear_C_ReceiveTick");
