#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Constructor_Shield

#include "Basic.hpp"

#include "Engine_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Constructor_Shield.B_Constructor_Shield_C
// 0x000C (0x024C - 0x0240)
class AB_Constructor_Shield_C final : public AActor
{
public:
	class UBoxComponent*                          BoxCollision;                                      // 0x0240(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   S_ConstructorShield_Proto;                         // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Constructor_Shield_C">();
	}
	static class AB_Constructor_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Constructor_Shield_C>();
	}
};
static_assert(alignof(AB_Constructor_Shield_C) == 0x000004, "Wrong alignment on AB_Constructor_Shield_C");
static_assert(sizeof(AB_Constructor_Shield_C) == 0x00024C, "Wrong size on AB_Constructor_Shield_C");
static_assert(offsetof(AB_Constructor_Shield_C, BoxCollision) == 0x000240, "Member 'AB_Constructor_Shield_C::BoxCollision' has a wrong offset!");
static_assert(offsetof(AB_Constructor_Shield_C, S_ConstructorShield_Proto) == 0x000244, "Member 'AB_Constructor_Shield_C::S_ConstructorShield_Proto' has a wrong offset!");
static_assert(offsetof(AB_Constructor_Shield_C, DefaultSceneRoot) == 0x000248, "Member 'AB_Constructor_Shield_C::DefaultSceneRoot' has a wrong offset!");

}

#pragma pack(pop)
