#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FDP_SentryGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_FDP_SentryGun.B_FDP_SentryGun_C
// 0x0014 (0x0370 - 0x035C)
class AB_FDP_SentryGun_C final : public AFortDecoPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x035C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   AmmoMesh;                                          // 0x0360(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Gun;                                               // 0x0364(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Base;                                              // 0x0368(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCapsuleComponent*                      CollisionCapsule;                                  // 0x036C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_B_FDP_SentryGun(int32 EntryPoint);
	void OnInitializeDecoPreview(const class ABuildingActor* NewBuildingActor, const class UFortDecoItemDefinition* NewDecoItemDefinition);
	void UserConstructionScript();
	void SetupMIDForMeshComponent(class UStaticMeshComponent* MeshComp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FDP_SentryGun_C">();
	}
	static class AB_FDP_SentryGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FDP_SentryGun_C>();
	}
};
static_assert(alignof(AB_FDP_SentryGun_C) == 0x000004, "Wrong alignment on AB_FDP_SentryGun_C");
static_assert(sizeof(AB_FDP_SentryGun_C) == 0x000370, "Wrong size on AB_FDP_SentryGun_C");
static_assert(offsetof(AB_FDP_SentryGun_C, UberGraphFrame) == 0x00035C, "Member 'AB_FDP_SentryGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_FDP_SentryGun_C, AmmoMesh) == 0x000360, "Member 'AB_FDP_SentryGun_C::AmmoMesh' has a wrong offset!");
static_assert(offsetof(AB_FDP_SentryGun_C, Gun) == 0x000364, "Member 'AB_FDP_SentryGun_C::Gun' has a wrong offset!");
static_assert(offsetof(AB_FDP_SentryGun_C, Base) == 0x000368, "Member 'AB_FDP_SentryGun_C::Base' has a wrong offset!");
static_assert(offsetof(AB_FDP_SentryGun_C, CollisionCapsule) == 0x00036C, "Member 'AB_FDP_SentryGun_C::CollisionCapsule' has a wrong offset!");

}

#pragma pack(pop)
