#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FDP_SentryGun

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_FDP_SentryGun.B_FDP_SentryGun_C.ExecuteUbergraph_B_FDP_SentryGun
// 0x000C (0x000C - 0x0000)
struct B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class ABuildingActor*                   K2Node_Event_NewBuildingActor;                     // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UFortDecoItemDefinition*          K2Node_Event_NewDecoItemDefinition;                // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun) == 0x000004, "Wrong alignment on B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun");
static_assert(sizeof(B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun) == 0x00000C, "Wrong size on B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun");
static_assert(offsetof(B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun, EntryPoint) == 0x000000, "Member 'B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun, K2Node_Event_NewBuildingActor) == 0x000004, "Member 'B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun::K2Node_Event_NewBuildingActor' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun, K2Node_Event_NewDecoItemDefinition) == 0x000008, "Member 'B_FDP_SentryGun_C_ExecuteUbergraph_B_FDP_SentryGun::K2Node_Event_NewDecoItemDefinition' has a wrong offset!");

// Function B_FDP_SentryGun.B_FDP_SentryGun_C.OnInitializeDecoPreview
// 0x0008 (0x0008 - 0x0000)
struct B_FDP_SentryGun_C_OnInitializeDecoPreview final
{
public:
	const class ABuildingActor*                   NewBuildingActor;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UFortDecoItemDefinition*          NewDecoItemDefinition;                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FDP_SentryGun_C_OnInitializeDecoPreview) == 0x000004, "Wrong alignment on B_FDP_SentryGun_C_OnInitializeDecoPreview");
static_assert(sizeof(B_FDP_SentryGun_C_OnInitializeDecoPreview) == 0x000008, "Wrong size on B_FDP_SentryGun_C_OnInitializeDecoPreview");
static_assert(offsetof(B_FDP_SentryGun_C_OnInitializeDecoPreview, NewBuildingActor) == 0x000000, "Member 'B_FDP_SentryGun_C_OnInitializeDecoPreview::NewBuildingActor' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_OnInitializeDecoPreview, NewDecoItemDefinition) == 0x000004, "Member 'B_FDP_SentryGun_C_OnInitializeDecoPreview::NewDecoItemDefinition' has a wrong offset!");

// Function B_FDP_SentryGun.B_FDP_SentryGun_C.SetupMIDForMeshComponent
// 0x0014 (0x0014 - 0x0000)
struct B_FDP_SentryGun_C_SetupMIDForMeshComponent final
{
public:
	class UStaticMeshComponent*                   MeshComp;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture*                               CallFunc_GetTextureParameterValueFromMeshComponent_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreatePreviewMID_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FDP_SentryGun_C_SetupMIDForMeshComponent) == 0x000004, "Wrong alignment on B_FDP_SentryGun_C_SetupMIDForMeshComponent");
static_assert(sizeof(B_FDP_SentryGun_C_SetupMIDForMeshComponent) == 0x000014, "Wrong size on B_FDP_SentryGun_C_SetupMIDForMeshComponent");
static_assert(offsetof(B_FDP_SentryGun_C_SetupMIDForMeshComponent, MeshComp) == 0x000000, "Member 'B_FDP_SentryGun_C_SetupMIDForMeshComponent::MeshComp' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_SetupMIDForMeshComponent, CallFunc_GetTextureParameterValueFromMeshComponent_ReturnValue) == 0x000004, "Member 'B_FDP_SentryGun_C_SetupMIDForMeshComponent::CallFunc_GetTextureParameterValueFromMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_SetupMIDForMeshComponent, CallFunc_CreatePreviewMID_ReturnValue) == 0x000008, "Member 'B_FDP_SentryGun_C_SetupMIDForMeshComponent::CallFunc_CreatePreviewMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_SetupMIDForMeshComponent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'B_FDP_SentryGun_C_SetupMIDForMeshComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FDP_SentryGun_C_SetupMIDForMeshComponent, NewMID) == 0x000010, "Member 'B_FDP_SentryGun_C_SetupMIDForMeshComponent::NewMID' has a wrong offset!");

}

#pragma pack(pop)
