#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Pickups.B_Pickups_C
// 0x00C0 (0x0330 - 0x0270)
class AB_Pickups_C final : public AFortPickupEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0278(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBillboardComponent*                    Origin;                                            // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                Pivot_Offset;                                      // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Rotation_Bias;                                     // 0x0290(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Rotation_Speed;                                    // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_Static_Mesh;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   Static_Mesh_Pickup;                                // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Pickup;                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSkeletalMesh;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Backpack_Particle;                                 // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_a_Backpack;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             ListOfMaterialsExemptFromReparenting;              // 0x02BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UPrimitiveComponent*                    SkeletalOrStaticMeshAssetPrimitive;                // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            ScaleByDistanceCurve;                              // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            Size2Curve;                                        // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            AlphaCurve;                                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            SizeSparkleCurve;                                  // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTextureParameterValue                 Diffuse;                                           // 0x02DC(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Mid2;                                              // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TwoMaterials;                                      // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentElementIndex;                               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInstanceDynamic*>       midArray;                                          // 0x0304(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                     CurrentMaterial;                                   // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     CurrentParentMaterial;                             // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MaterialParentIsValid;                             // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             ListOfParentMaterialsExemptFromReparenting;        // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         UpdateParametersRange;                             // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           UpdateParametersHandle;                            // 0x032C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Pickups(int32 EntryPoint);
	void UpdateParameters();
	void CheckIfInUpdateParametersRange();
	void OnAboutToEnterBackpack();
	void OnPickedUp();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_C">();
	}
	static class AB_Pickups_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_C>();
	}
};
static_assert(alignof(AB_Pickups_C) == 0x000004, "Wrong alignment on AB_Pickups_C");
static_assert(sizeof(AB_Pickups_C) == 0x000330, "Wrong size on AB_Pickups_C");
static_assert(offsetof(AB_Pickups_C, UberGraphFrame) == 0x000270, "Member 'AB_Pickups_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, RotatingMovement) == 0x000274, "Member 'AB_Pickups_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ParticleSystem) == 0x000278, "Member 'AB_Pickups_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Origin) == 0x00027C, "Member 'AB_Pickups_C::Origin' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Root) == 0x000280, "Member 'AB_Pickups_C::Root' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Pivot_Offset) == 0x000284, "Member 'AB_Pickups_C::Pivot_Offset' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rotation_Bias) == 0x000290, "Member 'AB_Pickups_C::Rotation_Bias' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rotation_Speed) == 0x00029C, "Member 'AB_Pickups_C::Rotation_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Use_Static_Mesh) == 0x0002A0, "Member 'AB_Pickups_C::Use_Static_Mesh' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Static_Mesh_Pickup) == 0x0002A4, "Member 'AB_Pickups_C::Static_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Skeletal_Mesh_Pickup) == 0x0002A8, "Member 'AB_Pickups_C::Skeletal_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Mid) == 0x0002AC, "Member 'AB_Pickups_C::Mid' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsSkeletalMesh) == 0x0002B0, "Member 'AB_Pickups_C::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Backpack_Particle) == 0x0002B4, "Member 'AB_Pickups_C::Backpack_Particle' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Is_a_Backpack) == 0x0002B8, "Member 'AB_Pickups_C::Is_a_Backpack' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ListOfMaterialsExemptFromReparenting) == 0x0002BC, "Member 'AB_Pickups_C::ListOfMaterialsExemptFromReparenting' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, SkeletalOrStaticMeshAssetPrimitive) == 0x0002C8, "Member 'AB_Pickups_C::SkeletalOrStaticMeshAssetPrimitive' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ScaleByDistanceCurve) == 0x0002CC, "Member 'AB_Pickups_C::ScaleByDistanceCurve' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Size2Curve) == 0x0002D0, "Member 'AB_Pickups_C::Size2Curve' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, AlphaCurve) == 0x0002D4, "Member 'AB_Pickups_C::AlphaCurve' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, SizeSparkleCurve) == 0x0002D8, "Member 'AB_Pickups_C::SizeSparkleCurve' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Diffuse) == 0x0002DC, "Member 'AB_Pickups_C::Diffuse' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Mid2) == 0x0002F8, "Member 'AB_Pickups_C::Mid2' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, TwoMaterials) == 0x0002FC, "Member 'AB_Pickups_C::TwoMaterials' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentElementIndex) == 0x000300, "Member 'AB_Pickups_C::CurrentElementIndex' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, midArray) == 0x000304, "Member 'AB_Pickups_C::midArray' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentMaterial) == 0x000310, "Member 'AB_Pickups_C::CurrentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentParentMaterial) == 0x000314, "Member 'AB_Pickups_C::CurrentParentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MaterialParentIsValid) == 0x000318, "Member 'AB_Pickups_C::MaterialParentIsValid' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ListOfParentMaterialsExemptFromReparenting) == 0x00031C, "Member 'AB_Pickups_C::ListOfParentMaterialsExemptFromReparenting' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, UpdateParametersRange) == 0x000328, "Member 'AB_Pickups_C::UpdateParametersRange' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, UpdateParametersHandle) == 0x00032C, "Member 'AB_Pickups_C::UpdateParametersHandle' has a wrong offset!");

}

#pragma pack(pop)
