#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_SupplyDrop_Impact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Post_SupplyDrop_Impact.B_Post_SupplyDrop_Impact_C.ExecuteUbergraph_B_Post_SupplyDrop_Impact
// 0x004C (0x004C - 0x0000)
struct B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_PostFX_BoxScaleDyn;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_PostFX_CamShakeLoc;             // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_PostFX_UseCamShake;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_PostFX_DeactivateDelay;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact) == 0x000004, "Wrong alignment on B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact");
static_assert(sizeof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact) == 0x00004C, "Wrong size on B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, EntryPoint) == 0x000000, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_BreakVector_X) == 0x000004, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_BreakVector_Y) == 0x000008, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_BreakVector_Z) == 0x00000C, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000014, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000018, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, K2Node_CustomEvent_PostFX_BoxScaleDyn) == 0x000028, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::K2Node_CustomEvent_PostFX_BoxScaleDyn' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, K2Node_CustomEvent_PostFX_CamShakeLoc) == 0x00002C, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::K2Node_CustomEvent_PostFX_CamShakeLoc' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, K2Node_CustomEvent_PostFX_UseCamShake) == 0x000038, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::K2Node_CustomEvent_PostFX_UseCamShake' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, K2Node_CustomEvent_PostFX_DeactivateDelay) == 0x00003C, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::K2Node_CustomEvent_PostFX_DeactivateDelay' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'B_Post_SupplyDrop_Impact_C_ExecuteUbergraph_B_Post_SupplyDrop_Impact::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Post_SupplyDrop_Impact.B_Post_SupplyDrop_Impact_C.SpawnPostFX
// 0x0018 (0x0018 - 0x0000)
struct B_Post_SupplyDrop_Impact_C_SpawnPostFX final
{
public:
	float                                         PostFX_BoxScaleDyn;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                PostFX_CamShakeLoc;                                // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PostFX_UseCamShake;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PostFX_DeactivateDelay;                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Post_SupplyDrop_Impact_C_SpawnPostFX) == 0x000004, "Wrong alignment on B_Post_SupplyDrop_Impact_C_SpawnPostFX");
static_assert(sizeof(B_Post_SupplyDrop_Impact_C_SpawnPostFX) == 0x000018, "Wrong size on B_Post_SupplyDrop_Impact_C_SpawnPostFX");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_SpawnPostFX, PostFX_BoxScaleDyn) == 0x000000, "Member 'B_Post_SupplyDrop_Impact_C_SpawnPostFX::PostFX_BoxScaleDyn' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_SpawnPostFX, PostFX_CamShakeLoc) == 0x000004, "Member 'B_Post_SupplyDrop_Impact_C_SpawnPostFX::PostFX_CamShakeLoc' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_SpawnPostFX, PostFX_UseCamShake) == 0x000010, "Member 'B_Post_SupplyDrop_Impact_C_SpawnPostFX::PostFX_UseCamShake' has a wrong offset!");
static_assert(offsetof(B_Post_SupplyDrop_Impact_C_SpawnPostFX, PostFX_DeactivateDelay) == 0x000014, "Member 'B_Post_SupplyDrop_Impact_C_SpawnPostFX::PostFX_DeactivateDelay' has a wrong offset!");

}

#pragma pack(pop)
