#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_Explosion_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Post_Explosion_Generic.B_Post_Explosion_Generic_C
// 0x03AC (0x05EC - 0x0240)
class AB_Post_Explosion_Generic_C : public AActor
{
public:
	class UPostProcessComponent*                  PostFX;                                            // 0x0240(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       PostFX_SphereComponent;                            // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                PostFX_PreviewScale;                               // 0x0248(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         PostFX_BlendRadius;                                // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                PostFX_ShakeEpicenter;                             // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PostFX_ShakeOuterradius;                           // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PostFX_ShakeInnerRadius;                           // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseCameraShake;                                    // 0x026C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CameraShakeClass;                                  // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DeactivateDelay;                                   // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPostProcessSettings                   PostFX_Settings;                                   // 0x0278(0x0374)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_Explosion_Generic_C">();
	}
	static class AB_Post_Explosion_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_Explosion_Generic_C>();
	}
};
static_assert(alignof(AB_Post_Explosion_Generic_C) == 0x000004, "Wrong alignment on AB_Post_Explosion_Generic_C");
static_assert(sizeof(AB_Post_Explosion_Generic_C) == 0x0005EC, "Wrong size on AB_Post_Explosion_Generic_C");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX) == 0x000240, "Member 'AB_Post_Explosion_Generic_C::PostFX' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_SphereComponent) == 0x000244, "Member 'AB_Post_Explosion_Generic_C::PostFX_SphereComponent' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_PreviewScale) == 0x000248, "Member 'AB_Post_Explosion_Generic_C::PostFX_PreviewScale' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_BlendRadius) == 0x000254, "Member 'AB_Post_Explosion_Generic_C::PostFX_BlendRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeEpicenter) == 0x000258, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeEpicenter' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeOuterradius) == 0x000264, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeOuterradius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeInnerRadius) == 0x000268, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeInnerRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, UseCameraShake) == 0x00026C, "Member 'AB_Post_Explosion_Generic_C::UseCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, CameraShakeClass) == 0x000270, "Member 'AB_Post_Explosion_Generic_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, DeactivateDelay) == 0x000274, "Member 'AB_Post_Explosion_Generic_C::DeactivateDelay' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_Settings) == 0x000278, "Member 'AB_Post_Explosion_Generic_C::PostFX_Settings' has a wrong offset!");

}

#pragma pack(pop)
