#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_SupplyDrop_Impact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Post_Explosion_Generic_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Post_SupplyDrop_Impact.B_Post_SupplyDrop_Impact_C
// 0x0010 (0x05FC - 0x05EC)
class AB_Post_SupplyDrop_Impact_C final : public AB_Post_Explosion_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05EC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE; // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_69D06A67407476376496A4814EB654AE; // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x05F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Post_SupplyDrop_Impact(int32 EntryPoint);
	void SpawnPostFX(float PostFX_BoxScaleDyn, const struct FVector& PostFX_CamShakeLoc, bool PostFX_UseCamShake, float PostFX_DeactivateDelay);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_SupplyDrop_Impact_C">();
	}
	static class AB_Post_SupplyDrop_Impact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_SupplyDrop_Impact_C>();
	}
};
static_assert(alignof(AB_Post_SupplyDrop_Impact_C) == 0x000004, "Wrong alignment on AB_Post_SupplyDrop_Impact_C");
static_assert(sizeof(AB_Post_SupplyDrop_Impact_C) == 0x0005FC, "Wrong size on AB_Post_SupplyDrop_Impact_C");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, UberGraphFrame) == 0x0005EC, "Member 'AB_Post_SupplyDrop_Impact_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE) == 0x0005F0, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0__Direction_69D06A67407476376496A4814EB654AE) == 0x0005F4, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0__Direction_69D06A67407476376496A4814EB654AE' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0) == 0x0005F8, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0' has a wrong offset!");

}

#pragma pack(pop)
