#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_AdrenalineRush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C.ExecuteUbergraph_B_Prj_AdrenalineRush
// 0x0044 (0x0044 - 0x0000)
struct B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Radius;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Owner;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item2;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush) == 0x000004, "Wrong alignment on B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush");
static_assert(sizeof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush) == 0x000044, "Wrong size on B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, EntryPoint) == 0x000000, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000004, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, K2Node_CustomEvent_Radius) == 0x000008, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, K2Node_CustomEvent_Owner) == 0x00000C, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, K2Node_CustomEvent_Level) == 0x000010, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_Array_Get_Item) == 0x000014, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_IsLocallyControlled_ReturnValue) == 0x000018, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_Array_Get_Item2) == 0x000024, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000028, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_FClamp_ReturnValue) == 0x00002C, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x00003C, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x000040, "Member 'B_Prj_AdrenalineRush_C_ExecuteUbergraph_B_Prj_AdrenalineRush::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");

// Function B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C.PassInfo
// 0x000C (0x000C - 0x0000)
struct B_Prj_AdrenalineRush_C_PassInfo final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        Owner_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_AdrenalineRush_C_PassInfo) == 0x000004, "Wrong alignment on B_Prj_AdrenalineRush_C_PassInfo");
static_assert(sizeof(B_Prj_AdrenalineRush_C_PassInfo) == 0x00000C, "Wrong size on B_Prj_AdrenalineRush_C_PassInfo");
static_assert(offsetof(B_Prj_AdrenalineRush_C_PassInfo, Radius) == 0x000000, "Member 'B_Prj_AdrenalineRush_C_PassInfo::Radius' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_PassInfo, Owner_0) == 0x000004, "Member 'B_Prj_AdrenalineRush_C_PassInfo::Owner_0' has a wrong offset!");
static_assert(offsetof(B_Prj_AdrenalineRush_C_PassInfo, Level) == 0x000008, "Member 'B_Prj_AdrenalineRush_C_PassInfo::Level' has a wrong offset!");

}

#pragma pack(pop)
