#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ninja_SmokeBomb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C.ExecuteUbergraph_B_Prj_Ninja_SmokeBomb
// 0x00E0 (0x00E0 - 0x0000)
struct B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0038(0x0080)(ConstParm, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x00B8(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x00C4(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb) == 0x000004, "Wrong alignment on B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb");
static_assert(sizeof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb) == 0x0000E0, "Wrong size on B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, EntryPoint) == 0x000000, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_MyComp) == 0x000004, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_Other) == 0x000008, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_OtherComp) == 0x00000C, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_bSelfMoved) == 0x000010, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_HitLocation) == 0x000014, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_HitNormal) == 0x000020, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_NormalImpulse) == 0x00002C, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_Hit) == 0x000038, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_HitActors) == 0x0000B8, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, K2Node_Event_HitResults) == 0x0000C4, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, CallFunc_MakeRotFromZ_ReturnValue) == 0x0000D0, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000DC, "Member 'B_Prj_Ninja_SmokeBomb_C_ExecuteUbergraph_B_Prj_Ninja_SmokeBomb::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Ninja_SmokeBomb_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ninja_SmokeBomb_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_Ninja_SmokeBomb_C_OnExploded");
static_assert(sizeof(B_Prj_Ninja_SmokeBomb_C_OnExploded) == 0x000018, "Wrong size on B_Prj_Ninja_SmokeBomb_C_OnExploded");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_Ninja_SmokeBomb_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_Ninja_SmokeBomb_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct B_Prj_Ninja_SmokeBomb_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation_0;                                     // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit) == 0x000004, "Wrong alignment on B_Prj_Ninja_SmokeBomb_C_ReceiveHit");
static_assert(sizeof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit) == 0x0000B4, "Wrong size on B_Prj_Ninja_SmokeBomb_C_ReceiveHit");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, Other) == 0x000004, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, OtherComp) == 0x000008, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, HitLocation_0) == 0x000010, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, HitNormal) == 0x00001C, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, NormalImpulse) == 0x000028, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Ninja_SmokeBomb_C_ReceiveHit, Hit) == 0x000034, "Member 'B_Prj_Ninja_SmokeBomb_C_ReceiveHit::Hit' has a wrong offset!");

}

#pragma pack(pop)
