#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Constructor_PlasmaPulse

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse
// 0x0430 (0x0430 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x0018(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0xC];                                      // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0130(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0178(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0268(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x02E8(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult2;      // 0x0368(0x0080)(ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse) == 0x000010, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse) == 0x000430, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, EntryPoint) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_Event_Hit2) == 0x000018, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_bBlockingHit) == 0x000098, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_bInitialOverlap) == 0x000099, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Time) == 0x00009C, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Location) == 0x0000A0, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_ImpactPoint) == 0x0000AC, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Normal) == 0x0000B8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C4, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_PhysMat) == 0x0000D0, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitActor) == 0x0000D4, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitComponent) == 0x0000D8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitBoneName) == 0x0000DC, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitItem) == 0x0000E4, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_TraceStart) == 0x0000E8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_TraceEnd) == 0x0000F4, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_DynamicCast_AsBuilding_Actor) == 0x000100, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_DynamicCast_bSuccess) == 0x000104, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000108, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_SetActorRotation_ReturnValue) == 0x000114, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakRotator_Roll) == 0x000118, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakRotator_Pitch) == 0x00011C, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakRotator_Yaw) == 0x000120, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, Temp_struct_Variable) == 0x000130, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_Add_FloatFloat_ReturnValue) == 0x000160, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_MakeRotator_ReturnValue) == 0x000164, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_AddComponent_ReturnValue) == 0x000170, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_Event_EndPlayReason) == 0x000174, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, Temp_bool_IsClosed_Variable) == 0x000175, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_Event_Hit) == 0x000178, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_bBlockingHit2) == 0x0001F8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_bInitialOverlap2) == 0x0001F9, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Time2) == 0x0001FC, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Location2) == 0x000200, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_ImpactPoint2) == 0x00020C, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_Normal2) == 0x000218, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_ImpactNormal2) == 0x000224, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_PhysMat2) == 0x000230, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitActor2) == 0x000234, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitComponent2) == 0x000238, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitBoneName2) == 0x00023C, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_HitItem2) == 0x000244, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_TraceStart2) == 0x000248, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_BreakHitResult_TraceEnd2) == 0x000254, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_DynamicCast_AsPawn) == 0x000260, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_DynamicCast_bSuccess2) == 0x000264, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000268, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0002E8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, CallFunc_K2_AddLocalRotation_SweepHitResult2) == 0x000368, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::CallFunc_K2_AddLocalRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_DamagedActor) == 0x0003E8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_Damage) == 0x0003EC, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_InstigatedBy) == 0x0003F0, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_DamageCauser) == 0x0003F4, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_HitLocation) == 0x0003F8, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_FHitComponent) == 0x000404, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_BoneName) == 0x000408, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CustomEvent_Momentum) == 0x000410, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse, K2Node_CreateDelegate_OutputDelegate2) == 0x00041C, "Member 'B_Prj_Constructor_PlasmaPulse_C_ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.AttachedObj_Died
// 0x0034 (0x0034 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Damage;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            InstigatedBy;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   BoneName;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died) == 0x000004, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died) == 0x000034, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, DamagedActor) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, Damage) == 0x000004, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, InstigatedBy) == 0x000008, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, DamageCauser) == 0x00000C, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, HitLocation) == 0x000010, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, FHitComponent) == 0x00001C, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, BoneName) == 0x000020, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died, Momentum) == 0x000028, "Member 'B_Prj_Constructor_PlasmaPulse_C_AttachedObj_Died::Momentum' has a wrong offset!");

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.OnBounce
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_OnBounce");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_OnBounce) == 0x000080, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_OnBounce");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay) == 0x000001, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.OnStop
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_OnStop");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_OnStop) == 0x000080, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_OnStop");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C.OnRep_Explode
// 0x0070 (0x0070 - 0x0000)
struct B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_Post_Explosion_Generic_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_Post_Explosion_PlasmaBomb_C*         K2Node_DynamicCast_AsB_Post_Explosion_Plasma_Bomb; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode) == 0x000010, "Wrong alignment on B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode");
static_assert(sizeof(B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode) == 0x000070, "Wrong size on B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode, CallFunc_BreakTransform_Location) == 0x000030, "Member 'B_Prj_Constructor_PlasmaPulse_C_OnRep_Explode::CallFunc_BreakTransform_Location' has a wrong offset!");
