#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Outlander_GravitySphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C.ExecuteUbergraph_B_Prj_Outlander_GravitySphere
// 0x0418 (0x0418 - 0x0000)
struct B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x001C(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_impactpoint;                    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_impactnormal;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue2;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0154(0x0080)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn3;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn2;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue2;           // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x020C(0x0080)(ContainsInstancedReference)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue2;          // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInHasHeavyStuff;               // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue5;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue6;                        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue7;                        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_EnteringActor;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue3;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x02D4(0x0004)()
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x02E8(0x0004)()
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn4;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ExitingActor;                   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn5;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue4;          // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30F[0x1];                                      // 0x030F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue3;   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue4;   // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0320(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x032C(0x000C)()
	class APawn*                                  CallFunc_GetInstigator_ReturnValue3;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue4;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue5;   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue6;   // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue3; // 0x0348(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0354(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue2;  // 0x0360(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x036C(0x0004)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x0370(0x0004)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue3;  // 0x0378(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue3; // 0x0384(0x0004)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bHasEnemyExtraGravity;          // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x2];                                      // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue5;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue7;   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue4; // 0x0394(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue4;  // 0x03A0(0x000C)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x03AC(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue4; // 0x03B8(0x0004)()
	class APawn*                                  CallFunc_GetInstigator_ReturnValue6;               // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue8;   // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue5; // 0x03C4(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue5;  // 0x03D0(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue6; // 0x03DC(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue5; // 0x03E8(0x0004)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue6;  // 0x03EC(0x000C)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue2;            // 0x03F8(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue6; // 0x0404(0x0004)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue4;          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere) == 0x000004, "Wrong alignment on B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere");
static_assert(sizeof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere) == 0x000418, "Wrong size on B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, EntryPoint) == 0x000000, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000015, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasAuthority_ReturnValue2) == 0x000016, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasAuthority_ReturnValue3) == 0x000017, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasAuthority_ReturnValue4) == 0x000018, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_Event_Hit) == 0x00001C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_bBlockingHit) == 0x00009C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009D, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_Time) == 0x0000A0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_Location) == 0x0000A4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_Normal) == 0x0000BC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_PhysMat) == 0x0000D4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_HitActor) == 0x0000D8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_HitComponent) == 0x0000DC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_HitBoneName) == 0x0000E0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_HitItem) == 0x0000E8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_TraceStart) == 0x0000EC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BreakHitResult_TraceEnd) == 0x0000F8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Pawn) == 0x000104, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_impactpoint) == 0x00010C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_impactpoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_impactnormal) == 0x000118, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_impactnormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000124, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_SetActorRotation_ReturnValue) == 0x000130, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue) == 0x000134, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Conv_FloatToVector_ReturnValue2) == 0x000138, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Conv_FloatToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherActor2) == 0x000144, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherComp2) == 0x000148, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x00014C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_bFromSweep) == 0x000150, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_SweepResult) == 0x000154, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherActor) == 0x0001D4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherComp) == 0x0001D8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001DC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Pawn2) == 0x0001E0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess2) == 0x0001E4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001E8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess3) == 0x0001EC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001ED, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001EE, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Pawn3) == 0x0001F0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Pawn3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess4) == 0x0001F4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0001F5, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Player_Pawn2) == 0x0001F8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Player_Pawn2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess5) == 0x0001FC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_IsLocallyControlled_ReturnValue2) == 0x0001FD, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTimelineLength_ReturnValue) == 0x000200, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTimelineLength_ReturnValue2) == 0x000204, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTimelineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Add_FloatFloat_ReturnValue) == 0x000208, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00020C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTeamAffiliation_ReturnValue) == 0x00028C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_SwitchEnum_CmpSuccess) == 0x00028D, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTeamAffiliation_ReturnValue2) == 0x00028E, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTeamAffiliation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_SwitchEnum2_CmpSuccess) == 0x00028F, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_IsPlaying_ReturnValue) == 0x000290, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000294, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue2) == 0x000298, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_RandomFloatInRange_ReturnValue) == 0x00029C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_bInHasHeavyStuff) == 0x0002A0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_bInHasHeavyStuff' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue3) == 0x0002A4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue4) == 0x0002A8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue5) == 0x0002AC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue6) == 0x0002B0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue6' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Lerp_ReturnValue7) == 0x0002B4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Lerp_ReturnValue7' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Add_IntInt_ReturnValue) == 0x0002B8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002BC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_Clamp_ReturnValue) == 0x0002C4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_EnteringActor) == 0x0002C8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_EnteringActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0002CC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTeamAffiliation_ReturnValue3) == 0x0002D0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTeamAffiliation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0002D4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_SwitchEnum3_CmpSuccess) == 0x0002D8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002DC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002E4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x0002E8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Pawn4) == 0x0002EC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Pawn4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess6) == 0x0002F0, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_ExitingActor) == 0x0002F4, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_ExitingActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0002F8, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_AsFort_Pawn5) == 0x0002FC, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_AsFort_Pawn5' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess7) == 0x000300, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasMatchingGameplayTag_self2_CastInput) == 0x000304, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasMatchingGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x00030C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetTeamAffiliation_ReturnValue4) == 0x00030D, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetTeamAffiliation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_SwitchEnum4_CmpSuccess) == 0x00030E, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetInstigator_ReturnValue) == 0x000310, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetInstigator_ReturnValue2) == 0x000314, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue3) == 0x000318, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue4) == 0x00031C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000320, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x00032C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetInstigator_ReturnValue3) == 0x000338, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetInstigator_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetInstigator_ReturnValue4) == 0x00033C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetInstigator_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue5) == 0x000340, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue6) == 0x000344, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue6' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue3) == 0x000348, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000354, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_AssignSetByCallerMagnitude_ReturnValue2) == 0x000360, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_AssignSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x00036C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x000370, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, Temp_bool_Has_Been_Initd_Variable) == 0x000374, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_AssignSetByCallerMagnitude_ReturnValue3) == 0x000378, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_AssignSetByCallerMagnitude_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue3) == 0x000384, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, Temp_bool_IsClosed_Variable) == 0x000388, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, K2Node_CustomEvent_bHasEnemyExtraGravity) == 0x000389, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::K2Node_CustomEvent_bHasEnemyExtraGravity' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetInstigator_ReturnValue5) == 0x00038C, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetInstigator_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_GetAbilitySystemComponent_ReturnValue7) == 0x000390, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_GetAbilitySystemComponent_ReturnValue7' has a wrong offset!");
static_assert(offsetof(B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue4) == 0x000394, "Member 'B_Prj_Outlander_GravitySphere_C_ExecuteUbergraph_B_Prj_Outlander_GravitySphere::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue4' has a wrong offset!");
