#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ninja_ThrowingStars

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C
// 0x002C (0x0444 - 0x0418)
class AB_Prj_Ninja_ThrowingStars_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          CollisionBox;                                      // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ProjectilePS;                                      // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0428(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        P_ImpactEffects;                                   // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Cue_ImpactSound;                                   // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Piercing;                                          // 0x043C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ProjectilePiercingPS;                              // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Ninja_ThrowingStars(int32 EntryPoint);
	void BndEvt__CollisionBox_K2Node_ComponentBoundEvent_30_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ShouldPierce();
	void HomeTargetDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation_0, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void SetHoming();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation_0, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();
	void OnRep_HitLocation();
	void OnRep_Piercing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ninja_ThrowingStars_C">();
	}
	static class AB_Prj_Ninja_ThrowingStars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ninja_ThrowingStars_C>();
	}
};
static_assert(alignof(AB_Prj_Ninja_ThrowingStars_C) == 0x000004, "Wrong alignment on AB_Prj_Ninja_ThrowingStars_C");
static_assert(sizeof(AB_Prj_Ninja_ThrowingStars_C) == 0x000444, "Wrong size on AB_Prj_Ninja_ThrowingStars_C");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_Ninja_ThrowingStars_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, CollisionBox) == 0x00041C, "Member 'AB_Prj_Ninja_ThrowingStars_C::CollisionBox' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, Mesh) == 0x000420, "Member 'AB_Prj_Ninja_ThrowingStars_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, ProjectilePS) == 0x000424, "Member 'AB_Prj_Ninja_ThrowingStars_C::ProjectilePS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, HitLocation) == 0x000428, "Member 'AB_Prj_Ninja_ThrowingStars_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, P_ImpactEffects) == 0x000434, "Member 'AB_Prj_Ninja_ThrowingStars_C::P_ImpactEffects' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, Cue_ImpactSound) == 0x000438, "Member 'AB_Prj_Ninja_ThrowingStars_C::Cue_ImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, Piercing) == 0x00043C, "Member 'AB_Prj_Ninja_ThrowingStars_C::Piercing' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ninja_ThrowingStars_C, ProjectilePiercingPS) == 0x000440, "Member 'AB_Prj_Ninja_ThrowingStars_C::ProjectilePiercingPS' has a wrong offset!");

}

#pragma pack(pop)
