#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SlowField

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_SlowField.B_SlowField_C.ExecuteUbergraph_B_SlowField
// 0x04E0 (0x04E0 - 0x0000)
struct B_SlowField_C_ExecuteUbergraph_B_SlowField final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x000C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0030(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00B8(0x000C)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00E8(0x0080)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn3;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameplayEffectDeliveryActor*       K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue2;                // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A7[0x1];                                      // 0x01A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn4;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x01B4(0x0004)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x01BC(0x0004)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3; // 0x01C0(0x0004)()
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameplayEffectDeliveryActor*       K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor2; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Height;                         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Radius;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Activation_Delay;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0254(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* DeadActor, float Damage, class AFortPawn* InstigatedBy, const struct FVector& HitLocation, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0300(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x0380(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E[0x2];                                      // 0x038E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn5;                   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0418(0x0080)(ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue; // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x049E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue2; // 0x049F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_CustomEvent_InstigatedBy;                   // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue5;                        // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue6;                        // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SlowField_C_ExecuteUbergraph_B_SlowField) == 0x000010, "Wrong alignment on B_SlowField_C_ExecuteUbergraph_B_SlowField");
static_assert(sizeof(B_SlowField_C_ExecuteUbergraph_B_SlowField) == 0x0004E0, "Wrong size on B_SlowField_C_ExecuteUbergraph_B_SlowField");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, EntryPoint) == 0x000000, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasAuthority_ReturnValue2) == 0x000005, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasAuthority_ReturnValue3) == 0x000006, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_Damage) == 0x000008, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_DamageTags) == 0x00000C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_Momentum) == 0x000024, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_HitInfo) == 0x000030, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_InstigatedBy) == 0x0000B0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_DamageCauser) == 0x0000B4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_Event_EffectContext) == 0x0000B8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherActor2) == 0x0000D8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherComp2) == 0x0000DC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x0000E0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000E4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_SweepResult) == 0x0000E8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherActor) == 0x000168, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherComp) == 0x00016C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000170, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Pawn) == 0x000174, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetActorTeam_ReturnValue) == 0x000179, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Pawn2) == 0x00017C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess2) == 0x000180, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000181, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000182, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_IsLocallyControlled_ReturnValue) == 0x000183, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000184, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BooleanAND_ReturnValue) == 0x000188, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x00018C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000194, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Pawn3) == 0x000198, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Pawn3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess3) == 0x00019C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor) == 0x0001A0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess4) == 0x0001A4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x0001A5, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetActorTeam_ReturnValue2) == 0x0001A6, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetActorTeam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Pawn4) == 0x0001A8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Pawn4' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess5) == 0x0001AC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0001B0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0001B4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x0001B8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x0001BC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3) == 0x0001C0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_IsLocallyControlled_ReturnValue2) == 0x0001C4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor2) == 0x0001C8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Gameplay_Effect_Delivery_Actor2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess6) == 0x0001CC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BooleanAND_ReturnValue2) == 0x0001CD, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001D0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasMatchingGameplayTag_self2_CastInput) == 0x0001DC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasMatchingGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x0001E4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_Height) == 0x0001E8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_Height' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_Radius) == 0x0001EC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_Activation_Delay) == 0x0001F0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_Activation_Delay' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001F8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_MakeVector_ReturnValue) == 0x0001FC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000208, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00020C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_MakeVector_ReturnValue2) == 0x000210, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000250, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000254, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_MakeVector_ReturnValue3) == 0x0002D4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue) == 0x0002E0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue2) == 0x0002E4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CreateDelegate_OutputDelegate) == 0x0002E8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0002F8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_FClamp_ReturnValue) == 0x0002FC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_ImpactResult) == 0x000300, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x000380, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_bBlockingHit) == 0x00038C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_bInitialOverlap) == 0x00038D, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_Time) == 0x000390, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_Location) == 0x000394, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_ImpactPoint) == 0x0003A0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_Normal) == 0x0003AC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_ImpactNormal) == 0x0003B8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_PhysMat) == 0x0003C4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_HitActor) == 0x0003C8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_HitComponent) == 0x0003CC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_HitBoneName) == 0x0003D0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_HitItem) == 0x0003D8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_TraceStart) == 0x0003DC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BreakHitResult_TraceEnd) == 0x0003E8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_AsFort_Pawn5) == 0x0003F4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_AsFort_Pawn5' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_DynamicCast_bSuccess7) == 0x0003F8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_MakeRotFromZ_ReturnValue) == 0x0003FC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Dot_VectorVector_ReturnValue) == 0x000408, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_SetActorRotation_ReturnValue) == 0x00040C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_DegAcos_ReturnValue) == 0x000410, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Less_FloatFloat_ReturnValue) == 0x000414, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000418, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000498, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue) == 0x00049C, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00049D, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BooleanOR_ReturnValue) == 0x00049E, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue2) == 0x00049F, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0004A0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_DeadActor) == 0x0004A4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_Damage) == 0x0004A8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_InstigatedBy) == 0x0004AC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_HitLocation) == 0x0004B0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, K2Node_CustomEvent_DamageCauser) == 0x0004BC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_BooleanOR_ReturnValue2) == 0x0004C0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x0004C4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0004C8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue3) == 0x0004CC, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue4) == 0x0004D0, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue5) == 0x0004D4, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_ExecuteUbergraph_B_SlowField, CallFunc_Lerp_ReturnValue6) == 0x0004D8, "Member 'B_SlowField_C_ExecuteUbergraph_B_SlowField::CallFunc_Lerp_ReturnValue6' has a wrong offset!");

// Function B_SlowField.B_SlowField_C.OnLocalPlayerDeath
// 0x001C (0x001C - 0x0000)
struct B_SlowField_C_OnLocalPlayerDeath final
{
public:
	class AActor*                                 DeadActor;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Damage;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              InstigatedBy;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SlowField_C_OnLocalPlayerDeath) == 0x000004, "Wrong alignment on B_SlowField_C_OnLocalPlayerDeath");
static_assert(sizeof(B_SlowField_C_OnLocalPlayerDeath) == 0x00001C, "Wrong size on B_SlowField_C_OnLocalPlayerDeath");
static_assert(offsetof(B_SlowField_C_OnLocalPlayerDeath, DeadActor) == 0x000000, "Member 'B_SlowField_C_OnLocalPlayerDeath::DeadActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_OnLocalPlayerDeath, Damage) == 0x000004, "Member 'B_SlowField_C_OnLocalPlayerDeath::Damage' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_OnLocalPlayerDeath, InstigatedBy) == 0x000008, "Member 'B_SlowField_C_OnLocalPlayerDeath::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_OnLocalPlayerDeath, HitLocation) == 0x00000C, "Member 'B_SlowField_C_OnLocalPlayerDeath::HitLocation' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_OnLocalPlayerDeath, DamageCauser) == 0x000018, "Member 'B_SlowField_C_OnLocalPlayerDeath::DamageCauser' has a wrong offset!");

// Function B_SlowField.B_SlowField_C.BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature
// 0x008C (0x008C - 0x0000)
struct B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0080(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature) == 0x000004, "Wrong alignment on B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature) == 0x00008C, "Wrong size on B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x000080, "Member 'B_SlowField_C_BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function B_SlowField.B_SlowField_C.PassInfo
// 0x000C (0x000C - 0x0000)
struct B_SlowField_C_PassInfo final
{
public:
	float                                         Height_0;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Radius_0;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Activation_Delay_0;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SlowField_C_PassInfo) == 0x000004, "Wrong alignment on B_SlowField_C_PassInfo");
static_assert(sizeof(B_SlowField_C_PassInfo) == 0x00000C, "Wrong size on B_SlowField_C_PassInfo");
static_assert(offsetof(B_SlowField_C_PassInfo, Height_0) == 0x000000, "Member 'B_SlowField_C_PassInfo::Height_0' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_PassInfo, Radius_0) == 0x000004, "Member 'B_SlowField_C_PassInfo::Radius_0' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_PassInfo, Activation_Delay_0) == 0x000008, "Member 'B_SlowField_C_PassInfo::Activation_Delay_0' has a wrong offset!");

// Function B_SlowField.B_SlowField_C.BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_SlowField.B_SlowField_C.BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'B_SlowField_C_BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
