#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SupplyDropPlacement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.ExecuteUbergraph_B_SupplyDropPlacement
// 0x01E0 (0x01E0 - 0x0000)
struct B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue10;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue11;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue12;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue13;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue14;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue15;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0050(0x0004)()
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Post_SupplyDrop_Impact_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x00C4(0x0004)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x00C8(0x0058)()
	float                                         K2Node_Event_Damage;                               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0124(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0148(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x01D0(0x000C)()
};
static_assert(alignof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement) == 0x000010, "Wrong alignment on B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement");
static_assert(sizeof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement) == 0x0001E0, "Wrong size on B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, EntryPoint) == 0x000000, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00000C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000010, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000014, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000018, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x00001C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x000020, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x000024, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue9) == 0x000028, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue10) == 0x00002C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue11) == 0x000030, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue11' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue12) == 0x000034, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue13) == 0x000038, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue13' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue14) == 0x00003C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue14' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Multiply_FloatFloat_ReturnValue15) == 0x000040, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Multiply_FloatFloat_ReturnValue15' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_Less_FloatFloat_ReturnValue) == 0x000044, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, Temp_bool_IsClosed_Variable) == 0x000045, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_InteractingPawn) == 0x000048, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_HasAuthority_ReturnValue) == 0x00004C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_K2_SetTimer_ReturnValue) == 0x000050, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, Temp_bool_IsClosed_Variable2) == 0x000054, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000090, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000094, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000098, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_FinishSpawningActor_ReturnValue) == 0x00009C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A0, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, Temp_bool_Has_Been_Initd_Variable2) == 0x0000A4, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000B4, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C0, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, CallFunc_K2_SetTimer_ReturnValue2) == 0x0000C4, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_MakeStruct_GameplayEventData) == 0x0000C8, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_Damage) == 0x000120, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_DamageTags) == 0x000124, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_Momentum) == 0x00013C, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_HitInfo) == 0x000148, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_InstigatedBy) == 0x0001C8, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_DamageCauser) == 0x0001CC, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement, K2Node_Event_EffectContext) == 0x0001D0, "Member 'B_SupplyDropPlacement_C_ExecuteUbergraph_B_SupplyDropPlacement::K2Node_Event_EffectContext' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct B_SupplyDropPlacement_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_SupplyDropPlacement_C_OnDeathServer) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_OnDeathServer");
static_assert(sizeof(B_SupplyDropPlacement_C_OnDeathServer) == 0x0000BC, "Wrong size on B_SupplyDropPlacement_C_OnDeathServer");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, Damage) == 0x000000, "Member 'B_SupplyDropPlacement_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, DamageTags) == 0x000004, "Member 'B_SupplyDropPlacement_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, Momentum) == 0x00001C, "Member 'B_SupplyDropPlacement_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, HitInfo) == 0x000028, "Member 'B_SupplyDropPlacement_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, InstigatedBy) == 0x0000A8, "Member 'B_SupplyDropPlacement_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, DamageCauser) == 0x0000AC, "Member 'B_SupplyDropPlacement_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnDeathServer, EffectContext) == 0x0000B0, "Member 'B_SupplyDropPlacement_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.BlueprintOnInteract
// 0x0004 (0x0004 - 0x0000)
struct B_SupplyDropPlacement_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SupplyDropPlacement_C_BlueprintOnInteract) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_BlueprintOnInteract");
static_assert(sizeof(B_SupplyDropPlacement_C_BlueprintOnInteract) == 0x000004, "Wrong size on B_SupplyDropPlacement_C_BlueprintOnInteract");
static_assert(offsetof(B_SupplyDropPlacement_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'B_SupplyDropPlacement_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.SpawnLoot
// 0x006C (0x006C - 0x0000)
struct B_SupplyDropPlacement_C_SpawnLoot final
{
public:
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue2;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue3;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SupplyDropPlacement_C_SpawnLoot) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_SpawnLoot");
static_assert(sizeof(B_SupplyDropPlacement_C_SpawnLoot) == 0x00006C, "Wrong size on B_SupplyDropPlacement_C_SpawnLoot");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, Temp_bool_Has_Been_Initd_Variable) == 0x000000, "Member 'B_SupplyDropPlacement_C_SpawnLoot::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, Temp_int_Variable) == 0x000004, "Member 'B_SupplyDropPlacement_C_SpawnLoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomFloat_ReturnValue) == 0x00000C, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomInteger_ReturnValue) == 0x000010, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, K2Node_SwitchInteger_CmpSuccess) == 0x000015, "Member 'B_SupplyDropPlacement_C_SpawnLoot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000016, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomInteger_ReturnValue2) == 0x000018, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomInteger_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, K2Node_SwitchInteger2_CmpSuccess) == 0x00001C, "Member 'B_SupplyDropPlacement_C_SpawnLoot::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, Temp_bool_IsClosed_Variable) == 0x00001D, "Member 'B_SupplyDropPlacement_C_SpawnLoot::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001E, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomInteger_ReturnValue3) == 0x000020, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomInteger_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, K2Node_SwitchInteger3_CmpSuccess) == 0x000024, "Member 'B_SupplyDropPlacement_C_SpawnLoot::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_RandomUnitVector_ReturnValue) == 0x00002C, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, K2Node_SwitchInteger4_CmpSuccess) == 0x00005C, "Member 'B_SupplyDropPlacement_C_SpawnLoot::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_SpawnLoot, CallFunc_Add_VectorVector_ReturnValue2) == 0x000060, "Member 'B_SupplyDropPlacement_C_SpawnLoot::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.UpdateLocation
// 0x0130 (0x0130 - 0x0000)
struct B_SupplyDropPlacement_C_UpdateLocation final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A8(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(B_SupplyDropPlacement_C_UpdateLocation) == 0x000010, "Wrong alignment on B_SupplyDropPlacement_C_UpdateLocation");
static_assert(sizeof(B_SupplyDropPlacement_C_UpdateLocation) == 0x000130, "Wrong size on B_SupplyDropPlacement_C_UpdateLocation");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, Time) == 0x000000, "Member 'B_SupplyDropPlacement_C_UpdateLocation::Time' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakTransform_Location) == 0x000040, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_X) == 0x000064, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_Y) == 0x000068, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_Z) == 0x00006C, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_X2) == 0x000074, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_Y2) == 0x000078, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_BreakVector_Z2) == 0x00007C, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_MakeVector_ReturnValue2) == 0x000090, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_VLerp_ReturnValue) == 0x00009C, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_UpdateLocation, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000A8, "Member 'B_SupplyDropPlacement_C_UpdateLocation::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.OnRep_bIsLooted
// 0x0014 (0x0014 - 0x0000)
struct B_SupplyDropPlacement_C_OnRep_bIsLooted final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SupplyDropPlacement_C_OnRep_bIsLooted) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_OnRep_bIsLooted");
static_assert(sizeof(B_SupplyDropPlacement_C_OnRep_bIsLooted) == 0x000014, "Wrong size on B_SupplyDropPlacement_C_OnRep_bIsLooted");
static_assert(offsetof(B_SupplyDropPlacement_C_OnRep_bIsLooted, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_SupplyDropPlacement_C_OnRep_bIsLooted::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnRep_bIsLooted, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'B_SupplyDropPlacement_C_OnRep_bIsLooted::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_OnRep_bIsLooted, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'B_SupplyDropPlacement_C_OnRep_bIsLooted::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.BlueprintCanInteract
// 0x0008 (0x0008 - 0x0000)
struct B_SupplyDropPlacement_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SupplyDropPlacement_C_BlueprintCanInteract) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_BlueprintCanInteract");
static_assert(sizeof(B_SupplyDropPlacement_C_BlueprintCanInteract) == 0x000008, "Wrong size on B_SupplyDropPlacement_C_BlueprintCanInteract");
static_assert(offsetof(B_SupplyDropPlacement_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'B_SupplyDropPlacement_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_BlueprintCanInteract, ReturnValue) == 0x000004, "Member 'B_SupplyDropPlacement_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");

// Function B_SupplyDropPlacement.B_SupplyDropPlacement_C.IsAcceptablePositionForPlacement
// 0x00FC (0x00FC - 0x0000)
struct B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FRotator                               InRotation;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class AFortDecoTool*                          DecoTool;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsCDO;                                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutFailureReason;                                  // 0x0020(0x000C)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0048(0x000C)()
	class FText                                   Temp_text_Variable2;                               // 0x0054(0x000C)()
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BoxTraceSingle_OutHit;                    // 0x006C(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingle_ReturnValue;               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x000C)()
};
static_assert(alignof(B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement) == 0x000004, "Wrong alignment on B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement");
static_assert(sizeof(B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement) == 0x0000FC, "Wrong size on B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement");
static_assert(offsetof(B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement, InLocation) == 0x000000, "Member 'B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement::InLocation' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement, InRotation) == 0x00000C, "Member 'B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement::InRotation' has a wrong offset!");
static_assert(offsetof(B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement, DecoTool) == 0x000018, "Member 'B_SupplyDropPlacement_C_IsAcceptablePositionForPlacement::DecoTool' has a wrong offset!");
