#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicStrokeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass BasicStrokeBox.BasicStrokeBox_C
// 0x0030 (0x0274 - 0x0244)
class UBasicStrokeBox_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseMaterial;                                      // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UNamedSlot*                             Content;                                           // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FLinearColor                           fill;                                              // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Stroke;                                            // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Style;                                             // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BasicStrokeBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Redraw();
	void Customize(int32 Shape_Style, const struct FLinearColor& Fill_Color, const struct FLinearColor& Stroke_Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BasicStrokeBox_C">();
	}
	static class UBasicStrokeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicStrokeBox_C>();
	}
};
static_assert(alignof(UBasicStrokeBox_C) == 0x000004, "Wrong alignment on UBasicStrokeBox_C");
static_assert(sizeof(UBasicStrokeBox_C) == 0x000274, "Wrong size on UBasicStrokeBox_C");
static_assert(offsetof(UBasicStrokeBox_C, UberGraphFrame) == 0x000244, "Member 'UBasicStrokeBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBasicStrokeBox_C, BaseMaterial) == 0x000248, "Member 'UBasicStrokeBox_C::BaseMaterial' has a wrong offset!");
static_assert(offsetof(UBasicStrokeBox_C, Content) == 0x00024C, "Member 'UBasicStrokeBox_C::Content' has a wrong offset!");
static_assert(offsetof(UBasicStrokeBox_C, fill) == 0x000250, "Member 'UBasicStrokeBox_C::fill' has a wrong offset!");
static_assert(offsetof(UBasicStrokeBox_C, Stroke) == 0x000260, "Member 'UBasicStrokeBox_C::Stroke' has a wrong offset!");
static_assert(offsetof(UBasicStrokeBox_C, Style) == 0x000270, "Member 'UBasicStrokeBox_C::Style' has a wrong offset!");

}

#pragma pack(pop)
