#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x02E0 (0x0720 - 0x0440)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F; // 0x0444(0x0098)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D; // 0x04DC(0x0098)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0; // 0x0574(0x0098)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC; // 0x060C(0x0098)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E; // 0x06A4(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7; // 0x06D0(0x002C)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF; // 0x06FC(0x0020)()

public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blueprint_Paper_VIM_C">();
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};
static_assert(alignof(UBlueprint_Paper_VIM_C) == 0x000010, "Wrong alignment on UBlueprint_Paper_VIM_C");
static_assert(sizeof(UBlueprint_Paper_VIM_C) == 0x000720, "Wrong size on UBlueprint_Paper_VIM_C");
static_assert(offsetof(UBlueprint_Paper_VIM_C, UberGraphFrame) == 0x000440, "Member 'UBlueprint_Paper_VIM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F) == 0x000444, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D) == 0x0004DC, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0) == 0x000574, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC) == 0x00060C, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E) == 0x0006A4, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7) == 0x0006D0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF) == 0x0006FC, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF' has a wrong offset!");

}

#pragma pack(pop)
