#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetSleepLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BTTask_GetSleepLocation.BTTask_GetSleepLocation_C.ExecuteUbergraph_BTTask_GetSleepLocation
// 0x001C (0x001C - 0x0000)
struct BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation) == 0x000004, "Wrong alignment on BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation");
static_assert(sizeof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation) == 0x00001C, "Wrong size on BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, EntryPoint) == 0x000000, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, K2Node_Event_OwnerActor) == 0x000004, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, K2Node_DynamicCast_AsFort_AIController) == 0x000008, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000D, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BTTask_GetSleepLocation_C_ExecuteUbergraph_BTTask_GetSleepLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BTTask_GetSleepLocation.BTTask_GetSleepLocation_C.ReceiveExecute
// 0x0004 (0x0004 - 0x0000)
struct BTTask_GetSleepLocation_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_GetSleepLocation_C_ReceiveExecute) == 0x000004, "Wrong alignment on BTTask_GetSleepLocation_C_ReceiveExecute");
static_assert(sizeof(BTTask_GetSleepLocation_C_ReceiveExecute) == 0x000004, "Wrong size on BTTask_GetSleepLocation_C_ReceiveExecute");
static_assert(offsetof(BTTask_GetSleepLocation_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTTask_GetSleepLocation_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

#pragma pack(pop)
