#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingLevelWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BuildingLevelWidget.BuildingLevelWidget_C.ExecuteUbergraph_BuildingLevelWidget
// 0x0004 (0x0004 - 0x0000)
struct BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget) == 0x000004, "Wrong alignment on BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget");
static_assert(sizeof(BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget) == 0x000004, "Wrong size on BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget");
static_assert(offsetof(BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget, EntryPoint) == 0x000000, "Member 'BuildingLevelWidget_C_ExecuteUbergraph_BuildingLevelWidget::EntryPoint' has a wrong offset!");

// Function BuildingLevelWidget.BuildingLevelWidget_C.Set Level
// 0x0004 (0x0004 - 0x0000)
struct BuildingLevelWidget_C_Set_Level final
{
public:
	int32                                         New_Level;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingLevelWidget_C_Set_Level) == 0x000004, "Wrong alignment on BuildingLevelWidget_C_Set_Level");
static_assert(sizeof(BuildingLevelWidget_C_Set_Level) == 0x000004, "Wrong size on BuildingLevelWidget_C_Set_Level");
static_assert(offsetof(BuildingLevelWidget_C_Set_Level, New_Level) == 0x000000, "Member 'BuildingLevelWidget_C_Set_Level::New_Level' has a wrong offset!");

// Function BuildingLevelWidget.BuildingLevelWidget_C.Set Brush Size
// 0x0001 (0x0001 - 0x0000)
struct BuildingLevelWidget_C_Set_Brush_Size final
{
public:
	EFortBrushSize                                New_Size;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingLevelWidget_C_Set_Brush_Size) == 0x000001, "Wrong alignment on BuildingLevelWidget_C_Set_Brush_Size");
static_assert(sizeof(BuildingLevelWidget_C_Set_Brush_Size) == 0x000001, "Wrong size on BuildingLevelWidget_C_Set_Brush_Size");
static_assert(offsetof(BuildingLevelWidget_C_Set_Brush_Size, New_Size) == 0x000000, "Member 'BuildingLevelWidget_C_Set_Brush_Size::New_Size' has a wrong offset!");

// Function BuildingLevelWidget.BuildingLevelWidget_C.Update
// 0x0334 (0x0334 - 0x0000)
struct BuildingLevelWidget_C_Update final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortMultiSizeBrush                    CallFunc_Array_Get_Item;                           // 0x0008(0x02B8)()
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x02C0(0x0074)(ConstParm)
};
static_assert(alignof(BuildingLevelWidget_C_Update) == 0x000004, "Wrong alignment on BuildingLevelWidget_C_Update");
static_assert(sizeof(BuildingLevelWidget_C_Update) == 0x000334, "Wrong size on BuildingLevelWidget_C_Update");
static_assert(offsetof(BuildingLevelWidget_C_Update, CallFunc_Array_LastIndex_ReturnValue) == 0x000000, "Member 'BuildingLevelWidget_C_Update::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingLevelWidget_C_Update, CallFunc_Clamp_ReturnValue) == 0x000004, "Member 'BuildingLevelWidget_C_Update::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingLevelWidget_C_Update, CallFunc_Array_Get_Item) == 0x000008, "Member 'BuildingLevelWidget_C_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BuildingLevelWidget_C_Update, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x0002C0, "Member 'BuildingLevelWidget_C_Update::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
