#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingLevelWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass BuildingLevelWidget.BuildingLevelWidget_C
// 0x001C (0x0260 - 0x0244)
class UBuildingLevelWidget_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<struct FFortMultiSizeBrush>            StarIcon;                                          // 0x024C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Level;                                             // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                Brush_Size;                                        // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BuildingLevelWidget(int32 EntryPoint);
	void Construct();
	void Set_Level(int32 New_Level);
	void Set_Brush_Size(EFortBrushSize New_Size);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuildingLevelWidget_C">();
	}
	static class UBuildingLevelWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingLevelWidget_C>();
	}
};
static_assert(alignof(UBuildingLevelWidget_C) == 0x000004, "Wrong alignment on UBuildingLevelWidget_C");
static_assert(sizeof(UBuildingLevelWidget_C) == 0x000260, "Wrong size on UBuildingLevelWidget_C");
static_assert(offsetof(UBuildingLevelWidget_C, UberGraphFrame) == 0x000244, "Member 'UBuildingLevelWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuildingLevelWidget_C, Icon) == 0x000248, "Member 'UBuildingLevelWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UBuildingLevelWidget_C, StarIcon) == 0x00024C, "Member 'UBuildingLevelWidget_C::StarIcon' has a wrong offset!");
static_assert(offsetof(UBuildingLevelWidget_C, Level) == 0x000258, "Member 'UBuildingLevelWidget_C::Level' has a wrong offset!");
static_assert(offsetof(UBuildingLevelWidget_C, Brush_Size) == 0x00025C, "Member 'UBuildingLevelWidget_C::Brush_Size' has a wrong offset!");

}

#pragma pack(pop)
