#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BuildingTooltip.BuildingTooltip_C.ExecuteUbergraph_BuildingTooltip
// 0x0004 (0x0004 - 0x0000)
struct BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip) == 0x000004, "Wrong alignment on BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip");
static_assert(sizeof(BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip) == 0x000004, "Wrong size on BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip");
static_assert(offsetof(BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip, EntryPoint) == 0x000000, "Member 'BuildingTooltip_C_ExecuteUbergraph_BuildingTooltip::EntryPoint' has a wrong offset!");

// Function BuildingTooltip.BuildingTooltip_C.Set Visible
// 0x0005 (0x0005 - 0x0000)
struct BuildingTooltip_C_Set_Visible final
{
public:
	bool                                          In_Visible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingTooltip_C_Set_Visible) == 0x000001, "Wrong alignment on BuildingTooltip_C_Set_Visible");
static_assert(sizeof(BuildingTooltip_C_Set_Visible) == 0x000005, "Wrong size on BuildingTooltip_C_Set_Visible");
static_assert(offsetof(BuildingTooltip_C_Set_Visible, In_Visible) == 0x000000, "Member 'BuildingTooltip_C_Set_Visible::In_Visible' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_Set_Visible, Temp_byte_Variable) == 0x000001, "Member 'BuildingTooltip_C_Set_Visible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_Set_Visible, Temp_byte_Variable2) == 0x000002, "Member 'BuildingTooltip_C_Set_Visible::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_Set_Visible, Temp_bool_Variable) == 0x000003, "Member 'BuildingTooltip_C_Set_Visible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_Set_Visible, K2Node_Select_Default) == 0x000004, "Member 'BuildingTooltip_C_Set_Visible::K2Node_Select_Default' has a wrong offset!");

// Function BuildingTooltip.BuildingTooltip_C.GetGadget
// 0x0020 (0x0020 - 0x0000)
struct BuildingTooltip_C_GetGadget final
{
public:
	class UHomeBaseBuilding*                      Building;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortItemDefinition*                    ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForLevel_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGadgetItemDefinition*              CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    Gadget;                                            // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingTooltip_C_GetGadget) == 0x000004, "Wrong alignment on BuildingTooltip_C_GetGadget");
static_assert(sizeof(BuildingTooltip_C_GetGadget) == 0x000020, "Wrong size on BuildingTooltip_C_GetGadget");
static_assert(offsetof(BuildingTooltip_C_GetGadget, Building) == 0x000000, "Member 'BuildingTooltip_C_GetGadget::Building' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, ReturnValue) == 0x000004, "Member 'BuildingTooltip_C_GetGadget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, CallFunc_GetAbilityKitForLevel_ReturnValue) == 0x000008, "Member 'BuildingTooltip_C_GetGadget::CallFunc_GetAbilityKitForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BuildingTooltip_C_GetGadget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BuildingTooltip_C_GetGadget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, CallFunc_Array_Get_Item) == 0x000014, "Member 'BuildingTooltip_C_GetGadget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BuildingTooltip_C_GetGadget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_GetGadget, Gadget) == 0x00001C, "Member 'BuildingTooltip_C_GetGadget::Gadget' has a wrong offset!");

// Function BuildingTooltip.BuildingTooltip_C.SetupTooltip
// 0x01F8 (0x01F8 - 0x0000)
struct BuildingTooltip_C_SetupTooltip final
{
public:
	class FString                                 InBuildingTemplateId;                              // 0x0000(0x000C)(Parm, ZeroConstructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfo_Result;                   // 0x0018(0x011C)()
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHomeBaseMainBuilding*                  CallFunc_GetBuilding_ReturnValue;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHomeBaseMainBuilding*                  CallFunc_GetBuilding_ReturnValue2;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortItemDefinition*                    CallFunc_GetGadget_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0150(0x000C)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIconBrush_IconBrush;                   // 0x0160(0x0074)()
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForLevel_ReturnValue;        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FText>                           CallFunc_GetDescription_ReturnValue;               // 0x01DC(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x01E8(0x000C)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuildingTooltip_C_SetupTooltip) == 0x000004, "Wrong alignment on BuildingTooltip_C_SetupTooltip");
static_assert(sizeof(BuildingTooltip_C_SetupTooltip) == 0x0001F8, "Wrong size on BuildingTooltip_C_SetupTooltip");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, InBuildingTemplateId) == 0x000000, "Member 'BuildingTooltip_C_SetupTooltip::InBuildingTemplateId' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_byte_Variable) == 0x00000C, "Member 'BuildingTooltip_C_SetupTooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_byte_Variable2) == 0x00000D, "Member 'BuildingTooltip_C_SetupTooltip::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_bool_Variable) == 0x000014, "Member 'BuildingTooltip_C_SetupTooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetHomeBaseInfo_Result) == 0x000018, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetHomeBaseInfo_Result' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetContext_ReturnValue2) == 0x000134, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000138, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_byte_Variable3) == 0x00013A, "Member 'BuildingTooltip_C_SetupTooltip::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_byte_Variable4) == 0x00013B, "Member 'BuildingTooltip_C_SetupTooltip::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, Temp_bool_Variable2) == 0x00013C, "Member 'BuildingTooltip_C_SetupTooltip::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, K2Node_Select_Default) == 0x00013D, "Member 'BuildingTooltip_C_SetupTooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetContext_ReturnValue3) == 0x000140, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetBuilding_ReturnValue) == 0x000144, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetBuilding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetBuilding_ReturnValue2) == 0x000148, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetBuilding_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetGadget_ReturnValue) == 0x00014C, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetGadget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetDisplayName_ReturnValue) == 0x000150, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_IsValid_ReturnValue2) == 0x00015C, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_TextIsEmpty_ReturnValue) == 0x00015D, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetIconBrush_IconBrush) == 0x000160, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetIconBrush_IconBrush' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_IsValid_ReturnValue3) == 0x0001D4, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetAbilityKitForLevel_ReturnValue) == 0x0001D8, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetAbilityKitForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_GetDescription_ReturnValue) == 0x0001DC, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F4, "Member 'BuildingTooltip_C_SetupTooltip::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingTooltip_C_SetupTooltip, K2Node_Select2_Default) == 0x0001F5, "Member 'BuildingTooltip_C_SetupTooltip::K2Node_Select2_Default' has a wrong offset!");

}

#pragma pack(pop)
