#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommanderRewardsShell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass CommanderRewardsShell.CommanderRewardsShell_C
// 0x0014 (0x0258 - 0x0244)
class UCommanderRewardsShell_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Max_Text;                                          // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         Rewards_HBox;                                      // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	int32                                         StartLevel;                                        // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         EndLevel;                                          // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CommanderRewardsShell(int32 EntryPoint);
	void Construct();
	void Init();
	void CreateLevelBox(int32 InLevel, bool isFirstLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommanderRewardsShell_C">();
	}
	static class UCommanderRewardsShell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommanderRewardsShell_C>();
	}
};
static_assert(alignof(UCommanderRewardsShell_C) == 0x000004, "Wrong alignment on UCommanderRewardsShell_C");
static_assert(sizeof(UCommanderRewardsShell_C) == 0x000258, "Wrong size on UCommanderRewardsShell_C");
static_assert(offsetof(UCommanderRewardsShell_C, UberGraphFrame) == 0x000244, "Member 'UCommanderRewardsShell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommanderRewardsShell_C, Max_Text) == 0x000248, "Member 'UCommanderRewardsShell_C::Max_Text' has a wrong offset!");
static_assert(offsetof(UCommanderRewardsShell_C, Rewards_HBox) == 0x00024C, "Member 'UCommanderRewardsShell_C::Rewards_HBox' has a wrong offset!");
static_assert(offsetof(UCommanderRewardsShell_C, StartLevel) == 0x000250, "Member 'UCommanderRewardsShell_C::StartLevel' has a wrong offset!");
static_assert(offsetof(UCommanderRewardsShell_C, EndLevel) == 0x000254, "Member 'UCommanderRewardsShell_C::EndLevel' has a wrong offset!");

}

#pragma pack(pop)
