#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommanderRewardsLevelBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function CommanderRewardsLevelBox.CommanderRewardsLevelBox_C.ExecuteUbergraph_CommanderRewardsLevelBox
// 0x00A0 (0x00A0 - 0x0000)
struct CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x000C)()
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0018)()
	TArray<struct FFortItemQuantityPair>          CallFunc_GetAccountLevelUpRewards_Rewards;         // 0x0030(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x003C(0x000C)(ZeroConstructor, ReferenceParm)
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item;                           // 0x0048(0x001C)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0064(0x000C)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommanderLevelRewardItem_C*            CallFunc_Create_ReturnValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox) == 0x000004, "Wrong alignment on CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox");
static_assert(sizeof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox) == 0x0000A0, "Wrong size on CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, EntryPoint) == 0x000000, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_GetContext_ReturnValue) == 0x000014, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_GetAccountLevelUpRewards_Rewards) == 0x000030, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_GetAccountLevelUpRewards_Rewards' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, K2Node_MakeArray_Array) == 0x00003C, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Array_Get_Item) == 0x000048, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Format_ReturnValue) == 0x000064, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Array_Length_ReturnValue2) == 0x000074, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Create_ReturnValue) == 0x000080, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_AddChild_ReturnValue) == 0x000084, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, Temp_bool_Variable) == 0x00008C, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Less_IntInt_ReturnValue) == 0x00008D, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, Temp_object_Variable) == 0x000094, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, Temp_object_Variable2) == 0x000098, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox, K2Node_Select_Default) == 0x00009C, "Member 'CommanderRewardsLevelBox_C_ExecuteUbergraph_CommanderRewardsLevelBox::K2Node_Select_Default' has a wrong offset!");

}

#pragma pack(pop)
