#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmationWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass ConfirmationWindow.ConfirmationWindow_C
// 0x0020 (0x02D8 - 0x02B8)
class UConfirmationWindow_C final : public UFortConfirmationWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AdditionalContentBox;                              // 0x02BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         Button_Area;                                       // 0x02C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      Button_Confirm;                                    // 0x02C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      Button_Decline;                                    // 0x02C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             HeaderText;                                        // 0x02CC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             MessageText;                                       // 0x02D0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	uint8                                         ConfirmationType;                                  // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConfirmationWindow(int32 EntryPoint);
	void BndEvt__Button_Decline_K2Node_ComponentBoundEvent_951_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt__Button_Confirm_K2Node_ComponentBoundEvent_940_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void OnKill();
	void OnShow();
	void UpdateButton(class UButtonIconText_C* Button, const class FText& TEXT);
	void UpdateTimer(float Display_Time);
	void HandleTimedOut();
	void OnHandleAction(struct FEventReply* Result, bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConfirmationWindow_C">();
	}
	static class UConfirmationWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfirmationWindow_C>();
	}
};
static_assert(alignof(UConfirmationWindow_C) == 0x000004, "Wrong alignment on UConfirmationWindow_C");
static_assert(sizeof(UConfirmationWindow_C) == 0x0002D8, "Wrong size on UConfirmationWindow_C");
static_assert(offsetof(UConfirmationWindow_C, UberGraphFrame) == 0x0002B8, "Member 'UConfirmationWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, AdditionalContentBox) == 0x0002BC, "Member 'UConfirmationWindow_C::AdditionalContentBox' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, Button_Area) == 0x0002C0, "Member 'UConfirmationWindow_C::Button_Area' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, Button_Confirm) == 0x0002C4, "Member 'UConfirmationWindow_C::Button_Confirm' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, Button_Decline) == 0x0002C8, "Member 'UConfirmationWindow_C::Button_Decline' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, HeaderText) == 0x0002CC, "Member 'UConfirmationWindow_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, MessageText) == 0x0002D0, "Member 'UConfirmationWindow_C::MessageText' has a wrong offset!");
static_assert(offsetof(UConfirmationWindow_C, ConfirmationType) == 0x0002D4, "Member 'UConfirmationWindow_C::ConfirmationType' has a wrong offset!");

}

#pragma pack(pop)
