#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class Engine.InterpTrack
// 0x002C (0x0048 - 0x001C)
class UInterpTrack : public UObject
{
public:
	uint8                                         Pad_1C[0x8];                                       // 0x001C(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInterpTrack*>                   SubTracks;                                         // 0x0024(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UInterpTrackInst>           TrackInstClass;                                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrackActiveCondition                         ActiveCondition;                                   // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TrackTitle;                                        // 0x0038(0x000C)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOnePerGroup : 1;                                  // 0x0044(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bDirGroupOnly : 1;                                 // 0x0044(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bDisableTrack : 1;                                 // 0x0044(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPrivate))
	uint8                                         bIsSelected : 1;                                   // 0x0044(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPrivate))
	uint8                                         bIsAnimControlTrack : 1;                           // 0x0044(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bSubTrackOnly : 1;                                 // 0x0044(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bVisible : 1;                                      // 0x0044(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bIsRecording : 1;                                  // 0x0044(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpTrack">();
	}
	static class UInterpTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpTrack>();
	}
};
static_assert(alignof(UInterpTrack) == 0x000004, "Wrong alignment on UInterpTrack");
static_assert(sizeof(UInterpTrack) == 0x000048, "Wrong size on UInterpTrack");
static_assert(offsetof(UInterpTrack, SubTracks) == 0x000024, "Member 'UInterpTrack::SubTracks' has a wrong offset!");
static_assert(offsetof(UInterpTrack, TrackInstClass) == 0x000030, "Member 'UInterpTrack::TrackInstClass' has a wrong offset!");
static_assert(offsetof(UInterpTrack, ActiveCondition) == 0x000034, "Member 'UInterpTrack::ActiveCondition' has a wrong offset!");
static_assert(offsetof(UInterpTrack, TrackTitle) == 0x000038, "Member 'UInterpTrack::TrackTitle' has a wrong offset!");

// Class Engine.InterpTrackFloatBase
// 0x0018 (0x0060 - 0x0048)
class UInterpTrackFloatBase : public UInterpTrack
{
public:
	struct FInterpCurveFloat                      FloatTrack;                                        // 0x0048(0x0014)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CurveTension;                                      // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpTrackFloatBase">();
	}
	static class UInterpTrackFloatBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpTrackFloatBase>();
	}
};
static_assert(alignof(UInterpTrackFloatBase) == 0x000004, "Wrong alignment on UInterpTrackFloatBase");
static_assert(sizeof(UInterpTrackFloatBase) == 0x000060, "Wrong size on UInterpTrackFloatBase");
static_assert(offsetof(UInterpTrackFloatBase, FloatTrack) == 0x000048, "Member 'UInterpTrackFloatBase::FloatTrack' has a wrong offset!");
static_assert(offsetof(UInterpTrackFloatBase, CurveTension) == 0x00005C, "Member 'UInterpTrackFloatBase::CurveTension' has a wrong offset!");

// Class Engine.InterpTrackFade
// 0x0014 (0x0074 - 0x0060)
class UInterpTrackFade final : public UInterpTrackFloatBase
{
public:
	uint8                                         bPersistFade : 1;                                  // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bFadeAudio : 1;                                    // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FadeColor;                                         // 0x0064(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpTrackFade">();
	}
	static class UInterpTrackFade* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpTrackFade>();
	}
};
static_assert(alignof(UInterpTrackFade) == 0x000004, "Wrong alignment on UInterpTrackFade");
static_assert(sizeof(UInterpTrackFade) == 0x000074, "Wrong size on UInterpTrackFade");
static_assert(offsetof(UInterpTrackFade, FadeColor) == 0x000064, "Member 'UInterpTrackFade::FadeColor' has a wrong offset!");

// Class Engine.Actor
// 0x0224 (0x0240 - 0x001C)
class AActor : public UObject
{
public:
	struct FActorTickFunction                     PrimaryActorTick;                                  // 0x001C(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         CustomTimeDilation;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHidden : 1;                                       // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bNetTemporary : 1;                                 // 0x0058(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bNetStartup : 1;                                   // 0x0058(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bOnlyRelevantToOwner : 1;                          // 0x0058(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysRelevant : 1;                               // 0x0058(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bReplicateMovement : 1;                            // 0x0058(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bTearOff : 1;                                      // 0x0058(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Net, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bExchangedRoles : 1;                               // 0x0058(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bPendingNetUpdate : 1;                             // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bNetLoadOnClient : 1;                              // 0x0059(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bNetUseOwnerRelevancy : 1;                         // 0x0059(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bBlockInput : 1;                                   // 0x0059(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         BitPad_59_4 : 1;                                   // 0x0059(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bAllowTickBeforeBeginPlay : 1;                     // 0x0059(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         BitPad_59_6 : 2;                                   // 0x0059(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         bActorEnableCollision : 1;                         // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_5A_1 : 1;                                   // 0x005A(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bReplicates : 1;                                   // 0x005A(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected))
	ENetRole                                      RemoteRole;                                        // 0x005B(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 Owner;                                             // 0x005C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRepMovement                           ReplicatedMovement;                                // 0x0060(0x0034)(Edit, Net, DisableEditOnInstance, RepNotify, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FRepAttachment                         AttachmentReplication;                             // 0x0094(0x0034)(Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ENetRole                                      Role;                                              // 0x00C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x1];                                       // 0x00C9(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EAutoReceiveInput                             AutoReceiveInput;                                  // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputPriority;                                     // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputComponent*                        InputComponent;                                    // 0x00D0(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputConsumeOptions                          InputConsumeOption;                                // 0x00D4(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetCullDistanceSquared;                            // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetTag;                                            // 0x00DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetUpdateTime;                                     // 0x00E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetUpdateFrequency;                                // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNetUpdateFrequency;                             // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetPriority;                                       // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastNetUpdateTime;                                 // 0x00F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NetDriverName;                                     // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroyWhenFinished : 1;                      // 0x00FC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bCanBeDamaged : 1;                                 // 0x00FC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, Net, SaveGame, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bActorIsBeingDestroyed : 1;                        // 0x00FC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPrivate))
	uint8                                         bCollideWhenPlacing : 1;                           // 0x00FC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bFindCameraComponentWhenViewTarget : 1;            // 0x00FC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bRelevantForNetworkReplays : 1;                    // 0x00FC(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	ESpawnActorCollisionHandlingMethod            SpawnCollisionHandlingMethod;                      // 0x00FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x6];                                       // 0x00FE(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Instigator;                                        // 0x0104(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Children;                                          // 0x0108(0x000C)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class USceneComponent*                        RootComponent;                                     // 0x0114(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AMatineeActor*>                  ControllingMatineeActors;                          // 0x0118(0x000C)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         InitialLifeSpan;                                   // 0x0124(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x4];                                      // 0x0128(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Layers;                                            // 0x012C(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ParentComponentActor;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         bAllowReceiveTickEventOnDedicatedServer : 1;       // 0x0140(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         BitPad_140_1 : 3;                                  // 0x0140(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bActorSeamlessTraveled : 1;                        // 0x0140(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bIgnoresOriginShifting : 1;                        // 0x0140(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bEnableAutoLODGeneration : 1;                      // 0x0140(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tags;                                              // 0x0144(0x000C)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint64                                        HiddenEditorViews;                                 // 0x0150(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTakeAnyDamage;                                   // 0x0158(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTakePointDamage;                                 // 0x0164(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorBeginOverlap;                               // 0x0170(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorEndOverlap;                                 // 0x017C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnBeginCursorOver;                                 // 0x0188(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEndCursorOver;                                   // 0x0194(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x01A0(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnReleased;                                        // 0x01AC(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchBegin;                                 // 0x01B8(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchEnd;                                   // 0x01C4(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchEnter;                                 // 0x01D0(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchLeave;                                 // 0x01DC(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorHit;                                        // 0x01E8(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDestroyed;                                       // 0x01F4(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEndPlay;                                         // 0x0200(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x18];                                     // 0x020C(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                BlueprintCreatedComponents;                        // 0x0224(0x000C)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                InstanceComponents;                                // 0x0230(0x000C)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UActorComponent* AddComponent(class FName TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, const class UObject* ComponentTemplateContext);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void DisableInput(class APlayerController* PlayerController);
	void EnableInput(class APlayerController* PlayerController);
	void FlushNetDormancy();
	void ForceNetUpdate();
	class UActorComponent* GetComponentByClass(TSubclassOf<class UActorComponent> ComponentClass);
	bool GetTickableWhenPaused();
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, class FName InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AActor* InParentActor, class FName InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_DestroyActor();
	void K2_DestroyComponent(class UActorComponent* Component);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnReset();
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, class FName Tag);
	void OnRep_AttachmentReplication();
	void OnRep_Instigator();
	void OnRep_Owner();
	void OnRep_ReplicatedMovement();
	void OnRep_ReplicateMovement();
	void ReceiveActorBeginCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorOnClicked();
	void ReceiveActorOnInputTouchBegin(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnd(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnter(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchLeave(const ETouchIndex FingerIndex);
	void ReceiveActorOnReleased();
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveTick(float DeltaSeconds);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	bool SetActorRotation(const struct FRotator& NewRotation);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorTickEnabled(bool bEnabled);
	void SetLifeSpan(float InLifespan);
	void SetOwner(class AActor* NewOwner);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetReplicates(bool bInReplicates);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetTickGroup(ETickingGroup NewTickGroup);
	void SnapRootComponentTo(class AActor* InParentActor, class FName InSocketName);
	void TearOff();
	void UserConstructionScript();

	bool ActorHasTag(class FName Tag) const;
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent) const;
	bool GetActorEnableCollision() const;
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation) const;
	struct FVector GetActorForwardVector() const;
	struct FVector GetActorRelativeScale3D() const;
	struct FVector GetActorRightVector() const;
	struct FVector GetActorScale3D() const;
	float GetActorTimeDilation() const;
	struct FVector GetActorUpVector() const;
	void GetAttachedActors(TArray<class AActor*>* OutActors) const;
	TArray<class UActorComponent*> GetComponentsByClass(TSubclassOf<class UActorComponent> ComponentClass) const;
	TArray<class UActorComponent*> GetComponentsByTag(TSubclassOf<class UActorComponent> ComponentClass, class FName Tag) const;
	float GetDistanceTo(const class AActor* OtherActor) const;
	float GetDotProductTo(const class AActor* OtherActor) const;
	float GetHorizontalDistanceTo(const class AActor* OtherActor) const;
	float GetHorizontalDotProductTo(const class AActor* OtherActor) const;
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey) const;
	float GetInputAxisValue(const class FName InputAxisName) const;
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey) const;
	class APawn* GetInstigator() const;
	class AController* GetInstigatorController() const;
	float GetLifeSpan() const;
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, class UClass* ClassFilter) const;
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents) const;
	class AActor* GetOwner() const;
	float GetSquaredDistanceTo(const class AActor* OtherActor) const;
	struct FTransform GetTransform() const;
	struct FVector GetVelocity() const;
	float GetVerticalDistanceTo(const class AActor* OtherActor) const;
	bool HasAuthority() const;
	bool IsActorBeingDestroyed() const;
	bool IsActorTickEnabled() const;
	bool IsOverlappingActor(const class AActor* Other) const;
	struct FVector K2_GetActorLocation() const;
	struct FRotator K2_GetActorRotation() const;
	class USceneComponent* K2_GetRootComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Actor">();
	}
	static class AActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActor>();
	}
};
static_assert(alignof(AActor) == 0x000004, "Wrong alignment on AActor");
static_assert(sizeof(AActor) == 0x000240, "Wrong size on AActor");
static_assert(offsetof(AActor, PrimaryActorTick) == 0x00001C, "Member 'AActor::PrimaryActorTick' has a wrong offset!");
static_assert(offsetof(AActor, CustomTimeDilation) == 0x000054, "Member 'AActor::CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(AActor, RemoteRole) == 0x00005B, "Member 'AActor::RemoteRole' has a wrong offset!");
static_assert(offsetof(AActor, Owner) == 0x00005C, "Member 'AActor::Owner' has a wrong offset!");
static_assert(offsetof(AActor, ReplicatedMovement) == 0x000060, "Member 'AActor::ReplicatedMovement' has a wrong offset!");
static_assert(offsetof(AActor, AttachmentReplication) == 0x000094, "Member 'AActor::AttachmentReplication' has a wrong offset!");
static_assert(offsetof(AActor, Role) == 0x0000C8, "Member 'AActor::Role' has a wrong offset!");
static_assert(offsetof(AActor, AutoReceiveInput) == 0x0000CA, "Member 'AActor::AutoReceiveInput' has a wrong offset!");
static_assert(offsetof(AActor, InputPriority) == 0x0000CC, "Member 'AActor::InputPriority' has a wrong offset!");
static_assert(offsetof(AActor, InputComponent) == 0x0000D0, "Member 'AActor::InputComponent' has a wrong offset!");
static_assert(offsetof(AActor, InputConsumeOption) == 0x0000D4, "Member 'AActor::InputConsumeOption' has a wrong offset!");
static_assert(offsetof(AActor, NetCullDistanceSquared) == 0x0000D8, "Member 'AActor::NetCullDistanceSquared' has a wrong offset!");
static_assert(offsetof(AActor, NetTag) == 0x0000DC, "Member 'AActor::NetTag' has a wrong offset!");
static_assert(offsetof(AActor, NetUpdateTime) == 0x0000E0, "Member 'AActor::NetUpdateTime' has a wrong offset!");
static_assert(offsetof(AActor, NetUpdateFrequency) == 0x0000E4, "Member 'AActor::NetUpdateFrequency' has a wrong offset!");
static_assert(offsetof(AActor, MinNetUpdateFrequency) == 0x0000E8, "Member 'AActor::MinNetUpdateFrequency' has a wrong offset!");
static_assert(offsetof(AActor, NetPriority) == 0x0000EC, "Member 'AActor::NetPriority' has a wrong offset!");
static_assert(offsetof(AActor, LastNetUpdateTime) == 0x0000F0, "Member 'AActor::LastNetUpdateTime' has a wrong offset!");
static_assert(offsetof(AActor, NetDriverName) == 0x0000F4, "Member 'AActor::NetDriverName' has a wrong offset!");
static_assert(offsetof(AActor, SpawnCollisionHandlingMethod) == 0x0000FD, "Member 'AActor::SpawnCollisionHandlingMethod' has a wrong offset!");
static_assert(offsetof(AActor, Instigator) == 0x000104, "Member 'AActor::Instigator' has a wrong offset!");
static_assert(offsetof(AActor, Children) == 0x000108, "Member 'AActor::Children' has a wrong offset!");
static_assert(offsetof(AActor, RootComponent) == 0x000114, "Member 'AActor::RootComponent' has a wrong offset!");
static_assert(offsetof(AActor, ControllingMatineeActors) == 0x000118, "Member 'AActor::ControllingMatineeActors' has a wrong offset!");
static_assert(offsetof(AActor, InitialLifeSpan) == 0x000124, "Member 'AActor::InitialLifeSpan' has a wrong offset!");
static_assert(offsetof(AActor, Layers) == 0x00012C, "Member 'AActor::Layers' has a wrong offset!");
static_assert(offsetof(AActor, ParentComponentActor) == 0x000138, "Member 'AActor::ParentComponentActor' has a wrong offset!");
static_assert(offsetof(AActor, Tags) == 0x000144, "Member 'AActor::Tags' has a wrong offset!");
static_assert(offsetof(AActor, HiddenEditorViews) == 0x000150, "Member 'AActor::HiddenEditorViews' has a wrong offset!");
static_assert(offsetof(AActor, OnTakeAnyDamage) == 0x000158, "Member 'AActor::OnTakeAnyDamage' has a wrong offset!");
static_assert(offsetof(AActor, OnTakePointDamage) == 0x000164, "Member 'AActor::OnTakePointDamage' has a wrong offset!");
static_assert(offsetof(AActor, OnActorBeginOverlap) == 0x000170, "Member 'AActor::OnActorBeginOverlap' has a wrong offset!");
static_assert(offsetof(AActor, OnActorEndOverlap) == 0x00017C, "Member 'AActor::OnActorEndOverlap' has a wrong offset!");
static_assert(offsetof(AActor, OnBeginCursorOver) == 0x000188, "Member 'AActor::OnBeginCursorOver' has a wrong offset!");
static_assert(offsetof(AActor, OnEndCursorOver) == 0x000194, "Member 'AActor::OnEndCursorOver' has a wrong offset!");
static_assert(offsetof(AActor, OnClicked) == 0x0001A0, "Member 'AActor::OnClicked' has a wrong offset!");
static_assert(offsetof(AActor, OnReleased) == 0x0001AC, "Member 'AActor::OnReleased' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchBegin) == 0x0001B8, "Member 'AActor::OnInputTouchBegin' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchEnd) == 0x0001C4, "Member 'AActor::OnInputTouchEnd' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchEnter) == 0x0001D0, "Member 'AActor::OnInputTouchEnter' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchLeave) == 0x0001DC, "Member 'AActor::OnInputTouchLeave' has a wrong offset!");
static_assert(offsetof(AActor, OnActorHit) == 0x0001E8, "Member 'AActor::OnActorHit' has a wrong offset!");
static_assert(offsetof(AActor, OnDestroyed) == 0x0001F4, "Member 'AActor::OnDestroyed' has a wrong offset!");
static_assert(offsetof(AActor, OnEndPlay) == 0x000200, "Member 'AActor::OnEndPlay' has a wrong offset!");
static_assert(offsetof(AActor, BlueprintCreatedComponents) == 0x000224, "Member 'AActor::BlueprintCreatedComponents' has a wrong offset!");
static_assert(offsetof(AActor, InstanceComponents) == 0x000230, "Member 'AActor::InstanceComponents' has a wrong offset!");

// Class Engine.Brush
// 0x0028 (0x0268 - 0x0240)
class ABrush : public AActor
{
public:
	EBrushType                                    BrushType;                                         // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 BrushColor;                                        // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PolyFlags;                                         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bColored : 1;                                      // 0x024C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bSolidWhenSelected : 1;                            // 0x024C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bPlaceableFromClassBrowser : 1;                    // 0x024C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bNotForClientOrServer : 1;                         // 0x024C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UModel*                                 Brush;                                             // 0x0250(0x0004)(ExportObject, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrushComponent*                        BrushComponent;                                    // 0x0254(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInManipulation : 1;                               // 0x0258(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeomSelection>                 SavedSelections;                                   // 0x025C(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Brush">();
	}
	static class ABrush* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABrush>();
	}
};
static_assert(alignof(ABrush) == 0x000004, "Wrong alignment on ABrush");
static_assert(sizeof(ABrush) == 0x000268, "Wrong size on ABrush");
static_assert(offsetof(ABrush, BrushType) == 0x000240, "Member 'ABrush::BrushType' has a wrong offset!");
static_assert(offsetof(ABrush, BrushColor) == 0x000244, "Member 'ABrush::BrushColor' has a wrong offset!");
static_assert(offsetof(ABrush, PolyFlags) == 0x000248, "Member 'ABrush::PolyFlags' has a wrong offset!");
static_assert(offsetof(ABrush, Brush) == 0x000250, "Member 'ABrush::Brush' has a wrong offset!");
static_assert(offsetof(ABrush, BrushComponent) == 0x000254, "Member 'ABrush::BrushComponent' has a wrong offset!");
static_assert(offsetof(ABrush, SavedSelections) == 0x00025C, "Member 'ABrush::SavedSelections' has a wrong offset!");

// Class Engine.Volume
// 0x0000 (0x0268 - 0x0268)
class AVolume : public ABrush
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Volume">();
	}
	static class AVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVolume>();
	}
};
static_assert(alignof(AVolume) == 0x000004, "Wrong alignment on AVolume");
static_assert(sizeof(AVolume) == 0x000268, "Wrong size on AVolume");

// Class Engine.ActorComponent
// 0x0070 (0x008C - 0x001C)
class UActorComponent : public UObject
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorComponentTickFunction            PrimaryComponentTick;                              // 0x0020(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           ComponentTags;                                     // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0064(0x000C)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         BitPad_70_0 : 3;                                   // 0x0070(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bReplicates : 1;                                   // 0x0070(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bNetAddressable : 1;                               // 0x0070(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         BitPad_70_5 : 3;                                   // 0x0070(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         BitPad_71_0 : 6;                                   // 0x0071(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCreatedByConstructionScript : 1;                  // 0x0071(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Deprecated, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bInstanceComponent : 1;                            // 0x0071(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Deprecated, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bAutoActivate : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bIsActive : 1;                                     // 0x0072(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bEditableWhenInherited : 1;                        // 0x0072(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         BitPad_72_3 : 1;                                   // 0x0072(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCanEverAffectNavigation : 1;                      // 0x0072(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected))
	uint8                                         BitPad_72_5 : 1;                                   // 0x0072(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bWantsBeginPlay : 1;                               // 0x0072(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EComponentCreationMethod                      CreationMethod;                                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x7];                                       // 0x0075(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSimpleMemberReference>         UCSModifiedProperties;                             // 0x007C(0x000C)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x4];                                       // 0x0088(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Activate(bool bReset);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void Deactivate();
	void K2_DestroyComponent(class UObject* Object);
	void OnRep_IsActive();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void SetActive(bool bNewActive, bool bReset);
	void SetComponentTickEnabled(bool bEnabled);
	void SetIsReplicated(bool ShouldReplicate);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetTickGroup(ETickingGroup NewTickGroup);
	void ToggleActive();

	bool ComponentHasTag(class FName Tag) const;
	class AActor* GetOwner() const;
	bool IsActive() const;
	bool IsBeingDestroyed() const;
	bool IsComponentTickEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorComponent">();
	}
	static class UActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorComponent>();
	}
};
static_assert(alignof(UActorComponent) == 0x000004, "Wrong alignment on UActorComponent");
static_assert(sizeof(UActorComponent) == 0x00008C, "Wrong size on UActorComponent");
static_assert(offsetof(UActorComponent, PrimaryComponentTick) == 0x000020, "Member 'UActorComponent::PrimaryComponentTick' has a wrong offset!");
static_assert(offsetof(UActorComponent, ComponentTags) == 0x000058, "Member 'UActorComponent::ComponentTags' has a wrong offset!");
static_assert(offsetof(UActorComponent, AssetUserData) == 0x000064, "Member 'UActorComponent::AssetUserData' has a wrong offset!");
static_assert(offsetof(UActorComponent, CreationMethod) == 0x000074, "Member 'UActorComponent::CreationMethod' has a wrong offset!");
static_assert(offsetof(UActorComponent, UCSModifiedProperties) == 0x00007C, "Member 'UActorComponent::UCSModifiedProperties' has a wrong offset!");

// Class Engine.SceneComponent
// 0x0120 (0x01AC - 0x008C)
#pragma pack(push, 0x1)
class alignas(0x04) USceneComponent : public UActorComponent
{
public:
	class USceneComponent*                        AttachParent;                                      // 0x008C(0x0004)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                AttachChildren;                                    // 0x0090(0x000C)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   AttachSocketName;                                  // 0x009C(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRequiresCustomLocation : 1;                       // 0x00A4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bWorldToComponentUpdated : 1;                      // 0x00A4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bAbsoluteLocation : 1;                             // 0x00A4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bAbsoluteRotation : 1;                             // 0x00A4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bAbsoluteScale : 1;                                // 0x00A4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bVisible : 1;                                      // 0x00A4(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bHiddenInGame : 1;                                 // 0x00A4(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bShouldUpdatePhysicsVolume : 1;                    // 0x00A4(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         bBoundsChangeTriggersStreamingDataRebuild : 1;     // 0x00A5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bUseAttachParentBound : 1;                         // 0x00A5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic))
	uint8                                         BitPad_A5_2 : 2;                                   // 0x00A5(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bAbsoluteTranslation : 1;                          // 0x00A5(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Deprecated, NoDestructor, NativeAccessSpecifierPrivate))
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class APhysicsVolume>          PhysicsVolume;                                     // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x70];                                      // 0x00B0(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RelativeLocation;                                  // 0x0120(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x012C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x28];                                     // 0x0138(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RelativeScale3D;                                   // 0x0160(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, Interp, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RelativeTranslation;                               // 0x016C(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EComponentMobility                            Mobility;                                          // 0x0178(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetailMode                                   DetailMode;                                        // 0x0179(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A[0xE];                                      // 0x017A(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ComponentVelocity;                                 // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   PhysicsVolumeChangedDelegate;                      // 0x0194(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0xC];                                      // 0x01A0(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
	void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AttachTo(class USceneComponent* InParent, class FName InSocketName, EAttachLocation AttachType, bool bWeldSimulatedBodies);
	void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void OnRep_AttachParent();
	void OnRep_AttachSocketName();
	void OnRep_Transform();
	void OnRep_Visibility(bool OldValue);
	void ResetRelativeTransform();
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SnapTo(class USceneComponent* InParent, class FName InSocketName);
	void ToggleVisibility(bool bPropagateToChildren);

	bool DoesSocketExist(class FName InSocketName) const;
	TArray<class FName> GetAllSocketNames() const;
	class USceneComponent* GetAttachParent() const;
	class FName GetAttachSocketName() const;
	class USceneComponent* GetChildComponent(int32 ChildIndex) const;
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>* Children) const;
	struct FVector GetComponentVelocity() const;
	struct FVector GetForwardVector() const;
	int32 GetNumChildrenComponents() const;
	void GetParentComponents(TArray<class USceneComponent*>* Parents) const;
	class APhysicsVolume* GetPhysicsVolume() const;
	struct FTransform GetRelativeTransform() const;
	struct FVector GetRightVector() const;
	struct FVector GetSocketLocation(class FName InSocketName) const;
	struct FQuat GetSocketQuaternion(class FName InSocketName) const;
	struct FRotator GetSocketRotation(class FName InSocketName) const;
	struct FTransform GetSocketTransform(class FName InSocketName, ERelativeTransformSpace TransformSpace) const;
	struct FVector GetUpVector() const;
	bool IsAnySimulatingPhysics() const;
	bool IsSimulatingPhysics(class FName BoneName) const;
	bool IsVisible() const;
	struct FVector K2_GetComponentLocation() const;
	struct FRotator K2_GetComponentRotation() const;
	struct FVector K2_GetComponentScale() const;
	struct FTransform K2_GetComponentToWorld() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SceneComponent">();
	}
	static class USceneComponent* GetDefaultObj()
	{
