#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EngineSettings

#include "Basic.hpp"

#include "EngineSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class EngineSettings.ConsoleSettings
// 0x001C (0x0038 - 0x001C)
class UConsoleSettings final : public UObject
{
public:
	int32                                         MaxScrollbackSize;                                 // 0x001C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAutoCompleteCommand>           ManualAutoCompleteList;                            // 0x0020(0x000C)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         AutoCompleteMapPaths;                              // 0x002C(0x000C)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConsoleSettings">();
	}
	static class UConsoleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsoleSettings>();
	}
};
static_assert(alignof(UConsoleSettings) == 0x000004, "Wrong alignment on UConsoleSettings");
static_assert(sizeof(UConsoleSettings) == 0x000038, "Wrong size on UConsoleSettings");
static_assert(offsetof(UConsoleSettings, MaxScrollbackSize) == 0x00001C, "Member 'UConsoleSettings::MaxScrollbackSize' has a wrong offset!");
static_assert(offsetof(UConsoleSettings, ManualAutoCompleteList) == 0x000020, "Member 'UConsoleSettings::ManualAutoCompleteList' has a wrong offset!");
static_assert(offsetof(UConsoleSettings, AutoCompleteMapPaths) == 0x00002C, "Member 'UConsoleSettings::AutoCompleteMapPaths' has a wrong offset!");

// Class EngineSettings.GameMapsSettings
// 0x0064 (0x0080 - 0x001C)
class UGameMapsSettings final : public UObject
{
public:
	class FString                                 EditorStartupMap;                                  // 0x001C(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalMapOptions;                                   // 0x0028(0x000C)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TransitionMap;                                     // 0x0034(0x000C)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSplitscreen;                                   // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ETwoPlayerSplitScreenType                     TwoPlayerSplitscreenLayout;                        // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThreePlayerSplitScreenType                   ThreePlayerSplitscreenLayout;                      // 0x0042(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStringClassReference                  GameInstanceClass;                                 // 0x0044(0x000C)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	class FString                                 GameDefaultMap;                                    // 0x0050(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ServerDefaultMap;                                  // 0x005C(0x000C)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStringClassReference                  GlobalDefaultGameMode;                             // 0x0068(0x000C)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPrivate)
	struct FStringClassReference                  GlobalDefaultServerGameMode;                       // 0x0074(0x000C)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameMapsSettings">();
	}
	static class UGameMapsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameMapsSettings>();
	}
};
static_assert(alignof(UGameMapsSettings) == 0x000004, "Wrong alignment on UGameMapsSettings");
static_assert(sizeof(UGameMapsSettings) == 0x000080, "Wrong size on UGameMapsSettings");
static_assert(offsetof(UGameMapsSettings, EditorStartupMap) == 0x00001C, "Member 'UGameMapsSettings::EditorStartupMap' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, LocalMapOptions) == 0x000028, "Member 'UGameMapsSettings::LocalMapOptions' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, TransitionMap) == 0x000034, "Member 'UGameMapsSettings::TransitionMap' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, bUseSplitscreen) == 0x000040, "Member 'UGameMapsSettings::bUseSplitscreen' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, TwoPlayerSplitscreenLayout) == 0x000041, "Member 'UGameMapsSettings::TwoPlayerSplitscreenLayout' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, ThreePlayerSplitscreenLayout) == 0x000042, "Member 'UGameMapsSettings::ThreePlayerSplitscreenLayout' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, GameInstanceClass) == 0x000044, "Member 'UGameMapsSettings::GameInstanceClass' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, GameDefaultMap) == 0x000050, "Member 'UGameMapsSettings::GameDefaultMap' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, ServerDefaultMap) == 0x00005C, "Member 'UGameMapsSettings::ServerDefaultMap' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, GlobalDefaultGameMode) == 0x000068, "Member 'UGameMapsSettings::GlobalDefaultGameMode' has a wrong offset!");
static_assert(offsetof(UGameMapsSettings, GlobalDefaultServerGameMode) == 0x000074, "Member 'UGameMapsSettings::GlobalDefaultServerGameMode' has a wrong offset!");

// Class EngineSettings.GameNetworkManagerSettings
// 0x002C (0x0048 - 0x001C)
class UGameNetworkManagerSettings final : public UObject
{
public:
	int32                                         MinDynamicBandwidth;                               // 0x001C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDynamicBandwidth;                               // 0x0020(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNetBandwidth;                                 // 0x0024(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BadPingThreshold;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsStandbyCheckingEnabled : 1;                     // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StandbyRxCheatTime;                                // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandbyTxCheatTime;                                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentMissingForRxStandby;                        // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentMissingForTxStandby;                        // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentForBadPing;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JoinInProgressStandbyWaitTime;                     // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameNetworkManagerSettings">();
	}
	static class UGameNetworkManagerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameNetworkManagerSettings>();
	}
};
static_assert(alignof(UGameNetworkManagerSettings) == 0x000004, "Wrong alignment on UGameNetworkManagerSettings");
static_assert(sizeof(UGameNetworkManagerSettings) == 0x000048, "Wrong size on UGameNetworkManagerSettings");
static_assert(offsetof(UGameNetworkManagerSettings, MinDynamicBandwidth) == 0x00001C, "Member 'UGameNetworkManagerSettings::MinDynamicBandwidth' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, MaxDynamicBandwidth) == 0x000020, "Member 'UGameNetworkManagerSettings::MaxDynamicBandwidth' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, TotalNetBandwidth) == 0x000024, "Member 'UGameNetworkManagerSettings::TotalNetBandwidth' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, BadPingThreshold) == 0x000028, "Member 'UGameNetworkManagerSettings::BadPingThreshold' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, StandbyRxCheatTime) == 0x000030, "Member 'UGameNetworkManagerSettings::StandbyRxCheatTime' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, StandbyTxCheatTime) == 0x000034, "Member 'UGameNetworkManagerSettings::StandbyTxCheatTime' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, PercentMissingForRxStandby) == 0x000038, "Member 'UGameNetworkManagerSettings::PercentMissingForRxStandby' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, PercentMissingForTxStandby) == 0x00003C, "Member 'UGameNetworkManagerSettings::PercentMissingForTxStandby' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, PercentForBadPing) == 0x000040, "Member 'UGameNetworkManagerSettings::PercentForBadPing' has a wrong offset!");
static_assert(offsetof(UGameNetworkManagerSettings, JoinInProgressStandbyWaitTime) == 0x000044, "Member 'UGameNetworkManagerSettings::JoinInProgressStandbyWaitTime' has a wrong offset!");

// Class EngineSettings.GameSessionSettings
// 0x000C (0x0028 - 0x001C)
class UGameSessionSettings final : public UObject
{
public:
	int32                                         MaxSpectators;                                     // 0x001C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPlayers;                                        // 0x0020(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRequiresPushToTalk : 1;                           // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, GlobalConfig, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameSessionSettings">();
	}
	static class UGameSessionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSessionSettings>();
	}
};
static_assert(alignof(UGameSessionSettings) == 0x000004, "Wrong alignment on UGameSessionSettings");
static_assert(sizeof(UGameSessionSettings) == 0x000028, "Wrong size on UGameSessionSettings");
static_assert(offsetof(UGameSessionSettings, MaxSpectators) == 0x00001C, "Member 'UGameSessionSettings::MaxSpectators' has a wrong offset!");
static_assert(offsetof(UGameSessionSettings, MaxPlayers) == 0x000020, "Member 'UGameSessionSettings::MaxPlayers' has a wrong offset!");

// Class EngineSettings.GeneralEngineSettings
// 0x0000 (0x001C - 0x001C)
class UGeneralEngineSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneralEngineSettings">();
	}
	static class UGeneralEngineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneralEngineSettings>();
	}
};
static_assert(alignof(UGeneralEngineSettings) == 0x000004, "Wrong alignment on UGeneralEngineSettings");
static_assert(sizeof(UGeneralEngineSettings) == 0x00001C, "Wrong size on UGeneralEngineSettings");

// Class EngineSettings.GeneralProjectSettings
// 0x0094 (0x00B0 - 0x001C)
class UGeneralProjectSettings final : public UObject
{
public:
	class FString                                 CompanyName;                                       // 0x001C(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CompanyDistinguishedName;                          // 0x0028(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CopyrightNotice;                                   // 0x0034(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0040(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Homepage;                                          // 0x004C(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LicensingTerms;                                    // 0x0058(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrivacyPolicy;                                     // 0x0064(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ProjectID;                                         // 0x0070(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ProjectName;                                       // 0x0080(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectVersion;                                    // 0x008C(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SupportContact;                                    // 0x0098(0x000C)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ProjectDisplayedTitle;                             // 0x00A4(0x000C)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneralProjectSettings">();
	}
	static class UGeneralProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneralProjectSettings>();
	}
};
static_assert(alignof(UGeneralProjectSettings) == 0x000004, "Wrong alignment on UGeneralProjectSettings");
static_assert(sizeof(UGeneralProjectSettings) == 0x0000B0, "Wrong size on UGeneralProjectSettings");
static_assert(offsetof(UGeneralProjectSettings, CompanyName) == 0x00001C, "Member 'UGeneralProjectSettings::CompanyName' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, CompanyDistinguishedName) == 0x000028, "Member 'UGeneralProjectSettings::CompanyDistinguishedName' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, CopyrightNotice) == 0x000034, "Member 'UGeneralProjectSettings::CopyrightNotice' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, Description) == 0x000040, "Member 'UGeneralProjectSettings::Description' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, Homepage) == 0x00004C, "Member 'UGeneralProjectSettings::Homepage' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, LicensingTerms) == 0x000058, "Member 'UGeneralProjectSettings::LicensingTerms' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, PrivacyPolicy) == 0x000064, "Member 'UGeneralProjectSettings::PrivacyPolicy' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, ProjectID) == 0x000070, "Member 'UGeneralProjectSettings::ProjectID' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, ProjectName) == 0x000080, "Member 'UGeneralProjectSettings::ProjectName' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, ProjectVersion) == 0x00008C, "Member 'UGeneralProjectSettings::ProjectVersion' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, SupportContact) == 0x000098, "Member 'UGeneralProjectSettings::SupportContact' has a wrong offset!");
static_assert(offsetof(UGeneralProjectSettings, ProjectDisplayedTitle) == 0x0000A4, "Member 'UGeneralProjectSettings::ProjectDisplayedTitle' has a wrong offset!");

// Class EngineSettings.HudSettings
// 0x0010 (0x002C - 0x001C)
class UHudSettings final : public UObject
{
public:
	uint8                                         bShowHUD : 1;                                      // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DebugDisplay;                                      // 0x0020(0x000C)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudSettings">();
	}
	static class UHudSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudSettings>();
	}
};
static_assert(alignof(UHudSettings) == 0x000004, "Wrong alignment on UHudSettings");
static_assert(sizeof(UHudSettings) == 0x00002C, "Wrong size on UHudSettings");
static_assert(offsetof(UHudSettings, DebugDisplay) == 0x000020, "Member 'UHudSettings::DebugDisplay' has a wrong offset!");

}

#pragma pack(pop)
