#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorDialogBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorDialogBP.ErrorDialogBP_C
// 0x001C (0x0290 - 0x0274)
class UErrorDialogBP_C final : public UFortErrorDialog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0274(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       exit_animation;                                    // 0x0278(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       enter_animation;                                   // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Background_Bar;                                    // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ButtonIconText;                                    // 0x0284(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             HeaderText;                                        // 0x0288(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVerticalBox*                           MessageList;                                       // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_ErrorDialogBP(int32 EntryPoint);
	void BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void OnNetworkError(const class FText& NetworkErrorMessage);
	void PartyContextBasicError(const class FText& Message, const class FString& ErrorCode);
	void OnRebuildDialog(int32 NewIndex);
	void Construct();
	void BindDelegates();
	void Deactivate();
	void OnHandleAction(struct FEventReply* Result, bool* bPassThrough);
	void KillErrorsDisplayed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorDialogBP_C">();
	}
	static class UErrorDialogBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorDialogBP_C>();
	}
};
static_assert(alignof(UErrorDialogBP_C) == 0x000004, "Wrong alignment on UErrorDialogBP_C");
static_assert(sizeof(UErrorDialogBP_C) == 0x000290, "Wrong size on UErrorDialogBP_C");
static_assert(offsetof(UErrorDialogBP_C, UberGraphFrame) == 0x000274, "Member 'UErrorDialogBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, exit_animation) == 0x000278, "Member 'UErrorDialogBP_C::exit_animation' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, enter_animation) == 0x00027C, "Member 'UErrorDialogBP_C::enter_animation' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, Background_Bar) == 0x000280, "Member 'UErrorDialogBP_C::Background_Bar' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, ButtonIconText) == 0x000284, "Member 'UErrorDialogBP_C::ButtonIconText' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, HeaderText) == 0x000288, "Member 'UErrorDialogBP_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UErrorDialogBP_C, MessageList) == 0x00028C, "Member 'UErrorDialogBP_C::MessageList' has a wrong offset!");

}

#pragma pack(pop)
