#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorDialogBP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function ErrorDialogBP.ErrorDialogBP_C.ExecuteUbergraph_ErrorDialogBP
// 0x0078 (0x0078 - 0x0000)
struct ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_NewIndex;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UErrorEntry_C*                          CallFunc_Create_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0014(0x000C)(ConstParm)
	class FString                                 K2Node_CustomEvent_ErrorCode;                      // 0x0020(0x000C)(ZeroConstructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_CustomEvent_NetworkErrorMessage;            // 0x0030(0x000C)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortErrorInfo                         CallFunc_Array_Get_Item;                           // 0x0040(0x002C)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP) == 0x000004, "Wrong alignment on ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP");
static_assert(sizeof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP) == 0x000078, "Wrong size on ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, EntryPoint) == 0x000000, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, K2Node_Event_NewIndex) == 0x000004, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::K2Node_Event_NewIndex' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_GetOwningPlayer_ReturnValue) == 0x00000C, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_Create_ReturnValue) == 0x000010, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, K2Node_CustomEvent_Message) == 0x000014, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, K2Node_CustomEvent_ErrorCode) == 0x000020, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_AddChild_ReturnValue) == 0x00002C, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, K2Node_CustomEvent_NetworkErrorMessage) == 0x000030, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::K2Node_CustomEvent_NetworkErrorMessage' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, Temp_int_Variable) == 0x00003C, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_Array_Get_Item) == 0x000040, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP, K2Node_ComponentBoundEvent_Button) == 0x000074, "Member 'ErrorDialogBP_C_ExecuteUbergraph_ErrorDialogBP::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ErrorDialogBP_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_264_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.OnNetworkError
// 0x000C (0x000C - 0x0000)
struct ErrorDialogBP_C_OnNetworkError final
{
public:
	class FText                                   NetworkErrorMessage;                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ErrorDialogBP_C_OnNetworkError) == 0x000004, "Wrong alignment on ErrorDialogBP_C_OnNetworkError");
static_assert(sizeof(ErrorDialogBP_C_OnNetworkError) == 0x00000C, "Wrong size on ErrorDialogBP_C_OnNetworkError");
static_assert(offsetof(ErrorDialogBP_C_OnNetworkError, NetworkErrorMessage) == 0x000000, "Member 'ErrorDialogBP_C_OnNetworkError::NetworkErrorMessage' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.PartyContextBasicError
// 0x0018 (0x0018 - 0x0000)
struct ErrorDialogBP_C_PartyContextBasicError final
{
public:
	class FText                                   Message;                                           // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
	class FString                                 ErrorCode;                                         // 0x000C(0x000C)(Parm, ZeroConstructor)
};
static_assert(alignof(ErrorDialogBP_C_PartyContextBasicError) == 0x000004, "Wrong alignment on ErrorDialogBP_C_PartyContextBasicError");
static_assert(sizeof(ErrorDialogBP_C_PartyContextBasicError) == 0x000018, "Wrong size on ErrorDialogBP_C_PartyContextBasicError");
static_assert(offsetof(ErrorDialogBP_C_PartyContextBasicError, Message) == 0x000000, "Member 'ErrorDialogBP_C_PartyContextBasicError::Message' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_PartyContextBasicError, ErrorCode) == 0x00000C, "Member 'ErrorDialogBP_C_PartyContextBasicError::ErrorCode' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.OnRebuildDialog
// 0x0004 (0x0004 - 0x0000)
struct ErrorDialogBP_C_OnRebuildDialog final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErrorDialogBP_C_OnRebuildDialog) == 0x000004, "Wrong alignment on ErrorDialogBP_C_OnRebuildDialog");
static_assert(sizeof(ErrorDialogBP_C_OnRebuildDialog) == 0x000004, "Wrong size on ErrorDialogBP_C_OnRebuildDialog");
static_assert(offsetof(ErrorDialogBP_C_OnRebuildDialog, NewIndex) == 0x000000, "Member 'ErrorDialogBP_C_OnRebuildDialog::NewIndex' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.BindDelegates
// 0x002C (0x002C - 0x0000)
struct ErrorDialogBP_C_BindDelegates final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const class FText& NetworkErrorMessage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FText& Message, const class FString& ErrorCode)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErrorDialogBP_C_BindDelegates) == 0x000004, "Wrong alignment on ErrorDialogBP_C_BindDelegates");
static_assert(sizeof(ErrorDialogBP_C_BindDelegates) == 0x00002C, "Wrong size on ErrorDialogBP_C_BindDelegates");
static_assert(offsetof(ErrorDialogBP_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ErrorDialogBP_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_BindDelegates, CallFunc_GetContext_ReturnValue2) == 0x000004, "Member 'ErrorDialogBP_C_BindDelegates::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ErrorDialogBP_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'ErrorDialogBP_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_BindDelegates, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'ErrorDialogBP_C_BindDelegates::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function ErrorDialogBP.ErrorDialogBP_C.OnHandleAction
// 0x0188 (0x0188 - 0x0000)
struct ErrorDialogBP_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x0060)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0064(0x0060)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00C4(0x0060)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x0124(0x0060)()
	bool                                          Handle_Action;                                     // 0x0184(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErrorDialogBP_C_OnHandleAction) == 0x000004, "Wrong alignment on ErrorDialogBP_C_OnHandleAction");
static_assert(sizeof(ErrorDialogBP_C_OnHandleAction) == 0x000188, "Wrong size on ErrorDialogBP_C_OnHandleAction");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, Result) == 0x000000, "Member 'ErrorDialogBP_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, bPassThrough) == 0x000060, "Member 'ErrorDialogBP_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, Temp_bool_Variable) == 0x000061, "Member 'ErrorDialogBP_C_OnHandleAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, CallFunc_Unhandled_ReturnValue) == 0x000064, "Member 'ErrorDialogBP_C_OnHandleAction::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x0000C4, "Member 'ErrorDialogBP_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, K2Node_Select_Default) == 0x000124, "Member 'ErrorDialogBP_C_OnHandleAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ErrorDialogBP_C_OnHandleAction, Handle_Action) == 0x000184, "Member 'ErrorDialogBP_C_OnHandleAction::Handle_Action' has a wrong offset!");

}

#pragma pack(pop)
