#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorEntry.ErrorEntry_C
// 0x0030 (0x0274 - 0x0244)
class UErrorEntry_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_50;                                         // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             Message;                                           // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   ErrorText;                                         // 0x0250(0x000C)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 ErrorCode;                                         // 0x025C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	class FString                                 ErrorUrlBase;                                      // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ErrorEntry(int32 EntryPoint);
	void BndEvt__Button_50_K2Node_ComponentBoundEvent_82_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorEntry_C">();
	}
	static class UErrorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorEntry_C>();
	}
};
static_assert(alignof(UErrorEntry_C) == 0x000004, "Wrong alignment on UErrorEntry_C");
static_assert(sizeof(UErrorEntry_C) == 0x000274, "Wrong size on UErrorEntry_C");
static_assert(offsetof(UErrorEntry_C, UberGraphFrame) == 0x000244, "Member 'UErrorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, Button_50) == 0x000248, "Member 'UErrorEntry_C::Button_50' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, Message) == 0x00024C, "Member 'UErrorEntry_C::Message' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorText) == 0x000250, "Member 'UErrorEntry_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorCode) == 0x00025C, "Member 'UErrorEntry_C::ErrorCode' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorUrlBase) == 0x000268, "Member 'UErrorEntry_C::ErrorUrlBase' has a wrong offset!");

}

#pragma pack(pop)
