#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlingerVimBlueprint_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass FlingerVimBlueprint_New.FlingerVimBlueprint_New_C
// 0x0320 (0x0760 - 0x0440)
class UFlingerVimBlueprint_New_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_C02B41E84C1D1B2E2F8EC1A98D330FF5; // 0x0444(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7C48D53B435A541611F7A589DD3A3C70; // 0x0470(0x0044)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B604E6A34A70EDC8D9723C90CC8D6E54; // 0x04B4(0x0058)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20F26FC34C1A4C759CD446A28102662F; // 0x050C(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B45DFAD64899DA849EC8F087F199AF38; // 0x0564(0x008C)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8F8829F54FD9DC3777837686B8E6717E; // 0x05F0(0x002C)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2A7BFDB941BD6352ED00A5993CA37132; // 0x061C(0x002C)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_CC3BA7AB46B7CC1F2BFC05B3DB295E1C; // 0x0648(0x008C)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_AB38B6944E22B7240140AF80D483AAA6; // 0x06D4(0x008C)()

public:
	void ExecuteUbergraph_FlingerVimBlueprint_New(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlingerVimBlueprint_New_AnimGraphNode_BlendListByBool_B45DFAD64899DA849EC8F087F199AF38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlingerVimBlueprint_New_AnimGraphNode_SequencePlayer_20F26FC34C1A4C759CD446A28102662F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlingerVimBlueprint_New_C">();
	}
	static class UFlingerVimBlueprint_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlingerVimBlueprint_New_C>();
	}
};
static_assert(alignof(UFlingerVimBlueprint_New_C) == 0x000010, "Wrong alignment on UFlingerVimBlueprint_New_C");
static_assert(sizeof(UFlingerVimBlueprint_New_C) == 0x000760, "Wrong size on UFlingerVimBlueprint_New_C");
static_assert(offsetof(UFlingerVimBlueprint_New_C, UberGraphFrame) == 0x000440, "Member 'UFlingerVimBlueprint_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_Root_C02B41E84C1D1B2E2F8EC1A98D330FF5) == 0x000444, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_Root_C02B41E84C1D1B2E2F8EC1A98D330FF5' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_Slot_7C48D53B435A541611F7A589DD3A3C70) == 0x000470, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_Slot_7C48D53B435A541611F7A589DD3A3C70' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_SequencePlayer_B604E6A34A70EDC8D9723C90CC8D6E54) == 0x0004B4, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_SequencePlayer_B604E6A34A70EDC8D9723C90CC8D6E54' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_SequencePlayer_20F26FC34C1A4C759CD446A28102662F) == 0x00050C, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_SequencePlayer_20F26FC34C1A4C759CD446A28102662F' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_BlendListByBool_B45DFAD64899DA849EC8F087F199AF38) == 0x000564, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_BlendListByBool_B45DFAD64899DA849EC8F087F199AF38' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_LocalToComponentSpace_8F8829F54FD9DC3777837686B8E6717E) == 0x0005F0, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_LocalToComponentSpace_8F8829F54FD9DC3777837686B8E6717E' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_ComponentToLocalSpace_2A7BFDB941BD6352ED00A5993CA37132) == 0x00061C, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_ComponentToLocalSpace_2A7BFDB941BD6352ED00A5993CA37132' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_TwoBoneIK_CC3BA7AB46B7CC1F2BFC05B3DB295E1C) == 0x000648, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_TwoBoneIK_CC3BA7AB46B7CC1F2BFC05B3DB295E1C' has a wrong offset!");
static_assert(offsetof(UFlingerVimBlueprint_New_C, AnimGraphNode_TwoBoneIK_AB38B6944E22B7240140AF80D483AAA6) == 0x0006D4, "Member 'UFlingerVimBlueprint_New_C::AnimGraphNode_TwoBoneIK_AB38B6944E22B7240140AF80D483AAA6' has a wrong offset!");

}

#pragma pack(pop)
