#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortnitePartyBackdrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass FortnitePartyBackdrop.FortnitePartyBackdrop_C
// 0x0014 (0x0260 - 0x024C)
class AFortnitePartyBackdrop_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x024C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Lightning_0C9F728D43ED8DB5A25AE8A40FE8D04D; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_0C9F728D43ED8DB5A25AE8A40FE8D04D; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APointLight*                            PointLight6_11_ExecuteUbergraph_FortnitePartyBackdrop_RefProperty; // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FortnitePartyBackdrop(int32 EntryPoint);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortnitePartyBackdrop_C">();
	}
	static class AFortnitePartyBackdrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortnitePartyBackdrop_C>();
	}
};
static_assert(alignof(AFortnitePartyBackdrop_C) == 0x000004, "Wrong alignment on AFortnitePartyBackdrop_C");
static_assert(sizeof(AFortnitePartyBackdrop_C) == 0x000260, "Wrong size on AFortnitePartyBackdrop_C");
static_assert(offsetof(AFortnitePartyBackdrop_C, UberGraphFrame) == 0x00024C, "Member 'AFortnitePartyBackdrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_C, Timeline_0_Lightning_0C9F728D43ED8DB5A25AE8A40FE8D04D) == 0x000250, "Member 'AFortnitePartyBackdrop_C::Timeline_0_Lightning_0C9F728D43ED8DB5A25AE8A40FE8D04D' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_C, Timeline_0__Direction_0C9F728D43ED8DB5A25AE8A40FE8D04D) == 0x000254, "Member 'AFortnitePartyBackdrop_C::Timeline_0__Direction_0C9F728D43ED8DB5A25AE8A40FE8D04D' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_C, Timeline_0) == 0x000258, "Member 'AFortnitePartyBackdrop_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_C, PointLight6_11_ExecuteUbergraph_FortnitePartyBackdrop_RefProperty) == 0x00025C, "Member 'AFortnitePartyBackdrop_C::PointLight6_11_ExecuteUbergraph_FortnitePartyBackdrop_RefProperty' has a wrong offset!");

}

#pragma pack(pop)
