#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortUIStylesheet

#include "Basic.hpp"

#include "FortUITheme_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// UserDefinedStruct FortUIStylesheet.FortUIStylesheet
// 0x0968 (0x0968 - 0x0000)
struct FFortUIStylesheet final
{
public:
	struct FFortUITheme                           Theme_Default_91_015CB18F413B4A467B38CB93E8734A68; // 0x0000(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortUITheme                           Theme_Emphasis_94_962F11A944E9DF11F547FBBDB98DD4BE; // 0x0060(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortUITheme                           Theme_Critical_97_43F63D0C4E71395016AE00B41BB7BA0C; // 0x00C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    Standard_Icon_Size_131_774B5BB9434A3E02AEC16CA1BB6B253A; // 0x0120(0x02B8)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    Item_Size_144_A36DAD55442FF44849D422B57DDD037A;    // 0x03D8(0x02B8)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    Item_Icon_Size_134_098E0A9F46695EDB2E9166978E7B49F1; // 0x0690(0x02B8)(Edit, BlueprintVisible)
	struct FLinearColor                           Color_Additive_137_AC063FB242D9ECBD0B6306BBE205C7F7; // 0x0948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Color_Negative_140_0402338944FCC3DED4C90E9A78FD8BC5; // 0x0958(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFortUIStylesheet) == 0x000004, "Wrong alignment on FFortUIStylesheet");
static_assert(sizeof(FFortUIStylesheet) == 0x000968, "Wrong size on FFortUIStylesheet");
static_assert(offsetof(FFortUIStylesheet, Theme_Default_91_015CB18F413B4A467B38CB93E8734A68) == 0x000000, "Member 'FFortUIStylesheet::Theme_Default_91_015CB18F413B4A467B38CB93E8734A68' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Theme_Emphasis_94_962F11A944E9DF11F547FBBDB98DD4BE) == 0x000060, "Member 'FFortUIStylesheet::Theme_Emphasis_94_962F11A944E9DF11F547FBBDB98DD4BE' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Theme_Critical_97_43F63D0C4E71395016AE00B41BB7BA0C) == 0x0000C0, "Member 'FFortUIStylesheet::Theme_Critical_97_43F63D0C4E71395016AE00B41BB7BA0C' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Standard_Icon_Size_131_774B5BB9434A3E02AEC16CA1BB6B253A) == 0x000120, "Member 'FFortUIStylesheet::Standard_Icon_Size_131_774B5BB9434A3E02AEC16CA1BB6B253A' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Item_Size_144_A36DAD55442FF44849D422B57DDD037A) == 0x0003D8, "Member 'FFortUIStylesheet::Item_Size_144_A36DAD55442FF44849D422B57DDD037A' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Item_Icon_Size_134_098E0A9F46695EDB2E9166978E7B49F1) == 0x000690, "Member 'FFortUIStylesheet::Item_Icon_Size_134_098E0A9F46695EDB2E9166978E7B49F1' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Color_Additive_137_AC063FB242D9ECBD0B6306BBE205C7F7) == 0x000948, "Member 'FFortUIStylesheet::Color_Additive_137_AC063FB242D9ECBD0B6306BBE205C7F7' has a wrong offset!");
static_assert(offsetof(FFortUIStylesheet, Color_Negative_140_0402338944FCC3DED4C90E9A78FD8BC5) == 0x000958, "Member 'FFortUIStylesheet::Color_Negative_140_0402338944FCC3DED4C90E9A78FD8BC5' has a wrong offset!");

}

#pragma pack(pop)
