#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGame

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Party_structs.hpp"
#include "Party_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "McpProfileSys_classes.hpp"
#include "Lobby_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class FortniteGame.FortMissionEventParams
// 0x0000 (0x001C - 0x001C)
class UFortMissionEventParams : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMissionEventParams">();
	}
	static class UFortMissionEventParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMissionEventParams>();
	}
};
static_assert(alignof(UFortMissionEventParams) == 0x000004, "Wrong alignment on UFortMissionEventParams");
static_assert(sizeof(UFortMissionEventParams) == 0x00001C, "Wrong size on UFortMissionEventParams");

// Class FortniteGame.AIHotSpot
// 0x00D8 (0x0318 - 0x0240)
class AAIHotSpot : public AActor
{
public:
	TArray<class UAIHotSpotSlot*>                 UserSlots;                                         // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotSlotGenerator*                SlotGenerator;                                     // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIHotSpotSlot*>                 Slots;                                             // 0x0250(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 FocusActor;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CustomNavmeshSearchExtent;                         // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         bStartEnabled : 1;                                 // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bAllowSlotlessAssignment : 1;                      // 0x0270(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected))
	uint8                                         bAllowClaimingMultipleSlots : 1;                   // 0x0270(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected))
	uint8                                         bTrackOverlappingSlots : 1;                        // 0x0270(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected))
	uint8                                         bProjectSlotsOnNavmesh : 1;                        // 0x0270(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bCustomNavmeshSearchExtent : 1;                    // 0x0270(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x0270(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAIController*>                  NoSlotAssignees;                                   // 0x0274(0x000C)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x94];                                     // 0x0280(0x0094)(Fixing Size After Last Property [ Dumper-7 ])
	class UBillboardComponent*                    SpriteComponent;                                   // 0x0314(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool AssignFromWaitingList();
	int32 AssignGroupToHotspot(const TArray<class AAIController*>& GroupOfAI);
	bool AssignToHotspot(class AAIController* AI);
	bool AssignToSlotByIndex(class AAIController* AI, int32 INDEX);
	bool AssignToSlotByUserId(class AAIController* AI, int32 UserId);
	bool OccupySlotByIndex(int32 INDEX);
	bool OccupySlotByOwner(const class AAIController* AIOwner);
	bool OccupySlotByUserId(int32 UserId);
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32 INDEX, int32 UserId, bool bWasOnWaitingList);
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32 INDEX, int32 UserId);
	bool OnAssignedSlotlessBehavior(class AAIController* AI);
	void OnHotSpotDisabled();
	void OnHotSpotEnabled();
	void OnMoveToSlotFinished(class AAIController* AI, int32 INDEX, int32 UserId, bool bResult);
	void OnRemovedBehavior(class AAIController* AI, int32 INDEX, int32 UserId, EAIHotSpotSlot PrevState, bool bWasOnWaitingList);
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot);
	void OnSlotBlocked(class AAIController* AI, int32 INDEX, int32 UserId);
	void OnSlotClaimed(class AAIController* AI, int32 INDEX, int32 UserId);
	void OnSlotDisabled(int32 INDEX, int32 UserId);
	void OnSlotEnabled(int32 INDEX, int32 UserId);
	void OnSlotFreed(class AAIController* AI, int32 INDEX, int32 UserId);
	void OnSlotOccupied(class AAIController* AI, int32 INDEX, int32 UserId);
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList);
	int32 RemoveGroupFromHotspot(const TArray<class AAIController*>& GroupOfAI);
	void SetEnabled(bool bEnabled);

	bool CanUseSlotByIndex(const class AAIController* AI, int32 INDEX) const;
	bool CanUseSlotByUserId(const class AAIController* AI, int32 UserId) const;
	int32 FindBestSlotIndex(class AAIController* AI) const;
	TArray<int32> FindBestSlotIndices(const TArray<class AAIController*>& AI) const;
	TArray<class AAIController*> GetAssignedAI(EAIHotSpotAssignmentFilter Filter) const;
	int32 GetAssignedAICount(EAIHotSpotAssignmentFilter Filter) const;
	class UAIHotSpotSlot* GetSlotByIndex(int32 INDEX) const;
	class UAIHotSpotSlot* GetSlotByOwner(const class AAIController* AIOwner) const;
	class UAIHotSpotSlot* GetSlotByUserId(int32 UserId) const;
	int32 GetSlotCount(EAIHotSpotSlotFilter Filter) const;
	int32 GetSlotIndexByOwner(const class AAIController* AIOwner) const;
	int32 GetSlotIndexByUserId(int32 UserId) const;
	struct FVector GetSlotLocationByIndex(int32 INDEX) const;
	struct FVector GetSlotLocationByOwner(const class AAIController* AIOwner) const;
	struct FVector GetSlotLocationByUserId(int32 UserId) const;
	class AAIController* GetSlotOwnerByIndex(int32 INDEX) const;
	class AAIController* GetSlotOwnerByUserId(int32 UserId) const;
	struct FRotator GetSlotRotationByIndex(int32 INDEX) const;
	struct FRotator GetSlotRotationByOwner(const class AAIController* AIOwner) const;
	struct FRotator GetSlotRotationByUserId(int32 UserId) const;
	EAIHotSpotSlot GetSlotStateByIndex(int32 INDEX) const;
	EAIHotSpotSlot GetSlotStateByOwner(const class AAIController* AIOwner) const;
	EAIHotSpotSlot GetSlotStateByUserId(int32 UserId) const;
	int32 GetSlotUserIdByIndex(int32 INDEX) const;
	int32 GetSlotUserIdByOwner(const class AAIController* AIOwner) const;
	bool HasAssignedAI(const class AAIController* AI, EAIHotSpotAssignmentFilter Filter) const;
	bool HasEnabledSlots() const;
	bool IsAIAllowed(const class AAIController* AI) const;
	bool IsEnabled() const;
	bool IsSlotlessAssignmentAllowed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpot">();
	}
	static class AAIHotSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIHotSpot>();
	}
};
static_assert(alignof(AAIHotSpot) == 0x000004, "Wrong alignment on AAIHotSpot");
static_assert(sizeof(AAIHotSpot) == 0x000318, "Wrong size on AAIHotSpot");
static_assert(offsetof(AAIHotSpot, UserSlots) == 0x000240, "Member 'AAIHotSpot::UserSlots' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, SlotGenerator) == 0x00024C, "Member 'AAIHotSpot::SlotGenerator' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, Slots) == 0x000250, "Member 'AAIHotSpot::Slots' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, FocusActor) == 0x00025C, "Member 'AAIHotSpot::FocusActor' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, FilterClass) == 0x000260, "Member 'AAIHotSpot::FilterClass' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, CustomNavmeshSearchExtent) == 0x000264, "Member 'AAIHotSpot::CustomNavmeshSearchExtent' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, NoSlotAssignees) == 0x000274, "Member 'AAIHotSpot::NoSlotAssignees' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, SpriteComponent) == 0x000314, "Member 'AAIHotSpot::SpriteComponent' has a wrong offset!");

// Class FortniteGame.FortAIHotSpot
// 0x000C (0x0324 - 0x0318)
class AFortAIHotSpot : public AAIHotSpot
{
public:
	uint8                                         Pad_318[0xC];                                      // 0x0318(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIHotSpot">();
	}
	static class AFortAIHotSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAIHotSpot>();
	}
};
static_assert(alignof(AFortAIHotSpot) == 0x000004, "Wrong alignment on AFortAIHotSpot");
static_assert(sizeof(AFortAIHotSpot) == 0x000324, "Wrong size on AFortAIHotSpot");

// Class FortniteGame.FortAIHotSpot_FakeBuilding
// 0x0000 (0x0324 - 0x0324)
class AFortAIHotSpot_FakeBuilding final : public AFortAIHotSpot
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIHotSpot_FakeBuilding">();
	}
	static class AFortAIHotSpot_FakeBuilding* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAIHotSpot_FakeBuilding>();
	}
};
static_assert(alignof(AFortAIHotSpot_FakeBuilding) == 0x000004, "Wrong alignment on AFortAIHotSpot_FakeBuilding");
static_assert(sizeof(AFortAIHotSpot_FakeBuilding) == 0x000324, "Wrong size on AFortAIHotSpot_FakeBuilding");

// Class FortniteGame.FortQuickBars
// 0x0094 (0x02D4 - 0x0240)
class AFortQuickBars final : public AActor
{
public:
	struct FQuickBar                              PrimaryQuickBar;                                   // 0x0240(0x0020)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FQuickBar                              SecondaryQuickBar;                                 // 0x0260(0x0020)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x54];                                     // 0x0280(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Empty(EFortQuickBars InQuickBar);
	void OnRep_PrimaryQuickBar();
	void OnRep_SecondaryQuickBar();
	void ServerActivateSlotInternal(EFortQuickBars InQuickBar, int32 Slot, float AcivateDelay);
	void ServerAddItemInternal(const struct FGuid& Item, EFortQuickBars InQuickBar, int32 Slot);
	void ServerRemoveItemInternal(const struct FGuid& Item, bool bFindReplacement, bool bForce);
	void ServerSwapItemsInternal(EFortQuickBars QuickBarA, int32 SlotIndexA, EFortQuickBars QuickBarB, int32 SlotIndexB);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuickBars">();
	}
	static class AFortQuickBars* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortQuickBars>();
	}
};
static_assert(alignof(AFortQuickBars) == 0x000004, "Wrong alignment on AFortQuickBars");
static_assert(sizeof(AFortQuickBars) == 0x0002D4, "Wrong size on AFortQuickBars");
static_assert(offsetof(AFortQuickBars, PrimaryQuickBar) == 0x000240, "Member 'AFortQuickBars::PrimaryQuickBar' has a wrong offset!");
static_assert(offsetof(AFortQuickBars, SecondaryQuickBar) == 0x000260, "Member 'AFortQuickBars::SecondaryQuickBar' has a wrong offset!");

// Class FortniteGame.BuildingLevelGameplayEffectInfo
// 0x0054 (0x0070 - 0x001C)
class UBuildingLevelGameplayEffectInfo final : public UObject
{
public:
	class FText                                   NumericDescription;                                // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FFortAttributeInfo                     AttributeInfo;                                     // 0x0028(0x0024)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x004C(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   RequiredTagsDescription;                           // 0x0064(0x000C)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingLevelGameplayEffectInfo">();
	}
	static class UBuildingLevelGameplayEffectInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingLevelGameplayEffectInfo>();
	}
};
static_assert(alignof(UBuildingLevelGameplayEffectInfo) == 0x000004, "Wrong alignment on UBuildingLevelGameplayEffectInfo");
static_assert(sizeof(UBuildingLevelGameplayEffectInfo) == 0x000070, "Wrong size on UBuildingLevelGameplayEffectInfo");
static_assert(offsetof(UBuildingLevelGameplayEffectInfo, NumericDescription) == 0x00001C, "Member 'UBuildingLevelGameplayEffectInfo::NumericDescription' has a wrong offset!");
static_assert(offsetof(UBuildingLevelGameplayEffectInfo, AttributeInfo) == 0x000028, "Member 'UBuildingLevelGameplayEffectInfo::AttributeInfo' has a wrong offset!");
static_assert(offsetof(UBuildingLevelGameplayEffectInfo, RequiredTags) == 0x00004C, "Member 'UBuildingLevelGameplayEffectInfo::RequiredTags' has a wrong offset!");
static_assert(offsetof(UBuildingLevelGameplayEffectInfo, RequiredTagsDescription) == 0x000064, "Member 'UBuildingLevelGameplayEffectInfo::RequiredTagsDescription' has a wrong offset!");

// Class FortniteGame.FortRegionInfo
// 0x0080 (0x009C - 0x001C)
class UFortRegionInfo final : public UDataAsset
{
public:
	class FText                                   RegionName;                                        // 0x001C(0x000C)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RegionTags;                                        // 0x0028(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                  Requirements;                                      // 0x0040(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortTheaterMapMissionData             MissionData;                                       // 0x0060(0x0024)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USlateBrushAsset>        RegionThemeIcon;                                   // 0x0084(0x0018)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRegionInfo">();
	}
	static class UFortRegionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRegionInfo>();
	}
};
static_assert(alignof(UFortRegionInfo) == 0x000004, "Wrong alignment on UFortRegionInfo");
static_assert(sizeof(UFortRegionInfo) == 0x00009C, "Wrong size on UFortRegionInfo");
static_assert(offsetof(UFortRegionInfo, RegionName) == 0x00001C, "Member 'UFortRegionInfo::RegionName' has a wrong offset!");
static_assert(offsetof(UFortRegionInfo, RegionTags) == 0x000028, "Member 'UFortRegionInfo::RegionTags' has a wrong offset!");
static_assert(offsetof(UFortRegionInfo, Requirements) == 0x000040, "Member 'UFortRegionInfo::Requirements' has a wrong offset!");
static_assert(offsetof(UFortRegionInfo, MissionData) == 0x000060, "Member 'UFortRegionInfo::MissionData' has a wrong offset!");
static_assert(offsetof(UFortRegionInfo, RegionThemeIcon) == 0x000084, "Member 'UFortRegionInfo::RegionThemeIcon' has a wrong offset!");

// Class FortniteGame.AccumulatedGameplayEffectInfo
// 0x0080 (0x009C - 0x001C)
class UAccumulatedGameplayEffectInfo final : public UObject
{
public:
	struct FGameplayEffectInfo                    AccumulatedEffect;                                 // 0x001C(0x0024)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         NextUpgradeRating;                                 // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AccumulatedEffectCount;                            // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAttributeInfo                     AttributeInfo;                                     // 0x0048(0x0024)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FGameplayEffectInfo>            AllEffects;                                        // 0x006C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0078(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   RequiredTagsDescription;                           // 0x0090(0x000C)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	struct FGameplayEffectInfo GetRelativeEffectAtRating(const int32 NewRating) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccumulatedGameplayEffectInfo">();
	}
	static class UAccumulatedGameplayEffectInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccumulatedGameplayEffectInfo>();
	}
};
static_assert(alignof(UAccumulatedGameplayEffectInfo) == 0x000004, "Wrong alignment on UAccumulatedGameplayEffectInfo");
static_assert(sizeof(UAccumulatedGameplayEffectInfo) == 0x00009C, "Wrong size on UAccumulatedGameplayEffectInfo");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, AccumulatedEffect) == 0x00001C, "Member 'UAccumulatedGameplayEffectInfo::AccumulatedEffect' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, NextUpgradeRating) == 0x000040, "Member 'UAccumulatedGameplayEffectInfo::NextUpgradeRating' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, AccumulatedEffectCount) == 0x000044, "Member 'UAccumulatedGameplayEffectInfo::AccumulatedEffectCount' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, AttributeInfo) == 0x000048, "Member 'UAccumulatedGameplayEffectInfo::AttributeInfo' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, AllEffects) == 0x00006C, "Member 'UAccumulatedGameplayEffectInfo::AllEffects' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, RequiredTags) == 0x000078, "Member 'UAccumulatedGameplayEffectInfo::RequiredTags' has a wrong offset!");
static_assert(offsetof(UAccumulatedGameplayEffectInfo, RequiredTagsDescription) == 0x000090, "Member 'UAccumulatedGameplayEffectInfo::RequiredTagsDescription' has a wrong offset!");

// Class FortniteGame.FortGameMode
// 0x0104 (0x03D4 - 0x02D0)
class AFortGameMode : public AGameMode
{
public:
	uint8                                         bBuildAnimCheat : 1;                               // 0x02D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bDisableCloudStorage : 1;                          // 0x02D0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bTravelInitiated : 1;                              // 0x02D0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         bTeamGame : 1;                                     // 0x02D0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheatBuildAnimHeight;                              // 0x02D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheatBuildAnimInterpSpeedMultiplier;               // 0x02D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheatBuildMaxDelay;                                // 0x02DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingConstructionTimeModifier;                  // 0x02E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentWUID;                                       // 0x02E4(0x000C)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlaylistId;                                 // 0x02F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentZoneInstanceId;                             // 0x02F4(0x000C)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x4];                                      // 0x0300(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ForceWorldName;                                    // 0x0304(0x000C)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZoneIndex;                                         // 0x0310(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPlayersInvincible : 1;                            // 0x0314(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bKickIdlers;                                       // 0x0318(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxIdleTime;                                       // 0x031C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortGameDeathPenalty>   DeathPenaltyData;                                  // 0x0320(0x0018)(Edit, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  StartingObjectiveObject;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x4];                                      // 0x0340(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameSession*                       FortGameSession;                                   // 0x0344(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameModeSessionString;                             // 0x0348(0x000C)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultPawnClassName;                              // 0x0354(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortMissionManager>        MissionManagerClass;                               // 0x0360(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x10];                                     // 0x0364(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EFortGameplayState                            PendingTimerState;                                 // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_375[0x7];                                      // 0x0375(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bWorldIsReady : 1;                                 // 0x037C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bTheaterDataIsReady : 1;                           // 0x037C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TheaterSlot;                                       // 0x0380(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  GameContextTags;                                   // 0x0384(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class APlayerController>          FakePlayerClass;                                   // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortRegisteredPlayer>          RegisteredPlayers;                                 // 0x03A0(0x000C)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortTeamInfo>              TeamInfoClass;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B0[0x20];                                     // 0x03B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMissionGenerationManager*          MissionGenerationManager;                          // 0x03D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleScoreToXPUpdate();

	void DumpReservations() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameMode">();
	}
	static class AFortGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameMode>();
	}
};
static_assert(alignof(AFortGameMode) == 0x000004, "Wrong alignment on AFortGameMode");
static_assert(sizeof(AFortGameMode) == 0x0003D4, "Wrong size on AFortGameMode");
static_assert(offsetof(AFortGameMode, CheatBuildAnimHeight) == 0x0002D4, "Member 'AFortGameMode::CheatBuildAnimHeight' has a wrong offset!");
static_assert(offsetof(AFortGameMode, CheatBuildAnimInterpSpeedMultiplier) == 0x0002D8, "Member 'AFortGameMode::CheatBuildAnimInterpSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(AFortGameMode, CheatBuildMaxDelay) == 0x0002DC, "Member 'AFortGameMode::CheatBuildMaxDelay' has a wrong offset!");
static_assert(offsetof(AFortGameMode, BuildingConstructionTimeModifier) == 0x0002E0, "Member 'AFortGameMode::BuildingConstructionTimeModifier' has a wrong offset!");
static_assert(offsetof(AFortGameMode, CurrentWUID) == 0x0002E4, "Member 'AFortGameMode::CurrentWUID' has a wrong offset!");
static_assert(offsetof(AFortGameMode, CurrentPlaylistId) == 0x0002F0, "Member 'AFortGameMode::CurrentPlaylistId' has a wrong offset!");
static_assert(offsetof(AFortGameMode, CurrentZoneInstanceId) == 0x0002F4, "Member 'AFortGameMode::CurrentZoneInstanceId' has a wrong offset!");
static_assert(offsetof(AFortGameMode, ForceWorldName) == 0x000304, "Member 'AFortGameMode::ForceWorldName' has a wrong offset!");
static_assert(offsetof(AFortGameMode, ZoneIndex) == 0x000310, "Member 'AFortGameMode::ZoneIndex' has a wrong offset!");
static_assert(offsetof(AFortGameMode, bKickIdlers) == 0x000318, "Member 'AFortGameMode::bKickIdlers' has a wrong offset!");
static_assert(offsetof(AFortGameMode, MaxIdleTime) == 0x00031C, "Member 'AFortGameMode::MaxIdleTime' has a wrong offset!");
static_assert(offsetof(AFortGameMode, DeathPenaltyData) == 0x000320, "Member 'AFortGameMode::DeathPenaltyData' has a wrong offset!");
static_assert(offsetof(AFortGameMode, StartingObjectiveObject) == 0x000338, "Member 'AFortGameMode::StartingObjectiveObject' has a wrong offset!");
static_assert(offsetof(AFortGameMode, FortGameSession) == 0x000344, "Member 'AFortGameMode::FortGameSession' has a wrong offset!");
static_assert(offsetof(AFortGameMode, GameModeSessionString) == 0x000348, "Member 'AFortGameMode::GameModeSessionString' has a wrong offset!");
static_assert(offsetof(AFortGameMode, DefaultPawnClassName) == 0x000354, "Member 'AFortGameMode::DefaultPawnClassName' has a wrong offset!");
static_assert(offsetof(AFortGameMode, MissionManagerClass) == 0x000360, "Member 'AFortGameMode::MissionManagerClass' has a wrong offset!");
static_assert(offsetof(AFortGameMode, PendingTimerState) == 0x000374, "Member 'AFortGameMode::PendingTimerState' has a wrong offset!");
static_assert(offsetof(AFortGameMode, TheaterSlot) == 0x000380, "Member 'AFortGameMode::TheaterSlot' has a wrong offset!");
static_assert(offsetof(AFortGameMode, GameContextTags) == 0x000384, "Member 'AFortGameMode::GameContextTags' has a wrong offset!");
static_assert(offsetof(AFortGameMode, FakePlayerClass) == 0x00039C, "Member 'AFortGameMode::FakePlayerClass' has a wrong offset!");
static_assert(offsetof(AFortGameMode, RegisteredPlayers) == 0x0003A0, "Member 'AFortGameMode::RegisteredPlayers' has a wrong offset!");
static_assert(offsetof(AFortGameMode, TeamInfoClass) == 0x0003AC, "Member 'AFortGameMode::TeamInfoClass' has a wrong offset!");
static_assert(offsetof(AFortGameMode, MissionGenerationManager) == 0x0003D0, "Member 'AFortGameMode::MissionGenerationManager' has a wrong offset!");

// Class FortniteGame.FortGameModeEmptyDedicated
// 0x0004 (0x03D8 - 0x03D4)
class AFortGameModeEmptyDedicated final : public AFortGameMode
{
public:
	class AFortGameSessionDedicated*              FortGameSessionDedicated;                          // 0x03D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameModeEmptyDedicated">();
	}
	static class AFortGameModeEmptyDedicated* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameModeEmptyDedicated>();
	}
};
static_assert(alignof(AFortGameModeEmptyDedicated) == 0x000004, "Wrong alignment on AFortGameModeEmptyDedicated");
static_assert(sizeof(AFortGameModeEmptyDedicated) == 0x0003D8, "Wrong size on AFortGameModeEmptyDedicated");
static_assert(offsetof(AFortGameModeEmptyDedicated, FortGameSessionDedicated) == 0x0003D4, "Member 'AFortGameModeEmptyDedicated::FortGameSessionDedicated' has a wrong offset!");

// Class FortniteGame.FortItemCollectedParams
// 0x000C (0x0028 - 0x001C)
class UFortItemCollectedParams final : public UFortMissionEventParams
{
public:
	class UFortWorldItemDefinition*               CollectedItemDefinition;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  CollectedBy;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountCollected;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BreakData(class UFortWorldItemDefinition** _CollectedItemDefinition, class AFortPlayerController** _CollectedBy, int32* _AmountCollected);
	void MakeData(const class UFortWorldItemDefinition* _CollectedItemDefinition, class AFortPlayerController* _CollectedBy, int32 _AmountCollected, class UFortItemCollectedParams** ThisParam);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemCollectedParams">();
	}
	static class UFortItemCollectedParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemCollectedParams>();
	}
};
static_assert(alignof(UFortItemCollectedParams) == 0x000004, "Wrong alignment on UFortItemCollectedParams");
static_assert(sizeof(UFortItemCollectedParams) == 0x000028, "Wrong size on UFortItemCollectedParams");
static_assert(offsetof(UFortItemCollectedParams, CollectedItemDefinition) == 0x00001C, "Member 'UFortItemCollectedParams::CollectedItemDefinition' has a wrong offset!");
static_assert(offsetof(UFortItemCollectedParams, CollectedBy) == 0x000020, "Member 'UFortItemCollectedParams::CollectedBy' has a wrong offset!");
static_assert(offsetof(UFortItemCollectedParams, AmountCollected) == 0x000024, "Member 'UFortItemCollectedParams::AmountCollected' has a wrong offset!");

// Class FortniteGame.AIHotSpotConfig
// 0x0014 (0x0030 - 0x001C)
class UAIHotSpotConfig final : public UDataAsset
{
public:
	TArray<struct FAIHotSpotSlotConfig>           Slots;                                             // 0x001C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         bDetectUnreachableSlots : 1;                       // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIHotSpotSlotGenerator*                SlotGenerator;                                     // 0x002C(0x0004)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotConfig">();
	}
	static class UAIHotSpotConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotConfig>();
	}
};
static_assert(alignof(UAIHotSpotConfig) == 0x000004, "Wrong alignment on UAIHotSpotConfig");
static_assert(sizeof(UAIHotSpotConfig) == 0x000030, "Wrong size on UAIHotSpotConfig");
static_assert(offsetof(UAIHotSpotConfig, Slots) == 0x00001C, "Member 'UAIHotSpotConfig::Slots' has a wrong offset!");
static_assert(offsetof(UAIHotSpotConfig, SlotGenerator) == 0x00002C, "Member 'UAIHotSpotConfig::SlotGenerator' has a wrong offset!");

// Class FortniteGame.WorldMapPin
// 0x000C (0x024C - 0x0240)
class AWorldMapPin final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetComponent*                       WidgetComponent;                                   // 0x0244(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TheaterIndex;                                      // 0x0248(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnTheaterIndexSet();
	void SetTheaterIndex(int32 NewIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMapPin">();
	}
	static class AWorldMapPin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWorldMapPin>();
	}
};
static_assert(alignof(AWorldMapPin) == 0x000004, "Wrong alignment on AWorldMapPin");
static_assert(sizeof(AWorldMapPin) == 0x00024C, "Wrong size on AWorldMapPin");
static_assert(offsetof(AWorldMapPin, SceneComponent) == 0x000240, "Member 'AWorldMapPin::SceneComponent' has a wrong offset!");
static_assert(offsetof(AWorldMapPin, WidgetComponent) == 0x000244, "Member 'AWorldMapPin::WidgetComponent' has a wrong offset!");
static_assert(offsetof(AWorldMapPin, TheaterIndex) == 0x000248, "Member 'AWorldMapPin::TheaterIndex' has a wrong offset!");

// Class FortniteGame.AIHotSpotSlot
// 0x0084 (0x00A0 - 0x001C)
class UAIHotSpotSlot : public UObject
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         UserId;                                            // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bStartEnabled : 1;                                 // 0x005C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bHasCachedAgentData : 1;                           // 0x005C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bHasOverlappingSlots : 1;                          // 0x005C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bIsBlockingOthers : 1;                             // 0x005C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x005C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected))
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          Owner;                                             // 0x0060(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SlotIndex;                                         // 0x0064(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAIHotSpotSlot                                SlotState;                                         // 0x0068(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x37];                                      // 0x0069(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSlot();
	void OnStateChanged(class AAIController* SlotOwner, EAIHotSpotSlot NewState);
	void SetSlotEnabled(bool bNewEnabled);
	void SetSlotOwnerAndState(class AAIController* NewOwner, EAIHotSpotSlot NewState);
	void SetSlotState(EAIHotSpotSlot NewState);

	class AAIHotSpot* GetHotSpot() const;
	struct FBox GetSlotBounds() const;
	float GetSlotHeight() const;
	int32 GetSlotIndex() const;
	struct FVector GetSlotLocation() const;
	class AAIController* GetSlotOwner() const;
	float GetSlotRadius() const;
	struct FRotator GetSlotRotation() const;
	EAIHotSpotSlot GetSlotState() const;
	int32 GetSlotUserId() const;
	bool HasUserId() const;
	bool IsAIAllowed(const class AAIController* AI) const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotSlot">();
	}
	static class UAIHotSpotSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotSlot>();
	}
};
static_assert(alignof(UAIHotSpotSlot) == 0x000010, "Wrong alignment on UAIHotSpotSlot");
static_assert(sizeof(UAIHotSpotSlot) == 0x0000A0, "Wrong size on UAIHotSpotSlot");
static_assert(offsetof(UAIHotSpotSlot, LocalTransform) == 0x000020, "Member 'UAIHotSpotSlot::LocalTransform' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Height) == 0x000050, "Member 'UAIHotSpotSlot::Height' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Radius) == 0x000054, "Member 'UAIHotSpotSlot::Radius' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, UserId) == 0x000058, "Member 'UAIHotSpotSlot::UserId' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Owner) == 0x000060, "Member 'UAIHotSpotSlot::Owner' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, SlotIndex) == 0x000064, "Member 'UAIHotSpotSlot::SlotIndex' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, SlotState) == 0x000068, "Member 'UAIHotSpotSlot::SlotState' has a wrong offset!");

// Class FortniteGame.FortDifficultyOption
// 0x0010 (0x002C - 0x001C)
class UFortDifficultyOption : public UObject
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CostAndAvailability;                               // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDifficultyOption">();
	}
	static class UFortDifficultyOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDifficultyOption>();
	}
};
static_assert(alignof(UFortDifficultyOption) == 0x000004, "Wrong alignment on UFortDifficultyOption");
static_assert(sizeof(UFortDifficultyOption) == 0x00002C, "Wrong size on UFortDifficultyOption");
static_assert(offsetof(UFortDifficultyOption, CostAndAvailability) == 0x000020, "Member 'UFortDifficultyOption::CostAndAvailability' has a wrong offset!");

// Class FortniteGame.FortGameplayCueNotify_Simple
// 0x0014 (0x0044 - 0x0030)
class UFortGameplayCueNotify_Simple : public UGameplayCueNotify_Static
{
public:
	class USoundBase*                             StartSound;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                        StartParticleSystem;                               // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachPoint;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStayAttached;                                     // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseHitResult;                                     // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseWeapon;                                        // 0x0042(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIgnoreRotation;                                   // 0x0043(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotify_Simple">();
	}
	static class UFortGameplayCueNotify_Simple* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCueNotify_Simple>();
	}
};
static_assert(alignof(UFortGameplayCueNotify_Simple) == 0x000004, "Wrong alignment on UFortGameplayCueNotify_Simple");
static_assert(sizeof(UFortGameplayCueNotify_Simple) == 0x000044, "Wrong size on UFortGameplayCueNotify_Simple");
static_assert(offsetof(UFortGameplayCueNotify_Simple, StartSound) == 0x000030, "Member 'UFortGameplayCueNotify_Simple::StartSound' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, StartParticleSystem) == 0x000034, "Member 'UFortGameplayCueNotify_Simple::StartParticleSystem' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, AttachPoint) == 0x000038, "Member 'UFortGameplayCueNotify_Simple::AttachPoint' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, bStayAttached) == 0x000040, "Member 'UFortGameplayCueNotify_Simple::bStayAttached' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, bUseHitResult) == 0x000041, "Member 'UFortGameplayCueNotify_Simple::bUseHitResult' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, bUseWeapon) == 0x000042, "Member 'UFortGameplayCueNotify_Simple::bUseWeapon' has a wrong offset!");
static_assert(offsetof(UFortGameplayCueNotify_Simple, bIgnoreRotation) == 0x000043, "Member 'UFortGameplayCueNotify_Simple::bIgnoreRotation' has a wrong offset!");

// Class FortniteGame.FortDifficultyOptionCategory
// 0x0004 (0x0020 - 0x001C)
class UFortDifficultyOptionCategory : public UDataAsset
{
public:
	bool                                          bIsRequired;                                       // 0x001C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsStatic;                                         // 0x001D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasValueRange;                                    // 0x001E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDifficultyOptionCategory">();
	}
	static class UFortDifficultyOptionCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDifficultyOptionCategory>();
	}
};
static_assert(alignof(UFortDifficultyOptionCategory) == 0x000004, "Wrong alignment on UFortDifficultyOptionCategory");
static_assert(sizeof(UFortDifficultyOptionCategory) == 0x000020, "Wrong size on UFortDifficultyOptionCategory");
static_assert(offsetof(UFortDifficultyOptionCategory, bIsRequired) == 0x00001C, "Member 'UFortDifficultyOptionCategory::bIsRequired' has a wrong offset!");
static_assert(offsetof(UFortDifficultyOptionCategory, bIsStatic) == 0x00001D, "Member 'UFortDifficultyOptionCategory::bIsStatic' has a wrong offset!");
static_assert(offsetof(UFortDifficultyOptionCategory, bHasValueRange) == 0x00001E, "Member 'UFortDifficultyOptionCategory::bHasValueRange' has a wrong offset!");

// Class FortniteGame.FortMissionConfigData
// 0x0000 (0x001C - 0x001C)
class UFortMissionConfigData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMissionConfigData">();
	}
	static class UFortMissionConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMissionConfigData>();
	}
};
static_assert(alignof(UFortMissionConfigData) == 0x000004, "Wrong alignment on UFortMissionConfigData");
static_assert(sizeof(UFortMissionConfigData) == 0x00001C, "Wrong size on UFortMissionConfigData");

// Class FortniteGame.FortAIHotSpot_Building
// 0x0024 (0x0348 - 0x0324)
class AFortAIHotSpot_Building final : public AFortAIHotSpot
{
public:
	EFortHotSpotDirection                         DirectionType;                                     // 0x0324(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325[0x23];                                     // 0x0325(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIHotSpot_Building">();
	}
	static class AFortAIHotSpot_Building* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAIHotSpot_Building>();
	}
};
static_assert(alignof(AFortAIHotSpot_Building) == 0x000004, "Wrong alignment on AFortAIHotSpot_Building");
static_assert(sizeof(AFortAIHotSpot_Building) == 0x000348, "Wrong size on AFortAIHotSpot_Building");
static_assert(offsetof(AFortAIHotSpot_Building, DirectionType) == 0x000324, "Member 'AFortAIHotSpot_Building::DirectionType' has a wrong offset!");

// Class FortniteGame.FortGameplayAbility
// 0x03D0 (0x06DC - 0x030C)
class UFortGameplayAbility : public UGameplayAbility
{
public:
	uint8                                         Pad_30C[0x8];                                      // 0x030C(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EFortGameplayAbilityActivation                ActivationType;                                    // 0x0314(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainer           EffectContainers[0x5];                             // 0x0318(0x006C)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortGameplayEffectContainer>   GameplayEffectContainers;                          // 0x0534(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortProjectileBase>        ProjectileClass;                                   // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    DamageStatHandle;                                  // 0x0544(0x000C)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FFortAbilityCost>               AbilityCosts;                                      // 0x0550(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         bShowWidgetForCosts : 1;                           // 0x055C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic))
	uint8                                         Pad_55D[0x3];                                      // 0x055D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bStartWithCooldown;                                // 0x0560(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPersistOnDeath;                                   // 0x0561(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_562[0x2];                                      // 0x0562(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ProhibitedTargetTags;                              // 0x0564(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bStopsAIBehaviorLogic;                             // 0x057C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStopsAIMovement;                                  // 0x057D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRelevantForAIDespawning;                          // 0x057E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseAIFireLocationAndRotation;                     // 0x057F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FireOffset;                                        // 0x0580(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bVerifyFireOffsetIsNotObstructedByWorldGeometry;   // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCanHitBallisticTestsOnlyTestIndesructiblesWhileFalling; // 0x058D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58E[0x2];                                      // 0x058E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivationNoiseRange;                              // 0x0590(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactNoiseRange;                                  // 0x0594(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActivationNoiseLoudness;                           // 0x0598(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactNoiseLoudness;                               // 0x059C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeadPawnTargets;                                  // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DesiredThrowAngle;                                 // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxYawAngleToFire;                                 // 0x05A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMaxYawAngleToFire;                           // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseTargetActorLocation;                           // 0x05AD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5AE[0x2];                                      // 0x05AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
