#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_classes.hpp"
#include "FriendsAndChat_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class FortniteUI.FortAbstractButtonGroup
// 0x0048 (0x0118 - 0x00D0)
class UFortAbstractButtonGroup : public UWidget
{
public:
	int32                                         SelectedIndex;                                     // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x00D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x00D5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                InternalPadding;                                   // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	ESelectionMode                                SelectionMode;                                     // 0x00E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonGroupDirection                         LayoutMode;                                        // 0x00E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnButtonClicked;                                   // 0x00EC(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TArray<class FText>                           DataProvider;                                      // 0x00F8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UFortButton*>                    Buttons;                                           // 0x0104(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleButtonClicked(class UFortButton* Button);
	void SetDataProvider(const TArray<class FText>& InDataProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAbstractButtonGroup">();
	}
	static class UFortAbstractButtonGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAbstractButtonGroup>();
	}
};
static_assert(alignof(UFortAbstractButtonGroup) == 0x000004, "Wrong alignment on UFortAbstractButtonGroup");
static_assert(sizeof(UFortAbstractButtonGroup) == 0x000118, "Wrong size on UFortAbstractButtonGroup");
static_assert(offsetof(UFortAbstractButtonGroup, SelectedIndex) == 0x0000D0, "Member 'UFortAbstractButtonGroup::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, VerticalAlignment) == 0x0000D4, "Member 'UFortAbstractButtonGroup::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, HorizontalAlignment) == 0x0000D5, "Member 'UFortAbstractButtonGroup::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, InternalPadding) == 0x0000D8, "Member 'UFortAbstractButtonGroup::InternalPadding' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, SelectionMode) == 0x0000E8, "Member 'UFortAbstractButtonGroup::SelectionMode' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, LayoutMode) == 0x0000E9, "Member 'UFortAbstractButtonGroup::LayoutMode' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, OnButtonClicked) == 0x0000EC, "Member 'UFortAbstractButtonGroup::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, DataProvider) == 0x0000F8, "Member 'UFortAbstractButtonGroup::DataProvider' has a wrong offset!");
static_assert(offsetof(UFortAbstractButtonGroup, Buttons) == 0x000104, "Member 'UFortAbstractButtonGroup::Buttons' has a wrong offset!");

// Class FortniteUI.FortButtonGroup
// 0x0014 (0x012C - 0x0118)
class UFortButtonGroup final : public UFortAbstractButtonGroup
{
public:
	TDelegate<void()>                             OnGenerateButtonEvent;                             // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortButton>                ButtonClass;                                       // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortButtonGroup">();
	}
	static class UFortButtonGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortButtonGroup>();
	}
};
static_assert(alignof(UFortButtonGroup) == 0x000004, "Wrong alignment on UFortButtonGroup");
static_assert(sizeof(UFortButtonGroup) == 0x00012C, "Wrong size on UFortButtonGroup");
static_assert(offsetof(UFortButtonGroup, OnGenerateButtonEvent) == 0x000118, "Member 'UFortButtonGroup::OnGenerateButtonEvent' has a wrong offset!");
static_assert(offsetof(UFortButtonGroup, ButtonClass) == 0x000128, "Member 'UFortButtonGroup::ButtonClass' has a wrong offset!");

// Class FortniteUI.FortTabButtonGroup
// 0x0014 (0x012C - 0x0118)
class UFortTabButtonGroup final : public UFortAbstractButtonGroup
{
public:
	TDelegate<void()>                             OnGenerateButtonEvent;                             // 0x0118(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortTabButton>             ButtonClass;                                       // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UFortTabButton* GetTabButton(int32 INDEX);
	void SetInitialButtonSelection(int32 INDEX);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTabButtonGroup">();
	}
	static class UFortTabButtonGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTabButtonGroup>();
	}
};
static_assert(alignof(UFortTabButtonGroup) == 0x000004, "Wrong alignment on UFortTabButtonGroup");
static_assert(sizeof(UFortTabButtonGroup) == 0x00012C, "Wrong size on UFortTabButtonGroup");
static_assert(offsetof(UFortTabButtonGroup, OnGenerateButtonEvent) == 0x000118, "Member 'UFortTabButtonGroup::OnGenerateButtonEvent' has a wrong offset!");
static_assert(offsetof(UFortTabButtonGroup, ButtonClass) == 0x000128, "Member 'UFortTabButtonGroup::ButtonClass' has a wrong offset!");

// Class FortniteUI.FortActorCanvas
// 0x0008 (0x00E8 - 0x00E0)
class UFortActorCanvas final : public UPanelWidget
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortActorCanvasSlot* AddActorIndicator(class UFortActorIndicatorWidget* Indicator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActorCanvas">();
	}
	static class UFortActorCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActorCanvas>();
	}
};
static_assert(alignof(UFortActorCanvas) == 0x000004, "Wrong alignment on UFortActorCanvas");
static_assert(sizeof(UFortActorCanvas) == 0x0000E8, "Wrong size on UFortActorCanvas");

// Class FortniteUI.FortActorCanvasSlot
// 0x0008 (0x002C - 0x0024)
class UFortActorCanvasSlot final : public UPanelSlot
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanAutoRemove;                                    // 0x0026(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x5];                                       // 0x0027(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCanAutoRemove(bool bAllowAutoRemove);
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActorCanvasSlot">();
	}
	static class UFortActorCanvasSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActorCanvasSlot>();
	}
};
static_assert(alignof(UFortActorCanvasSlot) == 0x000004, "Wrong alignment on UFortActorCanvasSlot");
static_assert(sizeof(UFortActorCanvasSlot) == 0x00002C, "Wrong size on UFortActorCanvasSlot");
static_assert(offsetof(UFortActorCanvasSlot, HorizontalAlignment) == 0x000024, "Member 'UFortActorCanvasSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UFortActorCanvasSlot, VerticalAlignment) == 0x000025, "Member 'UFortActorCanvasSlot::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UFortActorCanvasSlot, bCanAutoRemove) == 0x000026, "Member 'UFortActorCanvasSlot::bCanAutoRemove' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_SetUIState
// 0x0014 (0x0030 - 0x001C)
class UFortAsyncAction_SetUIState final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnStateEntered;                                    // 0x001C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAsyncAction_SetUIState* SetUIState(class UObject* InWorldContextObject, EFortUIState DesiredState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_SetUIState">();
	}
	static class UFortAsyncAction_SetUIState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_SetUIState>();
	}
};
static_assert(alignof(UFortAsyncAction_SetUIState) == 0x000004, "Wrong alignment on UFortAsyncAction_SetUIState");
static_assert(sizeof(UFortAsyncAction_SetUIState) == 0x000030, "Wrong size on UFortAsyncAction_SetUIState");
static_assert(offsetof(UFortAsyncAction_SetUIState, OnStateEntered) == 0x00001C, "Member 'UFortAsyncAction_SetUIState::OnStateEntered' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_SetUIState, WorldContextObject) == 0x000028, "Member 'UFortAsyncAction_SetUIState::WorldContextObject' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_ShowConfirmation
// 0x0078 (0x0094 - 0x001C)
class UFortAsyncAction_ShowConfirmation final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnConfirmed;                                       // 0x001C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDeclined;                                        // 0x0028(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTimedOut;                                        // 0x0034(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription                 Description;                                       // 0x0044(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_ShowConfirmation* ShowConfirmationDialog(class UObject* InWorldContextObject, const class FText& Title, const class FText& Message, const class FText& ConfirmButtonText, const class FText& DeclineButtonText, class UFortUserWidget* InAdditionalContent, float InDisplayTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowConfirmation">();
	}
	static class UFortAsyncAction_ShowConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowConfirmation>();
	}
};
static_assert(alignof(UFortAsyncAction_ShowConfirmation) == 0x000004, "Wrong alignment on UFortAsyncAction_ShowConfirmation");
static_assert(sizeof(UFortAsyncAction_ShowConfirmation) == 0x000094, "Wrong size on UFortAsyncAction_ShowConfirmation");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnConfirmed) == 0x00001C, "Member 'UFortAsyncAction_ShowConfirmation::OnConfirmed' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnDeclined) == 0x000028, "Member 'UFortAsyncAction_ShowConfirmation::OnDeclined' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnTimedOut) == 0x000034, "Member 'UFortAsyncAction_ShowConfirmation::OnTimedOut' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, WorldContextObject) == 0x000040, "Member 'UFortAsyncAction_ShowConfirmation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, Description) == 0x000044, "Member 'UFortAsyncAction_ShowConfirmation::Description' has a wrong offset!");

// Class FortniteUI.FortBangWrapper
// 0x0030 (0x0110 - 0x00E0)
class UFortBangWrapper final : public UContentWidget
{
public:
	uint8                                         Pad_E0[0x4];                                       // 0x00E0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EFortBangSize                                 Size;                                              // 0x00E4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EFortBangType                                 BangType;                                          // 0x00F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialNameID;                                    // 0x00F4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortTutorialGlowType                         TutorialGlowType;                                  // 0x00FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x13];                                      // 0x00FD(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBangVisibility(bool InVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBangWrapper">();
	}
	static class UFortBangWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBangWrapper>();
	}
};
static_assert(alignof(UFortBangWrapper) == 0x000004, "Wrong alignment on UFortBangWrapper");
static_assert(sizeof(UFortBangWrapper) == 0x000110, "Wrong size on UFortBangWrapper");
static_assert(offsetof(UFortBangWrapper, Size) == 0x0000E4, "Member 'UFortBangWrapper::Size' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, Offset) == 0x0000E8, "Member 'UFortBangWrapper::Offset' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, BangType) == 0x0000F0, "Member 'UFortBangWrapper::BangType' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, TutorialNameID) == 0x0000F4, "Member 'UFortBangWrapper::TutorialNameID' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, TutorialGlowType) == 0x0000FC, "Member 'UFortBangWrapper::TutorialGlowType' has a wrong offset!");

// Class FortniteUI.FortButtonInternalWidget
// 0x000C (0x0384 - 0x0378)
class UFortButtonInternalWidget final : public UButton
{
public:
	bool                                          IsClickable;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0xB];                                      // 0x0379(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortButtonInternalWidget">();
	}
	static class UFortButtonInternalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortButtonInternalWidget>();
	}
};
static_assert(alignof(UFortButtonInternalWidget) == 0x000004, "Wrong alignment on UFortButtonInternalWidget");
static_assert(sizeof(UFortButtonInternalWidget) == 0x000384, "Wrong size on UFortButtonInternalWidget");
static_assert(offsetof(UFortButtonInternalWidget, IsClickable) == 0x000378, "Member 'UFortButtonInternalWidget::IsClickable' has a wrong offset!");

// Class FortniteUI.FortUserWidget
// 0x008C (0x0244 - 0x01B8)
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_1B8[0x4];                                      // 0x01B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConsumePointerInput;                              // 0x01BC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BD[0x87];                                     // 0x01BD(0x0087)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _BPInvalidate(class FName Type);
	void DispatchEvent(class FName EventName);
	void PreConstruct(bool IsDesignTime);
	void RegisterForEvent(class FName EventName, TDelegate<void(class UFortUserWidget* InWidget)> InCallback);
	void RegisterForInvalidation(class FName InvalidationType, TDelegate<void()> Callback);
	void UnregisterForEvent(class FName EventName, TDelegate<void(class UFortUserWidget* InWidget)> InCallback);

	bool IsInvalid(class FName Type) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUserWidget">();
	}
	static class UFortUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserWidget>();
	}
};
static_assert(alignof(UFortUserWidget) == 0x000004, "Wrong alignment on UFortUserWidget");
static_assert(sizeof(UFortUserWidget) == 0x000244, "Wrong size on UFortUserWidget");
static_assert(offsetof(UFortUserWidget, bConsumePointerInput) == 0x0001BC, "Member 'UFortUserWidget::bConsumePointerInput' has a wrong offset!");

// Class FortniteUI.FortButtonStyle
// 0x15C0 (0x15DC - 0x001C)
class UFortButtonStyle : public UObject
{
public:
	struct FFortStateStyle                        NormalBase;                                        // 0x001C(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        NormalHovered;                                     // 0x02F4(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        NormalPressed;                                     // 0x05CC(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        SelectedBase;                                      // 0x08A4(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        SelectedHovered;                                   // 0x0B7C(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        SelectedPressed;                                   // 0x0E54(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                        Disabled;                                          // 0x112C(0x02D8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortMultiSizeMargin                   ButtonPadding;                                     // 0x1404(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortMultiSizeFont                     Font;                                              // 0x1464(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortMultiSizeMargin                   CustomPadding;                                     // 0x1554(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateSound                            PressedSlateSound;                                 // 0x15B4(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x15C8(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static const struct FSlateBrush GetBrushBySizeFromMultiSizeBrush(const struct FFortMultiSizeBrush& MultiSizeBrush, EFortBrushSize Size);
	static const struct FSlateFontInfo GetFontBySizeFromMultiSizeFont(const struct FFortMultiSizeFont& MultiSizeFont, EFortBrushSize Size);
	static const struct FMargin GetMarginBySizeFromMultiSizeMargin(const struct FFortMultiSizeMargin& MultiSizeMargin, EFortBrushSize Size);

	const struct FMargin GetButtonPaddingBySize(EFortBrushSize Size) const;
	const struct FMargin GetCustomPaddingBySize(EFortBrushSize Size) const;
	const struct FSlateFontInfo GetFontBySize(EFortBrushSize Size) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortButtonStyle">();
	}
	static class UFortButtonStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortButtonStyle>();
	}
};
static_assert(alignof(UFortButtonStyle) == 0x000004, "Wrong alignment on UFortButtonStyle");
static_assert(sizeof(UFortButtonStyle) == 0x0015DC, "Wrong size on UFortButtonStyle");
static_assert(offsetof(UFortButtonStyle, NormalBase) == 0x00001C, "Member 'UFortButtonStyle::NormalBase' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, NormalHovered) == 0x0002F4, "Member 'UFortButtonStyle::NormalHovered' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, NormalPressed) == 0x0005CC, "Member 'UFortButtonStyle::NormalPressed' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, SelectedBase) == 0x0008A4, "Member 'UFortButtonStyle::SelectedBase' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, SelectedHovered) == 0x000B7C, "Member 'UFortButtonStyle::SelectedHovered' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, SelectedPressed) == 0x000E54, "Member 'UFortButtonStyle::SelectedPressed' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, Disabled) == 0x00112C, "Member 'UFortButtonStyle::Disabled' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, ButtonPadding) == 0x001404, "Member 'UFortButtonStyle::ButtonPadding' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, Font) == 0x001464, "Member 'UFortButtonStyle::Font' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, CustomPadding) == 0x001554, "Member 'UFortButtonStyle::CustomPadding' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, PressedSlateSound) == 0x0015B4, "Member 'UFortButtonStyle::PressedSlateSound' has a wrong offset!");
static_assert(offsetof(UFortButtonStyle, HoveredSlateSound) == 0x0015C8, "Member 'UFortButtonStyle::HoveredSlateSound' has a wrong offset!");

// Class FortniteUI.FortBaseButton
// 0x04F8 (0x073C - 0x0244)
class UFortBaseButton : public UFortUserWidget
{
public:
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EnabledChanged;                                    // 0x0248(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   SelectedChanged;                                   // 0x0254(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   ButtonClicked;                                     // 0x0260(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EFortBangSize                                 BangSize;                                          // 0x026C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BangOffset;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	EFortBangType                                 BangType;                                          // 0x0278(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialNameID;                                    // 0x027C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortTutorialGlowType                         TutorialGlowType;                                  // 0x0284(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortButtonStyle>           Style;                                             // 0x0288(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortBrushSize                                BrushSize;                                         // 0x028C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0290(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x02A4(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bSelectable;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectionGroup;                                    // 0x02BC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bToggleable;                                       // 0x02C4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	bool                                          bClickable;                                        // 0x02C5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	EButtonClickMethod                            ClickMethod;                                       // 0x02C6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C7[0x475];                                    // 0x02C7(0x0475)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceClick();
	int32 GetSelectionGroupIndex();
	void OnButtonClicked();
	void SetBangVisibility(bool bVisible);
	void SetBrushSize(EFortBrushSize InSize);
	void SetClickable(bool InClickable);
	void SetClickMethod(EButtonClickMethod InClickMethod);
	void SetHovered(bool InHovered);
	void SetSelected(bool InSelected);
	void SetSelectionGroup(class FName InSelectionGroup);
	void SetStyle(TSubclassOf<class UFortButtonStyle> InStyle);

	const struct FMargin GetCurrentButtonPadding() const;
	const struct FMargin GetCurrentCustomPadding() const;
	const struct FSlateFontInfo GetCurrentFont() const;
	const struct FFortStateStyle GetCurrentStateStyle() const;
	bool GetSelected() const;
	class UFortButtonStyle* GetStyle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseButton">();
	}
	static class UFortBaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseButton>();
	}
};
static_assert(alignof(UFortBaseButton) == 0x000004, "Wrong alignment on UFortBaseButton");
static_assert(sizeof(UFortBaseButton) == 0x00073C, "Wrong size on UFortBaseButton");
static_assert(offsetof(UFortBaseButton, EnabledChanged) == 0x000248, "Member 'UFortBaseButton::EnabledChanged' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, SelectedChanged) == 0x000254, "Member 'UFortBaseButton::SelectedChanged' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, ButtonClicked) == 0x000260, "Member 'UFortBaseButton::ButtonClicked' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, BangSize) == 0x00026C, "Member 'UFortBaseButton::BangSize' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, BangOffset) == 0x000270, "Member 'UFortBaseButton::BangOffset' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, BangType) == 0x000278, "Member 'UFortBaseButton::BangType' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, TutorialNameID) == 0x00027C, "Member 'UFortBaseButton::TutorialNameID' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, TutorialGlowType) == 0x000284, "Member 'UFortBaseButton::TutorialGlowType' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, Style) == 0x000288, "Member 'UFortBaseButton::Style' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, BrushSize) == 0x00028C, "Member 'UFortBaseButton::BrushSize' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, PressedSlateSoundOverride) == 0x000290, "Member 'UFortBaseButton::PressedSlateSoundOverride' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, HoveredSlateSoundOverride) == 0x0002A4, "Member 'UFortBaseButton::HoveredSlateSoundOverride' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, bSelectable) == 0x0002B8, "Member 'UFortBaseButton::bSelectable' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, SelectionGroup) == 0x0002BC, "Member 'UFortBaseButton::SelectionGroup' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, bToggleable) == 0x0002C4, "Member 'UFortBaseButton::bToggleable' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, bClickable) == 0x0002C5, "Member 'UFortBaseButton::bClickable' has a wrong offset!");
static_assert(offsetof(UFortBaseButton, ClickMethod) == 0x0002C6, "Member 'UFortBaseButton::ClickMethod' has a wrong offset!");

// Class FortniteUI.FortFrontEndContext
// 0x0118 (0x0134 - 0x001C)
class UFortFrontEndContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnFrontEndCameraChanged;                           // 0x0020(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                   OnTheaterSelected;                                 // 0x002C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTheaterDataChanged;                              // 0x0038(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTheaterTileClicked;                              // 0x0044(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTheaterTileUnselected;                           // 0x0050(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnRecruitHero;                                     // 0x005C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnPlayerLoggedIn;                                  // 0x0068(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnPlayerLoggedOut;                                 // 0x0074(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnOutpostViewLoaded;                               // 0x0080(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFortFrontEndFeatureStruct             Features[0x9];                                     // 0x008C(0x0010)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortSavedModeLoadout                  CachedModeLoadout;                                 // 0x011C(0x0018)(Transient, NativeAccessSpecifierPrivate)

public:
	void BindToFeatureStateAndInitialize(EFortFrontEndFeature Feature, TDelegate<void(EFortFrontEndFeature ChangedFeature, EFortFrontEndFeatureState NewState)> Delegate);
	void ClearNativeWidget(class UNativeWidgetHost* InNativeWidgetHost);
	void ClearSelectedTheater();
	void ForceSetFeatureState(EFortFrontEndFeature Feature, EFortFrontEndFeatureState State);
	class FText GetAttributeDescription(const struct FFortAttributeInfo& InAttribute, const struct FGameplayTagContainer& InRequiredTags);
	class FText GetAttributeDisplayName(const struct FFortAttributeInfo& InAttribute, const struct FGameplayTagContainer& InRequiredTags);
	struct FFortMultiSizeBrush GetAttributeIcon(const struct FFortAttributeInfo& InAttribute, const struct FGameplayTagContainer& InRequiredTags);
	class AFortPlayerPawn* GetHeroPlayerPawnByIndex(int32 PartyMemberIndex);
	class UFortPersistentResourceItemDefinition* GetPersistentResourceItemDefinition(EFortPersistentResources ResourceType);
	void GetSelectableGadgets(TArray<class UFortWorldItem*>* SelectableGadgets, TArray<class UFortWorldItem*>* LastSelectedGadgets);
	bool IsActiveTileMissionValid();
	bool LoadOutpostView(int32 TheaterSlot);
	void MarkSeenItemsInVault();
	void NotifyCreateBuildingClosed(class UHomeBaseBuilding* Building);
	void RunBenchmarkAndApplyBestSettings();
	void SelectDefaultTheaterTile();
	void SelectGadgetForSlot(int32 Slot, class UFortItemDefinition* GadgetDefinition);
	void SetFrontEndCamera(EFrontEndCamera NewState);
	void SetHeroChoice(int32 PartyMemberIndex, class UFortHero* Hero);
	void SetPersonalHeroChoice(class UFortHero* Hero);
	void SetSelectedTheater(int32 TheaterIndex);
	void SkipInitialBenchmark();
	void ViewVaultItem(class UFortItem* ItemToView);

	void CreateKeepMenu(class UNativeWidgetHost* InNativeWidgetHost, class UHomeBaseBuilding* Building) const;
	void GetAccountLevelUpRewards(TArray<struct FFortItemQuantityPair>* Rewards, int32 AccountLevel) const;
	class AFortTheaterMapTile* GetActiveTile() const;
	bool GetActiveTileMissionDetails(struct FFortMissionDetails* MissionDetails) const;
	bool GetAllTheaterData(TArray<struct FFortTheaterMapData>* OutAllTheaterData) const;
	TArray<struct FGameDifficultyInfo> GetAvailibleDifficulties() const;
	class FText GetCurrentTheaterName() const;
	EFrontEndCamera GetDesiredPlayButtonCamera() const;
	int32 GetFabricatorDisintegrationSecondsRemaining(int32 TheaterSlot) const;
	int32 GetFabricatorIncomingGooAmount(int32 TheaterSlot) const;
	int32 GetFabricatorMaxCapacity(int32 TheaterSlot) const;
	int32 GetFabricatorStoredGooAmount(int32 TheaterSlot) const;
	EFortFrontEndFeatureState GetFeatureState(EFortFrontEndFeature Feature) const;
	EFrontEndCamera GetFrontEndCamera() const;
	class UFortWorldItemDefinition* GetHarvestingToolForLevel(int32 TheaterSlot, int32 InHarvestingOptimizerLevel) const;
	class UFortItemDefinition* GetItemFromItemQuantityPair(const struct FFortItemQuantityPair& InPair) const;
	int32 GetMaxNumberOfItemsInStorageVault(int32 TheaterSlot) const;
	int32 GetNumberOfItemsInStorageVault(int32 TheaterSlot) const;
	int32 GetOutpostStructureLevel(int32 TheaterSlot, class UFortOutpostItemDefinition* OutpostStructure) const;
	int32 GetOutpostStructureMaxLevel(int32 TheaterSlot, class UFortOutpostItemDefinition* OutpostStructure) const;
	void GetOutpostStructureUpgradeCost(int32 TheaterSlot, int32 UpgradeLevel, class UFortOutpostItemDefinition* OutpostStructure, TArray<struct FFortItemQuantityPair>* OutWorldItems, TArray<struct FFortItemQuantityPair>* OutAccountItems) const;
	class UFortPersistentResourceItemDefinition* GetPersonnelResourceItemDefinition() const;
	struct FSlateBrush GetPersonnelXpResourceBrush() const;
	class FText GetRequirementText(const struct FFortRequirementsInfo& InRequirements) const;
	class UFortPersistentResourceItemDefinition* GetSchematicResourceItemDefinition() const;
	struct FSlateBrush GetSchematicXpResourceBrush() const;
	bool GetSelectedTheaterData(struct FFortTheaterMapData* OutTheaterData) const;
	int32 GetSelectedTheaterIndex() const;
	bool GetTheaterData(int32 TheaterIndex, struct FFortTheaterMapData* OutTheaterData) const;
	class FText GetTheaterDifficultyText(int32 TheaterIndex) const;
	class FText GetTheaterName(int32 TheaterIndex) const;
	int32 GetTheaterRegionCount(int32 TheaterIndex) const;
	EFortTheaterType GetTheaterType(int32 TheaterIndex) const;
	bool GetTileMissionDetails(const class AFortTheaterMapTile* Tile, struct FFortMissionDetails* MissionDetails) const;
	bool IsFabricatorDisintegrating(int32 TheaterSlot) const;
	bool ShouldRunInitialBenchmark() const;
	void TriggerUIFeedbackEvent(class FName EventName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortFrontEndContext">();
	}
	static class UFortFrontEndContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortFrontEndContext>();
	}
};
static_assert(alignof(UFortFrontEndContext) == 0x000004, "Wrong alignment on UFortFrontEndContext");
static_assert(sizeof(UFortFrontEndContext) == 0x000134, "Wrong size on UFortFrontEndContext");
static_assert(offsetof(UFortFrontEndContext, OnFrontEndCameraChanged) == 0x000020, "Member 'UFortFrontEndContext::OnFrontEndCameraChanged' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnTheaterSelected) == 0x00002C, "Member 'UFortFrontEndContext::OnTheaterSelected' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnTheaterDataChanged) == 0x000038, "Member 'UFortFrontEndContext::OnTheaterDataChanged' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnTheaterTileClicked) == 0x000044, "Member 'UFortFrontEndContext::OnTheaterTileClicked' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnTheaterTileUnselected) == 0x000050, "Member 'UFortFrontEndContext::OnTheaterTileUnselected' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnRecruitHero) == 0x00005C, "Member 'UFortFrontEndContext::OnRecruitHero' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnPlayerLoggedIn) == 0x000068, "Member 'UFortFrontEndContext::OnPlayerLoggedIn' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnPlayerLoggedOut) == 0x000074, "Member 'UFortFrontEndContext::OnPlayerLoggedOut' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, OnOutpostViewLoaded) == 0x000080, "Member 'UFortFrontEndContext::OnOutpostViewLoaded' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, Features) == 0x00008C, "Member 'UFortFrontEndContext::Features' has a wrong offset!");
static_assert(offsetof(UFortFrontEndContext, CachedModeLoadout) == 0x00011C, "Member 'UFortFrontEndContext::CachedModeLoadout' has a wrong offset!");

// Class FortniteUI.FortGlobalUIContext
// 0x014C (0x0168 - 0x001C)
class UFortGlobalUIContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnKeybindsChanged;                                 // 0x0020(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamPowerChanged;                                // 0x002C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   DragAndDropStartedDelegate;                        // 0x0038(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   DragAndDropEndedDelegate;                          // 0x0044(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnNetworkError;                                    // 0x0050(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnQueryFortBackendVersionComplete;                 // 0x005C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortUIMessageManager*> MessageManagersByName;                             // 0x0080(0x003C)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	struct FFortUIFeatureStruct                   Features[0x3];                                     // 0x00BC(0x0010)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x78];                                      // 0x00EC(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsUIVisible;                                      // 0x0164(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void CheckFlag(const class FString& FlagName, EFlagStatus* OutStatus);

	void BindToFeatureStateAndInitialize(EFortUIFeature Feature, TDelegate<void(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState)> Delegate);
	void CheckNetworkError();
	void ClearSelectionGroup(class FName SelectionGroup);
	void DisplayStateContent(bool bDisplay);
	class FString GetBackendName();
	struct FFortBackendVersion GetGameBackendVersion();
	class UFortUIMessageManager* GetMessageManager(class FName ManagerName, bool* bCreatedNew);
	bool GetNextNotification(struct FFortDialogDescription* NotifcationDescription);
	class FString GetWatermark();
	void HideBang(EFortBangType Type);
	bool IsBluGloEnabled();
	bool IsHUDVisible();
	void Logout();
	void ProcessNotificationResult(EFortDialogResult InResult, const struct FFortDialogDescription& NotificationDescription);
	void QueryGameBackendVersion();
	void QuitGame();
	void RegisterScriptedAction(TSubclassOf<class AFortScriptedAction> ScriptedAction);
	void RegisterScriptedActions(const TArray<TSubclassOf<class AFortScriptedAction>>& ScriptedActions);
	void RegisterToReceiveNotifications(TDelegate<void()> InOnNotifcationAvailable);
	void RemoveNotification(const struct FFortDialogDescription& NotificationDescription);
	void SendExperienceRatingAnalytic(const class FString& RatingType, const int32& StarCount, const class FString& GameSessionID, const class FString& Comment);
	void SendLeaveZoneAnalytic();
	void SendUINavigationAnalytic(const class FString& Destination, bool bUserInitiated);
	void ShowBang(EFortBangType Type);
	void TakeScreenshot(TDelegate<void(int32 Width, int32 Height, const TArray<struct FColor>& Colors)> Callback);
	void UnregisterScriptedAction(TSubclassOf<class AFortScriptedAction> ScriptedAction);
	void UnregisterToReceiveNotifications();

	void ClearLastGameSummaryInfo() const;
	EFortInputPreset GetActiveKeybindSet() const;
	EFortUIFeatureState GetFeatureState(EFortUIFeature Feature) const;
	struct FKey GetKeyForAction(class FName Action) const;
	class FText GetKeyTextForAction(class FName Action) const;
	struct FGameSummaryInfo GetLastGameSummaryInfo() const;
	class UFortQuestManager* GetQuestManager() const;
	void GetTeamPower(int32* TeamPower, int32* PersonalPower) const;
	bool IsInOutpostZone() const;
	bool IsInZone() const;
	bool IsUIVisible() const;
	bool ShouldCloseMenuOnEscape() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGlobalUIContext">();
	}
	static class UFortGlobalUIContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGlobalUIContext>();
	}
};
static_assert(alignof(UFortGlobalUIContext) == 0x000004, "Wrong alignment on UFortGlobalUIContext");
static_assert(sizeof(UFortGlobalUIContext) == 0x000168, "Wrong size on UFortGlobalUIContext");
static_assert(offsetof(UFortGlobalUIContext, OnKeybindsChanged) == 0x000020, "Member 'UFortGlobalUIContext::OnKeybindsChanged' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, OnTeamPowerChanged) == 0x00002C, "Member 'UFortGlobalUIContext::OnTeamPowerChanged' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, DragAndDropStartedDelegate) == 0x000038, "Member 'UFortGlobalUIContext::DragAndDropStartedDelegate' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, DragAndDropEndedDelegate) == 0x000044, "Member 'UFortGlobalUIContext::DragAndDropEndedDelegate' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, OnNetworkError) == 0x000050, "Member 'UFortGlobalUIContext::OnNetworkError' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, OnQueryFortBackendVersionComplete) == 0x00005C, "Member 'UFortGlobalUIContext::OnQueryFortBackendVersionComplete' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, MessageManagersByName) == 0x000080, "Member 'UFortGlobalUIContext::MessageManagersByName' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, Features) == 0x0000BC, "Member 'UFortGlobalUIContext::Features' has a wrong offset!");
static_assert(offsetof(UFortGlobalUIContext, bIsUIVisible) == 0x000164, "Member 'UFortGlobalUIContext::bIsUIVisible' has a wrong offset!");

// Class FortniteUI.FortGridPickerTile
// 0x0008 (0x024C - 0x0244)
class UFortGridPickerTile : public UFortUserWidget
{
public:
	class UObject*                                Data;                                              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGridWidgetBase*                    Owner;                                             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ForwardClicked();
	void OnClicked();
	void OnMouseEnter();
	void OnMouseLeave();
	void SetData(class UObject* InData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridPickerTile">();
	}
	static class UFortGridPickerTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerTile>();
	}
};
static_assert(alignof(UFortGridPickerTile) == 0x000004, "Wrong alignment on UFortGridPickerTile");
static_assert(sizeof(UFortGridPickerTile) == 0x00024C, "Wrong size on UFortGridPickerTile");
static_assert(offsetof(UFortGridPickerTile, Data) == 0x000244, "Member 'UFortGridPickerTile::Data' has a wrong offset!");
static_assert(offsetof(UFortGridPickerTile, Owner) == 0x000248, "Member 'UFortGridPickerTile::Owner' has a wrong offset!");

// Class FortniteUI.FortGridWidgetBase
// 0x010C (0x01EC - 0x00E0)
class UFortGridWidgetBase : public UContentWidget
{
public:
	TSubclassOf<class UFortGridPickerTile>        ClearWidgetType;                                   // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileWidth;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileHeight;                                        // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesAcross;                                       // 0x00EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesDown;                                         // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShrinkToFit;                                      // 0x00F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PeekOverflowTilePercentage;                        // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TilePadding;                                       // 0x00FC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            GridBackground;                                    // 0x010C(0x0074)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                GridBackgroundPadding;                             // 0x0180(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        DataProvider;                                      // 0x0190(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                   OnTileGenerated;                                   // 0x019C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTileClicked;                                     // 0x01A8(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseEnterTile;                                  // 0x01B4(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseLeaveTile;                                  // 0x01C0(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGridPickerTile>        TileWidgetType;                                    // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridSortKind                                 SortKind;                                          // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReversed;                                         // 0x01D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Data)>          GetSortKeyFor;                                     // 0x01D4(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x8];                                      // 0x01E4(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetClearWidgetType(TSubclassOf<class UFortGridPickerTile> InClearWidgetType);
	void SetDataProvider(const TArray<class UObject*>& Data);
	void SetPeekOverflowTilePercentage(float Percent);
	void SetTileHeight(float Height);
	void SetTilePadding(const struct FMargin& Padding);
	void SetTilesAcross(int32 Across);
	void SetTilesDown(int32 Down);
	void SetTileWidth(float Width);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridWidgetBase">();
	}
	static class UFortGridWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridWidgetBase>();
	}
};
static_assert(alignof(UFortGridWidgetBase) == 0x000004, "Wrong alignment on UFortGridWidgetBase");
static_assert(sizeof(UFortGridWidgetBase) == 0x0001EC, "Wrong size on UFortGridWidgetBase");
static_assert(offsetof(UFortGridWidgetBase, ClearWidgetType) == 0x0000E0, "Member 'UFortGridWidgetBase::ClearWidgetType' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TileWidth) == 0x0000E4, "Member 'UFortGridWidgetBase::TileWidth' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TileHeight) == 0x0000E8, "Member 'UFortGridWidgetBase::TileHeight' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilesAcross) == 0x0000EC, "Member 'UFortGridWidgetBase::TilesAcross' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilesDown) == 0x0000F0, "Member 'UFortGridWidgetBase::TilesDown' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, bShrinkToFit) == 0x0000F4, "Member 'UFortGridWidgetBase::bShrinkToFit' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, PeekOverflowTilePercentage) == 0x0000F8, "Member 'UFortGridWidgetBase::PeekOverflowTilePercentage' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilePadding) == 0x0000FC, "Member 'UFortGridWidgetBase::TilePadding' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, GridBackground) == 0x00010C, "Member 'UFortGridWidgetBase::GridBackground' has a wrong offset!");
