#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortnitePartyHeroSelect_Camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C
// 0x0010 (0x0618 - 0x0608)
class AFortnitePartyHeroSelect_Camera_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       CameraActor_0;                                     // 0x060C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          MouseDown;                                         // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CachedPawn;                                        // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FortnitePartyHeroSelect_Camera(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnDeactivated();
	void OnActivated();
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_16(const struct FKey& Key);
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_17(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_18(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_19(const struct FKey& Key);
	void UserConstructionScript();
	void HandleMouseRelease();
	void HandleMousePress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortnitePartyHeroSelect_Camera_C">();
	}
	static class AFortnitePartyHeroSelect_Camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortnitePartyHeroSelect_Camera_C>();
	}
};
static_assert(alignof(AFortnitePartyHeroSelect_Camera_C) == 0x000004, "Wrong alignment on AFortnitePartyHeroSelect_Camera_C");
static_assert(sizeof(AFortnitePartyHeroSelect_Camera_C) == 0x000618, "Wrong size on AFortnitePartyHeroSelect_Camera_C");
static_assert(offsetof(AFortnitePartyHeroSelect_Camera_C, UberGraphFrame) == 0x000608, "Member 'AFortnitePartyHeroSelect_Camera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFortnitePartyHeroSelect_Camera_C, CameraActor_0) == 0x00060C, "Member 'AFortnitePartyHeroSelect_Camera_C::CameraActor_0' has a wrong offset!");
static_assert(offsetof(AFortnitePartyHeroSelect_Camera_C, MouseDown) == 0x000610, "Member 'AFortnitePartyHeroSelect_Camera_C::MouseDown' has a wrong offset!");
static_assert(offsetof(AFortnitePartyHeroSelect_Camera_C, CachedPawn) == 0x000614, "Member 'AFortnitePartyHeroSelect_Camera_C::CachedPawn' has a wrong offset!");

}

#pragma pack(pop)
