#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendsAndChat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// ScriptStruct FriendsAndChat.FriendsMarkupStyle
// 0x048C (0x0490 - 0x0004)
struct FFriendsMarkupStyle final : public FSlateWidgetStyle
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0004(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x0230(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x0330(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x03A4(0x001C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x03C0(0x001C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x03DC(0x001C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x03F8(0x0074)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x046C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x0470(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x0480(0x0010)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsMarkupStyle) == 0x000004, "Wrong alignment on FFriendsMarkupStyle");
static_assert(sizeof(FFriendsMarkupStyle) == 0x000490, "Wrong size on FFriendsMarkupStyle");
static_assert(offsetof(FFriendsMarkupStyle, MarkupButtonStyle) == 0x000004, "Member 'FFriendsMarkupStyle::MarkupButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, MarkupTextStyle) == 0x000230, "Member 'FFriendsMarkupStyle::MarkupTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, MarkupBackground) == 0x000330, "Member 'FFriendsMarkupStyle::MarkupBackground' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, ButtonColor) == 0x0003A4, "Member 'FFriendsMarkupStyle::ButtonColor' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, ButtonHoverColor) == 0x0003C0, "Member 'FFriendsMarkupStyle::ButtonHoverColor' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, TipColor) == 0x0003DC, "Member 'FFriendsMarkupStyle::TipColor' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, SeperatorBrush) == 0x0003F8, "Member 'FFriendsMarkupStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, SeperatorThickness) == 0x00046C, "Member 'FFriendsMarkupStyle::SeperatorThickness' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, MarkupPadding) == 0x000470, "Member 'FFriendsMarkupStyle::MarkupPadding' has a wrong offset!");
static_assert(offsetof(FFriendsMarkupStyle, ButtonPadding) == 0x000480, "Member 'FFriendsMarkupStyle::ButtonPadding' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsChatStyle
// 0x1260 (0x1264 - 0x0004)
struct FFriendsChatStyle final : public FSlateWidgetStyle
{
public:
	struct FTextBlockStyle                        TextStyle;                                         // 0x0004(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TimeStampTextStyle;                                // 0x0104(0x0100)(Edit, NativeAccessSpecifierPublic)
	float                                         TimeStampOpacity;                                  // 0x0204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x0208(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x0218(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x0228(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x0238(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x0248(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0258(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x0268(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x0278(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x0288(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x0298(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x02A8(0x0698)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0940(0x0698)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x0FD8(0x01D4)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x11AC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x1220(0x0010)(Edit, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x1230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x1234(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x1244(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x1254(0x0010)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsChatStyle) == 0x000004, "Wrong alignment on FFriendsChatStyle");
static_assert(sizeof(FFriendsChatStyle) == 0x001264, "Wrong size on FFriendsChatStyle");
static_assert(offsetof(FFriendsChatStyle, TextStyle) == 0x000004, "Member 'FFriendsChatStyle::TextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, TimeStampTextStyle) == 0x000104, "Member 'FFriendsChatStyle::TimeStampTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, TimeStampOpacity) == 0x000204, "Member 'FFriendsChatStyle::TimeStampOpacity' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, DefaultChatColor) == 0x000208, "Member 'FFriendsChatStyle::DefaultChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, WhisperChatColor) == 0x000218, "Member 'FFriendsChatStyle::WhisperChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, GlobalChatColor) == 0x000228, "Member 'FFriendsChatStyle::GlobalChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, GameChatColor) == 0x000238, "Member 'FFriendsChatStyle::GameChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, PartyChatColor) == 0x000248, "Member 'FFriendsChatStyle::PartyChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, AdminChatColor) == 0x000258, "Member 'FFriendsChatStyle::AdminChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, WhisperHyperlinkChatColor) == 0x000268, "Member 'FFriendsChatStyle::WhisperHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, GlobalHyperlinkChatColor) == 0x000278, "Member 'FFriendsChatStyle::GlobalHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, GameHyperlinkChatColor) == 0x000288, "Member 'FFriendsChatStyle::GameHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, PartyHyperlinkChatColor) == 0x000298, "Member 'FFriendsChatStyle::PartyHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, ChatEntryTextStyle) == 0x0002A8, "Member 'FFriendsChatStyle::ChatEntryTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, ChatDisplayTextStyle) == 0x000940, "Member 'FFriendsChatStyle::ChatDisplayTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, ScrollBorderStyle) == 0x000FD8, "Member 'FFriendsChatStyle::ScrollBorderStyle' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, MessageNotificationBrush) == 0x0011AC, "Member 'FFriendsChatStyle::MessageNotificationBrush' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, ChatEntryPadding) == 0x001220, "Member 'FFriendsChatStyle::ChatEntryPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, ChatEntryHeight) == 0x001230, "Member 'FFriendsChatStyle::ChatEntryHeight' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, FriendActionPadding) == 0x001234, "Member 'FFriendsChatStyle::FriendActionPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, FriendActionHeaderPadding) == 0x001244, "Member 'FFriendsChatStyle::FriendActionHeaderPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatStyle, FriendActionStatusMargin) == 0x001254, "Member 'FFriendsChatStyle::FriendActionStatusMargin' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsFontStyle
// 0x0120 (0x0124 - 0x0004)
struct FFriendsFontStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         FriendsFontSmall;                                  // 0x0004(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FriendsFontSmallBold;                              // 0x002C(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FriendsFontNormal;                                 // 0x0054(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FriendsFontNormalBold;                             // 0x007C(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FriendsFontLarge;                                  // 0x00A4(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FriendsFontLargeBold;                              // 0x00CC(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x00F4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x0104(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x0114(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsFontStyle) == 0x000004, "Wrong alignment on FFriendsFontStyle");
static_assert(sizeof(FFriendsFontStyle) == 0x000124, "Wrong size on FFriendsFontStyle");
static_assert(offsetof(FFriendsFontStyle, FriendsFontSmall) == 0x000004, "Member 'FFriendsFontStyle::FriendsFontSmall' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, FriendsFontSmallBold) == 0x00002C, "Member 'FFriendsFontStyle::FriendsFontSmallBold' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, FriendsFontNormal) == 0x000054, "Member 'FFriendsFontStyle::FriendsFontNormal' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, FriendsFontNormalBold) == 0x00007C, "Member 'FFriendsFontStyle::FriendsFontNormalBold' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, FriendsFontLarge) == 0x0000A4, "Member 'FFriendsFontStyle::FriendsFontLarge' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, FriendsFontLargeBold) == 0x0000CC, "Member 'FFriendsFontStyle::FriendsFontLargeBold' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, DefaultFontColor) == 0x0000F4, "Member 'FFriendsFontStyle::DefaultFontColor' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, InvertedFontColor) == 0x000104, "Member 'FFriendsFontStyle::InvertedFontColor' has a wrong offset!");
static_assert(offsetof(FFriendsFontStyle, DefaultDullFontColor) == 0x000114, "Member 'FFriendsFontStyle::DefaultDullFontColor' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsListStyle
// 0x2168 (0x216C - 0x0004)
struct FFriendsListStyle final : public FSlateWidgetStyle
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0004(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x0230(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x045C(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0688(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x08B4(0x001C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x08D0(0x001C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x08EC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x0960(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x0B8C(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x0DB8(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x0FE4(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x1058(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x10CC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FortniteImageBrush;                                // 0x1140(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FortniteDevImageBrush;                             // 0x11B4(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FortniteTestImageBrush;                            // 0x1228(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            LauncherImageBrush;                                // 0x129C(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UTImageBrush;                                      // 0x1310(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x1384(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x13F8(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x146C(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x14E0(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x1554(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x15C8(0x0698)(Edit, NativeAccessSpecifierPublic)
	struct FVector2D                              UserPresenceImageSize;                             // 0x1C60(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x1C68(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x1CDC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x1D50(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x1DC4(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x1E38(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x1EAC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                BackButtonMargin;                                  // 0x1F20(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x1F30(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x1F40(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                BackButtonContentMargin;                           // 0x1F50(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x1F60(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x1F70(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x1F80(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x1F90(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x1FA0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x1FB0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x1FC0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x1FD0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x1FE0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x1FF0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x2000(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x2010(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x2020(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x2030(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x2040(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x2050(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x2060(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x2070(0x0010)(Edit, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x2080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ClanDetailsBrush;                                  // 0x2084(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ClanMembersBrush;                                  // 0x20F8(0x0074)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsListStyle) == 0x000004, "Wrong alignment on FFriendsListStyle");
static_assert(sizeof(FFriendsListStyle) == 0x00216C, "Wrong size on FFriendsListStyle");
static_assert(offsetof(FFriendsListStyle, GlobalChatButtonStyle) == 0x000004, "Member 'FFriendsListStyle::GlobalChatButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendItemButtonStyle) == 0x000230, "Member 'FFriendsListStyle::FriendItemButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ConfirmButtonStyle) == 0x00045C, "Member 'FFriendsListStyle::ConfirmButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, CancelButtonStyle) == 0x000688, "Member 'FFriendsListStyle::CancelButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ButtonContentColor) == 0x0008B4, "Member 'FFriendsListStyle::ButtonContentColor' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ButtonHoverContentColor) == 0x0008D0, "Member 'FFriendsListStyle::ButtonHoverContentColor' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ActionMenuArrowBrush) == 0x0008EC, "Member 'FFriendsListStyle::ActionMenuArrowBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, BackButtonStyle) == 0x000960, "Member 'FFriendsListStyle::BackButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, HeaderButtonStyle) == 0x000B8C, "Member 'FFriendsListStyle::HeaderButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendListActionButtonStyle) == 0x000DB8, "Member 'FFriendsListStyle::FriendListActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, AddFriendButtonContentBrush) == 0x000FE4, "Member 'FFriendsListStyle::AddFriendButtonContentBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, StatusIconBrush) == 0x001058, "Member 'FFriendsListStyle::StatusIconBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendImageBrush) == 0x0010CC, "Member 'FFriendsListStyle::FriendImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FortniteImageBrush) == 0x001140, "Member 'FFriendsListStyle::FortniteImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FortniteDevImageBrush) == 0x0011B4, "Member 'FFriendsListStyle::FortniteDevImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FortniteTestImageBrush) == 0x001228, "Member 'FFriendsListStyle::FortniteTestImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, LauncherImageBrush) == 0x00129C, "Member 'FFriendsListStyle::LauncherImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, UTImageBrush) == 0x001310, "Member 'FFriendsListStyle::UTImageBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, OfflineBrush) == 0x001384, "Member 'FFriendsListStyle::OfflineBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, OnlineBrush) == 0x0013F8, "Member 'FFriendsListStyle::OnlineBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, AwayBrush) == 0x00146C, "Member 'FFriendsListStyle::AwayBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsContainerBackground) == 0x0014E0, "Member 'FFriendsListStyle::FriendsContainerBackground' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsListBackground) == 0x001554, "Member 'FFriendsListStyle::FriendsListBackground' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, AddFriendEditableTextStyle) == 0x0015C8, "Member 'FFriendsListStyle::AddFriendEditableTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, UserPresenceImageSize) == 0x001C60, "Member 'FFriendsListStyle::UserPresenceImageSize' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, BackBrush) == 0x001C68, "Member 'FFriendsListStyle::BackBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SelectedOptionBrush) == 0x001CDC, "Member 'FFriendsListStyle::SelectedOptionBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SettingsBrush) == 0x001D50, "Member 'FFriendsListStyle::SettingsBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SeperatorBrush) == 0x001DC4, "Member 'FFriendsListStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FontSizeBrush) == 0x001E38, "Member 'FFriendsListStyle::FontSizeBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SearchBrush) == 0x001EAC, "Member 'FFriendsListStyle::SearchBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, BackButtonMargin) == 0x001F20, "Member 'FFriendsListStyle::BackButtonMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, HeaderButtonMargin) == 0x001F30, "Member 'FFriendsListStyle::HeaderButtonMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsListMargin) == 0x001F40, "Member 'FFriendsListStyle::FriendsListMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, BackButtonContentMargin) == 0x001F50, "Member 'FFriendsListStyle::BackButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsListNoFriendsMargin) == 0x001F60, "Member 'FFriendsListStyle::FriendsListNoFriendsMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsListHeaderMargin) == 0x001F70, "Member 'FFriendsListStyle::FriendsListHeaderMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendsListHeaderCountMargin) == 0x001F80, "Member 'FFriendsListStyle::FriendsListHeaderCountMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, HeaderButtonContentMargin) == 0x001F90, "Member 'FFriendsListStyle::HeaderButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendItemMargin) == 0x001FA0, "Member 'FFriendsListStyle::FriendItemMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendItemStatusMargin) == 0x001FB0, "Member 'FFriendsListStyle::FriendItemStatusMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, FriendItemPresenceMargin) == 0x001FC0, "Member 'FFriendsListStyle::FriendItemPresenceMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ConfirmationBorderMargin) == 0x001FD0, "Member 'FFriendsListStyle::ConfirmationBorderMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ConfirmationButtonMargin) == 0x001FE0, "Member 'FFriendsListStyle::ConfirmationButtonMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ConfirmationButtonContentMargin) == 0x001FF0, "Member 'FFriendsListStyle::ConfirmationButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuBackIconMargin) == 0x002000, "Member 'FFriendsListStyle::SubMenuBackIconMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuPageIconMargin) == 0x002010, "Member 'FFriendsListStyle::SubMenuPageIconMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, RadioSettingTitleMargin) == 0x002020, "Member 'FFriendsListStyle::RadioSettingTitleMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuSearchIconMargin) == 0x002030, "Member 'FFriendsListStyle::SubMenuSearchIconMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuSearchTextMargin) == 0x002040, "Member 'FFriendsListStyle::SubMenuSearchTextMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuBackButtonMargin) == 0x002050, "Member 'FFriendsListStyle::SubMenuBackButtonMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuSettingButtonMargin) == 0x002060, "Member 'FFriendsListStyle::SubMenuSettingButtonMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuListMargin) == 0x002070, "Member 'FFriendsListStyle::SubMenuListMargin' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, SubMenuSeperatorThickness) == 0x002080, "Member 'FFriendsListStyle::SubMenuSeperatorThickness' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ClanDetailsBrush) == 0x002084, "Member 'FFriendsListStyle::ClanDetailsBrush' has a wrong offset!");
static_assert(offsetof(FFriendsListStyle, ClanMembersBrush) == 0x0020F8, "Member 'FFriendsListStyle::ClanMembersBrush' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsComboStyle
// 0x0DAC (0x0DB0 - 0x0004)
struct FFriendsComboStyle final : public FSlateWidgetStyle
{
public:
	struct FButtonStyle                           ComboItemButtonStyle;                              // 0x0004(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           ComboItemTextColorNormal;                          // 0x0230(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           ComboItemTextColorInverted;                        // 0x0240(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        ComboItemTextStyle;                                // 0x0250(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        FriendsComboTextStyle;                             // 0x0350(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FVector2D                              StatusButtonSize;                                  // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ActionComboButtonSize;                             // 0x0458(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FComboButtonStyle                      ActionComboButtonStyle;                            // 0x0460(0x0328)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        ActionComboButtonTextStyle;                        // 0x0788(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ComboMenuPadding;                                  // 0x0888(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ComboItemPadding;                                  // 0x0898(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ComboItemContentPadding;                           // 0x08A8(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendComboBackgroundLeftBrush;                    // 0x08B8(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendComboBackgroundRightBrush;                   // 0x092C(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendComboBackgroundLeftFlippedBrush;             // 0x09A0(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendComboBackgroundRightFlippedBrush;            // 0x0A14(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FComboButtonStyle                      FriendListComboButtonStyle;                        // 0x0A88(0x0328)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsComboStyle) == 0x000004, "Wrong alignment on FFriendsComboStyle");
static_assert(sizeof(FFriendsComboStyle) == 0x000DB0, "Wrong size on FFriendsComboStyle");
static_assert(offsetof(FFriendsComboStyle, ComboItemButtonStyle) == 0x000004, "Member 'FFriendsComboStyle::ComboItemButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboItemTextColorNormal) == 0x000230, "Member 'FFriendsComboStyle::ComboItemTextColorNormal' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboItemTextColorInverted) == 0x000240, "Member 'FFriendsComboStyle::ComboItemTextColorInverted' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboItemTextStyle) == 0x000250, "Member 'FFriendsComboStyle::ComboItemTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendsComboTextStyle) == 0x000350, "Member 'FFriendsComboStyle::FriendsComboTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, StatusButtonSize) == 0x000450, "Member 'FFriendsComboStyle::StatusButtonSize' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ActionComboButtonSize) == 0x000458, "Member 'FFriendsComboStyle::ActionComboButtonSize' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ActionComboButtonStyle) == 0x000460, "Member 'FFriendsComboStyle::ActionComboButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ActionComboButtonTextStyle) == 0x000788, "Member 'FFriendsComboStyle::ActionComboButtonTextStyle' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboMenuPadding) == 0x000888, "Member 'FFriendsComboStyle::ComboMenuPadding' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboItemPadding) == 0x000898, "Member 'FFriendsComboStyle::ComboItemPadding' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, ComboItemContentPadding) == 0x0008A8, "Member 'FFriendsComboStyle::ComboItemContentPadding' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendComboBackgroundLeftBrush) == 0x0008B8, "Member 'FFriendsComboStyle::FriendComboBackgroundLeftBrush' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendComboBackgroundRightBrush) == 0x00092C, "Member 'FFriendsComboStyle::FriendComboBackgroundRightBrush' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendComboBackgroundLeftFlippedBrush) == 0x0009A0, "Member 'FFriendsComboStyle::FriendComboBackgroundLeftFlippedBrush' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendComboBackgroundRightFlippedBrush) == 0x000A14, "Member 'FFriendsComboStyle::FriendComboBackgroundRightFlippedBrush' has a wrong offset!");
static_assert(offsetof(FFriendsComboStyle, FriendListComboButtonStyle) == 0x000A88, "Member 'FFriendsComboStyle::FriendListComboButtonStyle' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsChatChromeStyle
// 0x02E8 (0x02EC - 0x0004)
struct FFriendsChatChromeStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x0004(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x0078(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x00EC(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0160(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x0170(0x0074)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x01E4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x01F4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0204(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TabWidth;                                          // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0218(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0228(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0238(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0248(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x0258(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0268(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x0278(0x0074)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsChatChromeStyle) == 0x000004, "Wrong alignment on FFriendsChatChromeStyle");
static_assert(sizeof(FFriendsChatChromeStyle) == 0x0002EC, "Wrong size on FFriendsChatChromeStyle");
static_assert(offsetof(FFriendsChatChromeStyle, ChatBackgroundBrush) == 0x000004, "Member 'FFriendsChatChromeStyle::ChatBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatEntryBackgroundBrush) == 0x000078, "Member 'FFriendsChatChromeStyle::ChatEntryBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChannelBackgroundBrush) == 0x0000EC, "Member 'FFriendsChatChromeStyle::ChannelBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatEntryBackgroundColor) == 0x000160, "Member 'FFriendsChatChromeStyle::ChatEntryBackgroundColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, TabBackgroundBrush) == 0x000170, "Member 'FFriendsChatChromeStyle::TabBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, NoneActiveTabColor) == 0x0001E4, "Member 'FFriendsChatChromeStyle::NoneActiveTabColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, TabFontColor) == 0x0001F4, "Member 'FFriendsChatChromeStyle::TabFontColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, TabFontColorInverted) == 0x000204, "Member 'FFriendsChatChromeStyle::TabFontColorInverted' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, TabWidth) == 0x000214, "Member 'FFriendsChatChromeStyle::TabWidth' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, TabPadding) == 0x000218, "Member 'FFriendsChatChromeStyle::TabPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatWindowPadding) == 0x000228, "Member 'FFriendsChatChromeStyle::ChatWindowPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatWindowToEntryMargin) == 0x000238, "Member 'FFriendsChatChromeStyle::ChatWindowToEntryMargin' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatChannelPadding) == 0x000248, "Member 'FFriendsChatChromeStyle::ChatChannelPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatEntryPadding) == 0x000258, "Member 'FFriendsChatChromeStyle::ChatEntryPadding' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatBackgroundColor) == 0x000268, "Member 'FFriendsChatChromeStyle::ChatBackgroundColor' has a wrong offset!");
static_assert(offsetof(FFriendsChatChromeStyle, ChatMenuBackgroundBrush) == 0x000278, "Member 'FFriendsChatChromeStyle::ChatMenuBackgroundBrush' has a wrong offset!");

// ScriptStruct FriendsAndChat.FriendsAndChatStyle
// 0x4E6C (0x4E70 - 0x0004)
struct FFriendsAndChatStyle final : public FSlateWidgetStyle
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0004(0x0418)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x041C(0x022C)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsFontStyle                      FriendsSmallFontStyle;                             // 0x0648(0x0124)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsFontStyle                      FriendsNormalFontStyle;                            // 0x076C(0x0124)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsFontStyle                      FriendsLargeFontStyle;                             // 0x0890(0x0124)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x09B4(0x04B8)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x0E6C(0x04B8)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsListStyle                      FriendsListStyle;                                  // 0x1324(0x216C)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsChatStyle                      FriendsChatStyle;                                  // 0x3490(0x1264)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsChatChromeStyle                FriendsChatChromeStyle;                            // 0x46F4(0x02EC)(Edit, NativeAccessSpecifierPublic)
	struct FFriendsMarkupStyle                    FriendsMarkupStyle;                                // 0x49E0(0x0490)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFriendsAndChatStyle) == 0x000004, "Wrong alignment on FFriendsAndChatStyle");
static_assert(sizeof(FFriendsAndChatStyle) == 0x004E70, "Wrong size on FFriendsAndChatStyle");
static_assert(offsetof(FFriendsAndChatStyle, ScrollBarStyle) == 0x000004, "Member 'FFriendsAndChatStyle::ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(FFriendsAndChatStyle, ActionButtonStyle) == 0x00041C, "Member 'FFriendsAndChatStyle::ActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FFriendsAndChatStyle, FriendsSmallFontStyle) == 0x000648, "Member 'FFriendsAndChatStyle::FriendsSmallFontStyle' has a wrong offset!");
static_assert(offsetof(FFriendsAndChatStyle, FriendsNormalFontStyle) == 0x00076C, "Member 'FFriendsAndChatStyle::FriendsNormalFontStyle' has a wrong offset!");
