#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_EmergencyOverride

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Constructor_EmergencyOverride.GA_Constructor_EmergencyOverride_C.ExecuteUbergraph_GA_Constructor_EmergencyOverride
// 0x006C (0x006C - 0x0000)
struct GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x005C(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0068(0x0004)()
};
static_assert(alignof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride) == 0x000004, "Wrong alignment on GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride");
static_assert(sizeof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride) == 0x00006C, "Wrong size on GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride");
static_assert(offsetof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride, EntryPoint) == 0x000000, "Member 'GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride, K2Node_Event_EventData) == 0x000004, "Member 'GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x00005C, "Member 'GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000068, "Member 'GA_Constructor_EmergencyOverride_C_ExecuteUbergraph_GA_Constructor_EmergencyOverride::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Constructor_EmergencyOverride.GA_Constructor_EmergencyOverride_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Constructor_EmergencyOverride_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

#pragma pack(pop)
