#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_EmergencyOverride

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_ConstructorTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Constructor_EmergencyOverride.GA_Constructor_EmergencyOverride_C
// 0x0010 (0x0750 - 0x0740)
class UGA_Constructor_EmergencyOverride_C final : public UGAT_ConstructorTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Constructor_EmergencyOverride_C; // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_EmergencyOverride;                              // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Constructor_EmergencyOverride(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Constructor_EmergencyOverride_C">();
	}
	static class UGA_Constructor_EmergencyOverride_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Constructor_EmergencyOverride_C>();
	}
};
static_assert(alignof(UGA_Constructor_EmergencyOverride_C) == 0x000004, "Wrong alignment on UGA_Constructor_EmergencyOverride_C");
static_assert(sizeof(UGA_Constructor_EmergencyOverride_C) == 0x000750, "Wrong size on UGA_Constructor_EmergencyOverride_C");
static_assert(offsetof(UGA_Constructor_EmergencyOverride_C, UberGraphFrame_GA_Constructor_EmergencyOverride_C) == 0x000740, "Member 'UGA_Constructor_EmergencyOverride_C::UberGraphFrame_GA_Constructor_EmergencyOverride_C' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_EmergencyOverride_C, EventActivation) == 0x000744, "Member 'UGA_Constructor_EmergencyOverride_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_EmergencyOverride_C, GE_EmergencyOverride) == 0x00074C, "Member 'UGA_Constructor_EmergencyOverride_C::GE_EmergencyOverride' has a wrong offset!");

}

#pragma pack(pop)
