#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_TriggeredFatigue

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_ConstructorTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C
// 0x0030 (0x0770 - 0x0740)
class UGA_Constructor_TriggeredFatigue_C final : public UGAT_ConstructorTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Constructor_TriggeredFatigue_C;  // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NewVar_0;                                          // 0x074C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_PlasmaAbility;                                  // 0x0750(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_ConstructorFatigue;                             // 0x0768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_ConstructorFatigueInstant;                      // 0x076C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Constructor_TriggeredFatigue(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Constructor_TriggeredFatigue_C">();
	}
	static class UGA_Constructor_TriggeredFatigue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Constructor_TriggeredFatigue_C>();
	}
};
static_assert(alignof(UGA_Constructor_TriggeredFatigue_C) == 0x000004, "Wrong alignment on UGA_Constructor_TriggeredFatigue_C");
static_assert(sizeof(UGA_Constructor_TriggeredFatigue_C) == 0x000770, "Wrong size on UGA_Constructor_TriggeredFatigue_C");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, UberGraphFrame_GA_Constructor_TriggeredFatigue_C) == 0x000740, "Member 'UGA_Constructor_TriggeredFatigue_C::UberGraphFrame_GA_Constructor_TriggeredFatigue_C' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, EventActivation) == 0x000744, "Member 'UGA_Constructor_TriggeredFatigue_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, NewVar_0) == 0x00074C, "Member 'UGA_Constructor_TriggeredFatigue_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, TC_PlasmaAbility) == 0x000750, "Member 'UGA_Constructor_TriggeredFatigue_C::TC_PlasmaAbility' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, GE_ConstructorFatigue) == 0x000768, "Member 'UGA_Constructor_TriggeredFatigue_C::GE_ConstructorFatigue' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_TriggeredFatigue_C, GE_ConstructorFatigueInstant) == 0x00076C, "Member 'UGA_Constructor_TriggeredFatigue_C::GE_ConstructorFatigueInstant' has a wrong offset!");

}

#pragma pack(pop)
