#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CommandoFlakVest

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_CommandoFlakVest.GA_CommandoFlakVest_C.ExecuteUbergraph_GA_CommandoFlakVest
// 0x009C (0x009C - 0x0000)
struct GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0074(0x0004)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0078(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetStackCountToMax_ReturnValue;           // 0x0084(0x000C)()
	bool                                          CallFunc_DoesContainerHaveTag_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0094(0x0004)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest) == 0x000004, "Wrong alignment on GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest");
static_assert(sizeof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest) == 0x00009C, "Wrong size on GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, EntryPoint) == 0x000000, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, K2Node_Event_EventData) == 0x000004, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00005C, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000060, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000068, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x00006C, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_Greater_IntInt_ReturnValue) == 0x000070, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_K2_SetTimer_ReturnValue) == 0x000074, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000078, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_SetStackCountToMax_ReturnValue) == 0x000084, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_SetStackCountToMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_DoesContainerHaveTag_ReturnValue) == 0x000090, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_DoesContainerHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000094, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest, CallFunc_HasAuthority_ReturnValue) == 0x000098, "Member 'GA_CommandoFlakVest_C_ExecuteUbergraph_GA_CommandoFlakVest::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function GA_CommandoFlakVest.GA_CommandoFlakVest_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_CommandoFlakVest_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_CommandoFlakVest.GA_CommandoFlakVest_C.K2_ShouldAbilityRespondToEvent
// 0x0090 (0x0090 - 0x0000)
struct GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0034(0x0058)(Parm)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent) == 0x000004, "Wrong alignment on GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent) == 0x000090, "Wrong size on GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000034, "Member 'GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x00008C, "Member 'GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x00008D, "Member 'GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent, CallFunc_Not_PreBool_ReturnValue) == 0x00008E, "Member 'GA_CommandoFlakVest_C_K2_ShouldAbilityRespondToEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
