#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_FragGrenade

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.ExecuteUbergraph_GA_Commando_FragGrenade
// 0x036C (0x036C - 0x0000)
struct GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData4;                // 0x0004(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData3;                // 0x0030(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData2;                // 0x005C(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData;                 // 0x0088(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   Temp_struct_Variable;                              // 0x00B4(0x001C)(ContainsInstancedReference)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x00E0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x00F4(0x0008)()
	class AB_Prj_Commando_FragGrenade_C*          K2Node_DynamicCast_AsB_Prj_Commando_Frag_Grenade;  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0114(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0128(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0130(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0144(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate7;             // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x015C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable3;                             // 0x0164(0x0014)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate9;             // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x01A0(0x0034)(ContainsInstancedReference)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData6;                // 0x01D4(0x001C)(ConstParm, ContainsInstancedReference)
	class APlayerPawn_Commando_C*                 K2Node_DynamicCast_AsPlayer_Pawn_Commando;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01F8(0x0014)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x020C(0x0058)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0264(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x029C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData5;                // 0x02A8(0x001C)(ConstParm, ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput; // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_ThrowGrenade_Base_Grenade;                // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_ThrowGrenade_Spawn_Location;              // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ThrowGrenade_Spawn_Rotation;              // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ThrowGrenade_Projectile_Speed;            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ThrowGrenade_Projectile_Gravity;          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_ThrowGrenade_Explosion_Gameplay_Spec;     // 0x02F8(0x0064)()
	class UFortAbilityTask_SpawnProjectileAndWait* CallFunc_SpawnProjectileAndWait_ReturnValue;       // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade");
static_assert(sizeof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade) == 0x00036C, "Wrong size on GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, EntryPoint) == 0x000000, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData4) == 0x000004, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData3) == 0x000030, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData2) == 0x00005C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData) == 0x000088, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, Temp_struct_Variable) == 0x0000B4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_TargetData3) == 0x0000E0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ApplicationTag3) == 0x0000F4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_DynamicCast_AsB_Prj_Commando_Frag_Grenade) == 0x0000FC, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_DynamicCast_AsB_Prj_Commando_Frag_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate6) == 0x000104, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_TargetData2) == 0x000114, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ApplicationTag2) == 0x000128, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_TargetData) == 0x000130, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ApplicationTag) == 0x000144, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate7) == 0x00014C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, Temp_struct_Variable2) == 0x00015C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, Temp_struct_Variable3) == 0x000164, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate8) == 0x000178, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_WaitDelay_ReturnValue) == 0x000188, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate9) == 0x00018C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_IsValid_ReturnValue) == 0x00019C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_K2_CommitAbility_ReturnValue) == 0x00019D, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_GetActorInfo_ReturnValue) == 0x0001A0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData6) == 0x0001D4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData6' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_DynamicCast_AsPlayer_Pawn_Commando) == 0x0001F0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_DynamicCast_AsPlayer_Pawn_Commando' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_DynamicCast_bSuccess2) == 0x0001F4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001F8, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_MakeStruct_GameplayEventData) == 0x00020C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000264, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, Temp_bool_A_Execution_Happened_Variable) == 0x000270, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CreateDelegate_OutputDelegate10) == 0x000274, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, Temp_bool_B_Execution_Happened_Variable) == 0x000284, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_BooleanAND_ReturnValue) == 0x000285, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000288, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00028C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000290, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000298, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x00029C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x0002A4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_IsValid_ReturnValue2) == 0x0002A5, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, K2Node_CustomEvent_ProjectileData5) == 0x0002A8, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::K2Node_CustomEvent_ProjectileData5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput) == 0x0002C4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x0002CC, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0002D0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Base_Grenade) == 0x0002D4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Spawn_Location) == 0x0002D8, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Spawn_Location' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Spawn_Rotation) == 0x0002E4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Spawn_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Projectile_Speed) == 0x0002F0, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Projectile_Gravity) == 0x0002F4, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Projectile_Gravity' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_ThrowGrenade_Explosion_Gameplay_Spec) == 0x0002F8, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_ThrowGrenade_Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_SpawnProjectileAndWait_ReturnValue) == 0x00035C, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_SpawnProjectileAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_IsValid_ReturnValue3) == 0x000360, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000364, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade, CallFunc_BeginSpawningActor_ReturnValue) == 0x000368, "Member 'GA_Commando_FragGrenade_C_ExecuteUbergraph_GA_Commando_FragGrenade::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Triggered_DE7AD8FA464F26E37AC20281DAD7839E
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(sizeof(GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(offsetof(GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E, TargetData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E, ApplicationTag) == 0x000014, "Member 'GA_Commando_FragGrenade_C_Triggered_DE7AD8FA464F26E37AC20281DAD7839E::ApplicationTag' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Cancelled_DE7AD8FA464F26E37AC20281DAD7839E
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(sizeof(GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(offsetof(GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E, TargetData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E, ApplicationTag) == 0x000014, "Member 'GA_Commando_FragGrenade_C_Cancelled_DE7AD8FA464F26E37AC20281DAD7839E::ApplicationTag' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Completed_DE7AD8FA464F26E37AC20281DAD7839E
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(sizeof(GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E");
static_assert(offsetof(GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E, TargetData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E, ApplicationTag) == 0x000014, "Member 'GA_Commando_FragGrenade_C_Completed_DE7AD8FA464F26E37AC20281DAD7839E::ApplicationTag' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Created_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Created_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Touched_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Touched_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Bounced_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Bounced_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Stopped_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Stopped_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Exploded_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Exploded_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.Destroyed_A0715E3447A5D46682E46A89960E35AA
// 0x001C (0x001C - 0x0000)
struct GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA");
static_assert(sizeof(GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA) == 0x00001C, "Wrong size on GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA");
static_assert(offsetof(GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA, ProjectileData) == 0x000000, "Member 'GA_Commando_FragGrenade_C_Destroyed_A0715E3447A5D46682E46A89960E35AA::ProjectileData' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.ThrowGrenade
// 0x022C (0x022C - 0x0000)
struct GA_Commando_FragGrenade_C_ThrowGrenade final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 Base_Grenade;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Spawn_Location;                                    // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Spawn_Rotation;                                    // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Projectile_Speed;                                  // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Projectile_Gravity;                                // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       Explosion_Gameplay_Spec;                           // 0x0028(0x0064)(Parm, OutParm)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x008C(0x0064)()
	struct FFortAbilityTargetSelection            CallFunc_Array_Get_Item;                           // 0x00F0(0x004C)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2; // 0x013C(0x0064)()
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue2; // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue3; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue4; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue5; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue5;         // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self2_CastInput; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self3_CastInput; // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self4_CastInput; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self5_CastInput; // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAimLocationNearestPawn_ReturnValue;    // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_FragGrenade_C_ThrowGrenade) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_ThrowGrenade");
static_assert(sizeof(GA_Commando_FragGrenade_C_ThrowGrenade) == 0x00022C, "Wrong size on GA_Commando_FragGrenade_C_ThrowGrenade");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, AbilitySystemComponent) == 0x000000, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Base_Grenade) == 0x000004, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Spawn_Location) == 0x000008, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Spawn_Location' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Spawn_Rotation) == 0x000014, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Spawn_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Projectile_Speed) == 0x000020, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Projectile_Gravity) == 0x000024, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Projectile_Gravity' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, Explosion_Gameplay_Spec) == 0x000028, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x00008C, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2) == 0x00013C, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x0001A0, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetNumGameplayTagsInContainer_ReturnValue2) == 0x0001A4, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetNumGameplayTagsInContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x0001A9, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetNumGameplayTagsInContainer_ReturnValue3) == 0x0001AC, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetNumGameplayTagsInContainer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetNumGameplayTagsInContainer_ReturnValue4) == 0x0001B0, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetNumGameplayTagsInContainer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x0001B4, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GreaterEqual_IntInt_ReturnValue4) == 0x0001B5, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GreaterEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetNumGameplayTagsInContainer_ReturnValue5) == 0x0001B8, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetNumGameplayTagsInContainer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x0001BC, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x0001C4, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GreaterEqual_IntInt_ReturnValue5) == 0x0001C5, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GreaterEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BooleanAND_ReturnValue) == 0x0001C6, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_self2_CastInput) == 0x0001C8, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_self2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x0001D0, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BooleanAND_ReturnValue2) == 0x0001D1, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_self3_CastInput) == 0x0001D4, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_self3_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x0001DC, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_self4_CastInput) == 0x0001E0, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_self4_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue4) == 0x0001E8, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BooleanAND_ReturnValue3) == 0x0001E9, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BooleanAND_ReturnValue4) == 0x0001EA, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_self5_CastInput) == 0x0001EC, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_self5_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_HasAllMatchingGameplayTags_ReturnValue5) == 0x0001F4, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_HasAllMatchingGameplayTags_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BooleanAND_ReturnValue5) == 0x0001F5, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetAimLocationNearestPawn_ReturnValue) == 0x0001F8, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetAimLocationNearestPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000204, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BreakRotator_Roll) == 0x000210, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BreakRotator_Pitch) == 0x000214, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_BreakRotator_Yaw) == 0x000218, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_Add_FloatFloat_ReturnValue) == 0x00021C, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ThrowGrenade, CallFunc_MakeRotator_ReturnValue) == 0x000220, "Member 'GA_Commando_FragGrenade_C_ThrowGrenade::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function GA_Commando_FragGrenade.GA_Commando_FragGrenade_C.ActivateClusterBombs
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Commando_FragGrenade_C_ActivateClusterBombs final
{
public:
	struct FProjectileEventData                   Projectile_Data;                                   // 0x0000(0x001C)(Parm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0034(0x0064)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_FragGrenade_C_ActivateClusterBombs) == 0x000004, "Wrong alignment on GA_Commando_FragGrenade_C_ActivateClusterBombs");
static_assert(sizeof(GA_Commando_FragGrenade_C_ActivateClusterBombs) == 0x0000C0, "Wrong size on GA_Commando_FragGrenade_C_ActivateClusterBombs");
static_assert(offsetof(GA_Commando_FragGrenade_C_ActivateClusterBombs, Projectile_Data) == 0x000000, "Member 'GA_Commando_FragGrenade_C_ActivateClusterBombs::Projectile_Data' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_C_ActivateClusterBombs, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'GA_Commando_FragGrenade_C_ActivateClusterBombs::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
