#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_BASE

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Constructor_BASE.GA_Constructor_BASE_C.ExecuteUbergraph_GA_Constructor_BASE
// 0x0138 (0x0138 - 0x0000)
struct GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAbilityDecoTool*                   K2Node_DynamicCast_AsFort_Ability_Deco_Tool;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0040(0x0034)(ContainsInstancedReference)
	class APlayerPawn_Constructor_C*              K2Node_DynamicCast_AsPlayer_Pawn_Constructor;      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x008C(0x0058)()
	struct FAbilityToolSpawnParameters            CallFunc_GetSpawnParameters_OutSpawnParamters;     // 0x00E4(0x0020)()
	class ABuildingActor*                         CallFunc_AbilitySpawnDeco_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0108(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x011C(0x000C)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE) == 0x000004, "Wrong alignment on GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE");
static_assert(sizeof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE) == 0x000138, "Wrong size on GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, EntryPoint) == 0x000000, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_AsFort_Pawn) == 0x00001C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_AsFort_Ability_Deco_Tool) == 0x000024, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_AsFort_Ability_Deco_Tool' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x00002C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_GetActorInfo_ReturnValue) == 0x000040, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_AsPlayer_Pawn_Constructor) == 0x000074, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_AsPlayer_Pawn_Constructor' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_DynamicCast_bSuccess3) == 0x000078, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_CreateDelegate_OutputDelegate2) == 0x00007C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_MakeStruct_GameplayEventData) == 0x00008C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_GetSpawnParameters_OutSpawnParamters) == 0x0000E4, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_GetSpawnParameters_OutSpawnParamters' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_AbilitySpawnDeco_ReturnValue) == 0x000104, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_AbilitySpawnDeco_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000108, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00011C, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE, K2Node_CreateDelegate_OutputDelegate3) == 0x000128, "Member 'GA_Constructor_BASE_C_ExecuteUbergraph_GA_Constructor_BASE::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

}

#pragma pack(pop)
