#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_Firewall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_ConstructorTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Constructor_Firewall.GA_Constructor_Firewall_C
// 0x001C (0x075C - 0x0740)
class UGA_Constructor_Firewall_C final : public UGAT_ConstructorTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Constructor_Firewall_C;          // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_FirewallDamage;                                 // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           EventComplete;                                     // 0x0750(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ReflectedDamage_;                                  // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Constructor_Firewall(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Constructor_Firewall_C">();
	}
	static class UGA_Constructor_Firewall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Constructor_Firewall_C>();
	}
};
static_assert(alignof(UGA_Constructor_Firewall_C) == 0x000004, "Wrong alignment on UGA_Constructor_Firewall_C");
static_assert(sizeof(UGA_Constructor_Firewall_C) == 0x00075C, "Wrong size on UGA_Constructor_Firewall_C");
static_assert(offsetof(UGA_Constructor_Firewall_C, UberGraphFrame_GA_Constructor_Firewall_C) == 0x000740, "Member 'UGA_Constructor_Firewall_C::UberGraphFrame_GA_Constructor_Firewall_C' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_Firewall_C, EventActivation) == 0x000744, "Member 'UGA_Constructor_Firewall_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_Firewall_C, GE_FirewallDamage) == 0x00074C, "Member 'UGA_Constructor_Firewall_C::GE_FirewallDamage' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_Firewall_C, EventComplete) == 0x000750, "Member 'UGA_Constructor_Firewall_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_Constructor_Firewall_C, ReflectedDamage_) == 0x000758, "Member 'UGA_Constructor_Firewall_C::ReflectedDamage_' has a wrong offset!");

}

#pragma pack(pop)
