#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_ILoveToReload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_CommandoTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C
// 0x0018 (0x0758 - 0x0740)
class UGA_Commando_ILoveToReload_C final : public UGAT_CommandoTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Commando_ILoveToReload_C;        // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Event_Activation;                                  // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_LovetoReload;                                   // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Event_Complete;                                    // 0x0750(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Commando_ILoveToReload(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Commando_ILoveToReload_C">();
	}
	static class UGA_Commando_ILoveToReload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Commando_ILoveToReload_C>();
	}
};
static_assert(alignof(UGA_Commando_ILoveToReload_C) == 0x000004, "Wrong alignment on UGA_Commando_ILoveToReload_C");
static_assert(sizeof(UGA_Commando_ILoveToReload_C) == 0x000758, "Wrong size on UGA_Commando_ILoveToReload_C");
static_assert(offsetof(UGA_Commando_ILoveToReload_C, UberGraphFrame_GA_Commando_ILoveToReload_C) == 0x000740, "Member 'UGA_Commando_ILoveToReload_C::UberGraphFrame_GA_Commando_ILoveToReload_C' has a wrong offset!");
static_assert(offsetof(UGA_Commando_ILoveToReload_C, Event_Activation) == 0x000744, "Member 'UGA_Commando_ILoveToReload_C::Event_Activation' has a wrong offset!");
static_assert(offsetof(UGA_Commando_ILoveToReload_C, GE_LovetoReload) == 0x00074C, "Member 'UGA_Commando_ILoveToReload_C::GE_LovetoReload' has a wrong offset!");
static_assert(offsetof(UGA_Commando_ILoveToReload_C, Event_Complete) == 0x000750, "Member 'UGA_Commando_ILoveToReload_C::Event_Complete' has a wrong offset!");

}

#pragma pack(pop)
