#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_BullRush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.ExecuteUbergraph_GA_Constructor_BullRush
// 0x0310 (0x0310 - 0x0000)
struct GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData5;                    // 0x0004(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag5;                // 0x0018(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0020(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0034(0x0008)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x004C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0060(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0078(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x008C(0x0008)()
	TDelegate<void(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00A4(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x00AC(0x0014)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData6;                    // 0x00C0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag6;                // 0x00D4(0x0008)()
	TDelegate<void(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_OtherActor2;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp2;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_OtherBodyIndex2;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFromSweep2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult2;                   // 0x010C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x019C(0x0014)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable3;                             // 0x01B0(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01C4(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayTag                           Temp_struct_Variable4;                             // 0x01D0(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData4;                    // 0x01D8(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag4;                // 0x01EC(0x0008)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21B[0x1];                                      // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0278(0x0080)(ConstParm, ContainsInstancedReference)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush) == 0x000010, "Wrong alignment on GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush");
static_assert(sizeof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush) == 0x000310, "Wrong size on GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, EntryPoint) == 0x000000, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData5) == 0x000004, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData5' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag5) == 0x000018, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag5' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData3) == 0x000020, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag3) == 0x000034, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData2) == 0x00004C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag2) == 0x000060, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData) == 0x000078, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag) == 0x00008C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate3) == 0x000094, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, Temp_struct_Variable) == 0x0000A4, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, Temp_struct_Variable2) == 0x0000AC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData6) == 0x0000C0, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData6' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag6) == 0x0000D4, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag6' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate4) == 0x0000DC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate5) == 0x0000EC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherActor2) == 0x0000FC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherComp2) == 0x000100, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherBodyIndex2) == 0x000104, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_bFromSweep2) == 0x000108, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_bFromSweep2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_SweepResult2) == 0x00010C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_SweepResult2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_DynamicCast_AsFort_Pawn) == 0x00018C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000194, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000198, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x00019C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, Temp_struct_Variable3) == 0x0001B0, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001C4, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, Temp_struct_Variable4) == 0x0001D0, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_TargetData4) == 0x0001D8, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_TargetData4' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_ApplicationTag4) == 0x0001EC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_ApplicationTag4' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Array_AddUnique_ReturnValue) == 0x0001F4, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Array_Contains_ReturnValue) == 0x0001F8, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_WaitDelay_ReturnValue) == 0x0001FC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Not_PreBool_ReturnValue) == 0x000200, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_BooleanAND_ReturnValue) == 0x000201, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_IsValid_ReturnValue) == 0x000202, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CreateDelegate_OutputDelegate6) == 0x000204, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x000214, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_IsValid_ReturnValue2) == 0x000218, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000219, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00021A, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00021C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000230, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000260, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_FinishSpawningActor_ReturnValue) == 0x000264, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherActor) == 0x000268, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherComp) == 0x00026C, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_OtherBodyIndex) == 0x000270, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_bFromSweep) == 0x000274, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_CustomEvent_SweepResult) == 0x000278, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_DynamicCast_AsBuilding_Actor) == 0x0002F8, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, K2Node_DynamicCast_bSuccess2) == 0x0002FC, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Array_Length_ReturnValue) == 0x000300, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_Greater_IntInt_ReturnValue) == 0x000304, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_IsValid_ReturnValue3) == 0x000305, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush, CallFunc_BooleanAND_ReturnValue2) == 0x000306, "Member 'GA_Constructor_BullRush_C_ExecuteUbergraph_GA_Constructor_BullRush::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.OnBullRushStopCollisionOverlap
// 0x0090 (0x0090 - 0x0000)
struct GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap");
static_assert(sizeof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap) == 0x000090, "Wrong size on GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap, OtherActor) == 0x000000, "Member 'GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap, OtherComp) == 0x000004, "Member 'GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap, OtherBodyIndex) == 0x000008, "Member 'GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap, bFromSweep) == 0x00000C, "Member 'GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap, SweepResult) == 0x000010, "Member 'GA_Constructor_BullRush_C_OnBullRushStopCollisionOverlap::SweepResult' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.OnBullRushOverlap
// 0x0090 (0x0090 - 0x0000)
struct GA_Constructor_BullRush_C_OnBullRushOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Constructor_BullRush_C_OnBullRushOverlap) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_OnBullRushOverlap");
static_assert(sizeof(GA_Constructor_BullRush_C_OnBullRushOverlap) == 0x000090, "Wrong size on GA_Constructor_BullRush_C_OnBullRushOverlap");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushOverlap, OtherActor) == 0x000000, "Member 'GA_Constructor_BullRush_C_OnBullRushOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushOverlap, OtherComp) == 0x000004, "Member 'GA_Constructor_BullRush_C_OnBullRushOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushOverlap, OtherBodyIndex) == 0x000008, "Member 'GA_Constructor_BullRush_C_OnBullRushOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushOverlap, bFromSweep) == 0x00000C, "Member 'GA_Constructor_BullRush_C_OnBullRushOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_OnBullRushOverlap, SweepResult) == 0x000010, "Member 'GA_Constructor_BullRush_C_OnBullRushOverlap::SweepResult' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(sizeof(GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(offsetof(GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Triggered_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(sizeof(GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(offsetof(GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Cancelled_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(sizeof(GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1");
static_assert(offsetof(GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Completed_AEE84BDD4BB90ECDF1B6BF83B5EDC3C1::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Triggered_7F48364C4417ADD50A45C0B1A7272F05
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(sizeof(GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(offsetof(GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Triggered_7F48364C4417ADD50A45C0B1A7272F05::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Cancelled_7F48364C4417ADD50A45C0B1A7272F05
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(sizeof(GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(offsetof(GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Cancelled_7F48364C4417ADD50A45C0B1A7272F05::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.Completed_7F48364C4417ADD50A45C0B1A7272F05
// 0x001C (0x001C - 0x0000)
struct GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(sizeof(GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05) == 0x00001C, "Wrong size on GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05");
static_assert(offsetof(GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05, TargetData) == 0x000000, "Member 'GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05, ApplicationTag) == 0x000014, "Member 'GA_Constructor_BullRush_C_Completed_7F48364C4417ADD50A45C0B1A7272F05::ApplicationTag' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.InitBullRushVars
// 0x0020 (0x0020 - 0x0000)
struct GA_Constructor_BullRush_C_InitBullRushVars final
{
public:
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Constructor_BullRush_C_InitBullRushVars) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_InitBullRushVars");
static_assert(sizeof(GA_Constructor_BullRush_C_InitBullRushVars) == 0x000020, "Wrong size on GA_Constructor_BullRush_C_InitBullRushVars");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000000, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_GetFloatAttribute_ReturnValue) == 0x000004, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, Temp_bool_Variable) == 0x000009, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x00000C, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000014, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, K2Node_Select_Default) == 0x000018, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_InitBullRushVars, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'GA_Constructor_BullRush_C_InitBullRushVars::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.ApplyPushAside
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Constructor_BullRush_C_ApplyPushAside final
{
public:
	class AFortPawn*                              PawnToPush;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxElement_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Constructor_BullRush_C_ApplyPushAside) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_ApplyPushAside");
static_assert(sizeof(GA_Constructor_BullRush_C_ApplyPushAside) == 0x0000B8, "Wrong size on GA_Constructor_BullRush_C_ApplyPushAside");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, PawnToPush) == 0x000000, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::PawnToPush' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00002C, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_GetMaxElement_ReturnValue) == 0x000044, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_X) == 0x000048, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_Y) == 0x00004C, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_Z) == 0x000050, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_VSize_ReturnValue) == 0x000054, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000064, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Normal_ReturnValue) == 0x000068, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_GetRightVector_ReturnValue) == 0x000074, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Cross_VectorVector_ReturnValue) == 0x000080, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x00008C, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_X2) == 0x000098, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_Y2) == 0x00009C, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_BreakVector_Z2) == 0x0000A0, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A4, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_SelectVector_ReturnValue) == 0x0000A8, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyPushAside, CallFunc_Lerp_ReturnValue) == 0x0000B4, "Member 'GA_Constructor_BullRush_C_ApplyPushAside::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function GA_Constructor_BullRush.GA_Constructor_BullRush_C.ApplyEndingDamage
// 0x00CC (0x00CC - 0x0000)
struct GA_Constructor_BullRush_C_ApplyEndingDamage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0004(0x0058)()
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_Array_Get_Item;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00A8(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00BC(0x000C)(ZeroConstructor, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Constructor_BullRush_C_ApplyEndingDamage) == 0x000004, "Wrong alignment on GA_Constructor_BullRush_C_ApplyEndingDamage");
static_assert(sizeof(GA_Constructor_BullRush_C_ApplyEndingDamage) == 0x0000CC, "Wrong size on GA_Constructor_BullRush_C_ApplyEndingDamage");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyEndingDamage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_Constructor_BullRush_C_ApplyEndingDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Constructor_BullRush_C_ApplyEndingDamage, K2Node_MakeStruct_GameplayEventData) == 0x000004, "Member 'GA_Constructor_BullRush_C_ApplyEndingDamage::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
