#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_GoinCommando

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_CommandoActiveAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Commando_GoinCommando.GA_Commando_GoinCommando_C
// 0x0060 (0x07A0 - 0x0740)
class UGA_Commando_GoinCommando_C final : public UGAT_CommandoActiveAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Commando_GoinCommando_C;         // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           M_Activation;                                      // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Event_Complete;                                    // 0x0750(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AbilityDuration;                                   // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortWeaponItemDefinition*              WeaponDef;                                         // 0x075C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_AintDoneYet;                                    // 0x0760(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         UpgradeDuration;                                   // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_BoomStick;                                      // 0x077C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_GoinCommandoSnare;                              // 0x0794(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_GoinCommandoActive;                             // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_TempDealEnergyDamage;                           // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Commando_GoinCommando(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Commando_GoinCommando_C">();
	}
	static class UGA_Commando_GoinCommando_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Commando_GoinCommando_C>();
	}
};
static_assert(alignof(UGA_Commando_GoinCommando_C) == 0x000004, "Wrong alignment on UGA_Commando_GoinCommando_C");
static_assert(sizeof(UGA_Commando_GoinCommando_C) == 0x0007A0, "Wrong size on UGA_Commando_GoinCommando_C");
static_assert(offsetof(UGA_Commando_GoinCommando_C, UberGraphFrame_GA_Commando_GoinCommando_C) == 0x000740, "Member 'UGA_Commando_GoinCommando_C::UberGraphFrame_GA_Commando_GoinCommando_C' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, EventActivation) == 0x000744, "Member 'UGA_Commando_GoinCommando_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, M_Activation) == 0x00074C, "Member 'UGA_Commando_GoinCommando_C::M_Activation' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, Event_Complete) == 0x000750, "Member 'UGA_Commando_GoinCommando_C::Event_Complete' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, AbilityDuration) == 0x000758, "Member 'UGA_Commando_GoinCommando_C::AbilityDuration' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, WeaponDef) == 0x00075C, "Member 'UGA_Commando_GoinCommando_C::WeaponDef' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, TC_AintDoneYet) == 0x000760, "Member 'UGA_Commando_GoinCommando_C::TC_AintDoneYet' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, UpgradeDuration) == 0x000778, "Member 'UGA_Commando_GoinCommando_C::UpgradeDuration' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, TC_BoomStick) == 0x00077C, "Member 'UGA_Commando_GoinCommando_C::TC_BoomStick' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, GE_GoinCommandoSnare) == 0x000794, "Member 'UGA_Commando_GoinCommando_C::GE_GoinCommandoSnare' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, GE_GoinCommandoActive) == 0x000798, "Member 'UGA_Commando_GoinCommando_C::GE_GoinCommandoActive' has a wrong offset!");
static_assert(offsetof(UGA_Commando_GoinCommando_C, GE_TempDealEnergyDamage) == 0x00079C, "Member 'UGA_Commando_GoinCommando_C::GE_TempDealEnergyDamage' has a wrong offset!");

}

#pragma pack(pop)
