#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_MakeItRain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_CommandoTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Commando_MakeItRain.GA_Commando_MakeItRain_C
// 0x001C (0x075C - 0x0740)
class UGA_Commando_MakeItRain_C final : public UGAT_CommandoTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Commando_MakeItRain_C;           // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0744(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventComplete;                                     // 0x074C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_MakeItRain;                                     // 0x0754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_MakeItRainUpgraded;                             // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Commando_MakeItRain(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void SetupVariables();

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Commando_MakeItRain_C">();
	}
	static class UGA_Commando_MakeItRain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Commando_MakeItRain_C>();
	}
};
static_assert(alignof(UGA_Commando_MakeItRain_C) == 0x000004, "Wrong alignment on UGA_Commando_MakeItRain_C");
static_assert(sizeof(UGA_Commando_MakeItRain_C) == 0x00075C, "Wrong size on UGA_Commando_MakeItRain_C");
static_assert(offsetof(UGA_Commando_MakeItRain_C, UberGraphFrame_GA_Commando_MakeItRain_C) == 0x000740, "Member 'UGA_Commando_MakeItRain_C::UberGraphFrame_GA_Commando_MakeItRain_C' has a wrong offset!");
static_assert(offsetof(UGA_Commando_MakeItRain_C, EventActivation) == 0x000744, "Member 'UGA_Commando_MakeItRain_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Commando_MakeItRain_C, EventComplete) == 0x00074C, "Member 'UGA_Commando_MakeItRain_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_Commando_MakeItRain_C, GE_MakeItRain) == 0x000754, "Member 'UGA_Commando_MakeItRain_C::GE_MakeItRain' has a wrong offset!");
static_assert(offsetof(UGA_Commando_MakeItRain_C, GE_MakeItRainUpgraded) == 0x000758, "Member 'UGA_Commando_MakeItRain_C::GE_MakeItRainUpgraded' has a wrong offset!");

}

#pragma pack(pop)
