#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_IfItBleeds

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C.ExecuteUbergraph_GA_Commando_IfItBleeds
// 0x007C (0x007C - 0x0000)
struct GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x005C(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0070(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds) == 0x000004, "Wrong alignment on GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds");
static_assert(sizeof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds) == 0x00007C, "Wrong size on GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds");
static_assert(offsetof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds, EntryPoint) == 0x000000, "Member 'GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds, K2Node_Event_EventData) == 0x000004, "Member 'GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x00005C, "Member 'GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000070, "Member 'GA_Commando_IfItBleeds_C_ExecuteUbergraph_GA_Commando_IfItBleeds::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Commando_IfItBleeds_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C.K2_ShouldAbilityRespondToEvent
// 0x009C (0x009C - 0x0000)
struct GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0034(0x0058)(Parm)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent) == 0x000004, "Wrong alignment on GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent) == 0x00009C, "Wrong size on GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000034, "Member 'GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x00008C, "Member 'GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000090, "Member 'GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000098, "Member 'GA_Commando_IfItBleeds_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
