#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_ILoveToReload

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C.ExecuteUbergraph_GA_Commando_ILoveToReload
// 0x0060 (0x0060 - 0x0000)
struct GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x005C(0x0004)()
};
static_assert(alignof(GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload) == 0x000004, "Wrong alignment on GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload");
static_assert(sizeof(GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload) == 0x000060, "Wrong size on GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload");
static_assert(offsetof(GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload, EntryPoint) == 0x000000, "Member 'GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload, K2Node_Event_EventData) == 0x000004, "Member 'GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00005C, "Member 'GA_Commando_ILoveToReload_C_ExecuteUbergraph_GA_Commando_ILoveToReload::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Commando_ILoveToReload_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

#pragma pack(pop)
