#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Constructor_TriggeredFatigue

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C.ExecuteUbergraph_GA_Constructor_TriggeredFatigue
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0004(0x000C)()
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x0058)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0068(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0088(0x000C)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x0094(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue) == 0x000004, "Wrong alignment on GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue");
static_assert(sizeof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue) == 0x0000A0, "Wrong size on GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, EntryPoint) == 0x000000, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000004, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, K2Node_Event_EventData) == 0x000010, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000068, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x00007C, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000088, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x000094, "Member 'GA_Constructor_TriggeredFatigue_C_ExecuteUbergraph_GA_Constructor_TriggeredFatigue::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");

// Function GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Constructor_TriggeredFatigue_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C.K2_ShouldAbilityRespondToEvent
// 0x0090 (0x0090 - 0x0000)
struct GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0034(0x0058)(Parm)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent) == 0x000004, "Wrong alignment on GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent) == 0x000090, "Wrong size on GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000034, "Member 'GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x00008C, "Member 'GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent, CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue) == 0x00008D, "Member 'GA_Constructor_TriggeredFatigue_C_K2_ShouldAbilityRespondToEvent::CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
