#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_DebilitatingShots

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.ExecuteUbergraph_GA_Commando_DebilitatingShots
// 0x0138 (0x0138 - 0x0000)
struct GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0004(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupAppliedEffect_EffectspecHandleOut;   // 0x0010(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupFatigue_EffectspecOutInstant;        // 0x001C(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupFatigue_EffectspecOutDuration;       // 0x0028(0x000C)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0034(0x000C)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface4_CastInput; // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface5_CastInput; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3; // 0x0088(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0094(0x0058)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       CallFunc_SetupGameplayEffect_Target_Data;          // 0x00EC(0x0014)()
	class UClass*                                 CallFunc_SetupGameplayEffect_DebilitatingShots;    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SetupGameplayEffect_Effect_Level;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SetupGameplayEffect_Stack_Count;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0114(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupAppliedEffect_EffectspecHandleOut2;  // 0x0120(0x000C)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4; // 0x012C(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots) == 0x000138, "Wrong size on GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, EntryPoint) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000004, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupAppliedEffect_EffectspecHandleOut) == 0x000010, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupAppliedEffect_EffectspecHandleOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupFatigue_EffectspecOutInstant) == 0x00001C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupFatigue_EffectspecOutInstant' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupFatigue_EffectspecOutDuration) == 0x000028, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupFatigue_EffectspecOutDuration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000034, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000040, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000048, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x00004C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000054, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput) == 0x000058, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x000060, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface4_CastInput) == 0x000064, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface4_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue4) == 0x00006C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface5_CastInput) == 0x000070, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface5_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue5) == 0x000078, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_BooleanAND_ReturnValue) == 0x000079, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_BooleanAND_ReturnValue2) == 0x00007A, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x00007C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3) == 0x000088, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_Event_EventData) == 0x000094, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Target_Data) == 0x0000EC, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Target_Data' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_DebilitatingShots) == 0x000100, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_DebilitatingShots' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Effect_Level) == 0x000104, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Effect_Level' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Stack_Count) == 0x000108, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_DynamicCast_AsFort_Pawn) == 0x00010C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000114, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupAppliedEffect_EffectspecHandleOut2) == 0x000120, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupAppliedEffect_EffectspecHandleOut2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4) == 0x00012C, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupGameplayEffect
// 0x0048 (0x0048 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupGameplayEffect final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           EventTag;                                          // 0x0004(0x0008)(Parm)
	class UObject*                                OptionalObject;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Target_Data;                                       // 0x0010(0x0014)(Parm, OutParm)
	class UClass*                                 DebilitatingShots;                                 // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Effect_Level;                                      // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Stack_Count;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0030(0x0014)()
	bool                                          CallFunc_DoGameplayTagsMatch_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupGameplayEffect");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect) == 0x000048, "Wrong size on GA_Commando_DebilitatingShots_C_SetupGameplayEffect");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, HitActor) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::HitActor' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, EventTag) == 0x000004, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, OptionalObject) == 0x00000C, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::OptionalObject' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Target_Data) == 0x000010, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Target_Data' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, DebilitatingShots) == 0x000024, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::DebilitatingShots' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Effect_Level) == 0x000028, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Effect_Level' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Stack_Count) == 0x00002C, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000030, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, CallFunc_DoGameplayTagsMatch_ReturnValue) == 0x000044, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::CallFunc_DoGameplayTagsMatch_ReturnValue' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupAppliedEffect
// 0x0048 (0x0048 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupAppliedEffect final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Magnitude;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Stack_Count;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              EffectSpecHandle;                                  // 0x000C(0x000C)(Parm)
	struct FGameplayEffectSpecHandle              EffectspecHandleOut;                               // 0x0018(0x000C)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0024(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue2;  // 0x0030(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_SetStackCount_ReturnValue;                // 0x003C(0x000C)()
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupAppliedEffect");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect) == 0x000048, "Wrong size on GA_Commando_DebilitatingShots_C_SetupAppliedEffect");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Duration) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Duration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Magnitude) == 0x000004, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Magnitude' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Stack_Count) == 0x000008, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, EffectSpecHandle) == 0x00000C, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::EffectSpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, EffectspecHandleOut) == 0x000018, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::EffectspecHandleOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000024, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_AssignSetByCallerMagnitude_ReturnValue2) == 0x000030, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_AssignSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_SetStackCount_ReturnValue) == 0x00003C, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_SetStackCount_ReturnValue' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupFatigue
// 0x0030 (0x0030 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupFatigue final
{
public:
	struct FGameplayEffectSpecHandle              EffectspecOutInstant;                              // 0x0000(0x000C)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              EffectspecOutDuration;                             // 0x000C(0x000C)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0018(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0024(0x000C)()
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupFatigue) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupFatigue");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupFatigue) == 0x000030, "Wrong size on GA_Commando_DebilitatingShots_C_SetupFatigue");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupFatigue, EffectspecOutInstant) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupFatigue::EffectspecOutInstant' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupFatigue, EffectspecOutDuration) == 0x00000C, "Member 'GA_Commando_DebilitatingShots_C_SetupFatigue::EffectspecOutDuration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupFatigue, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000018, "Member 'GA_Commando_DebilitatingShots_C_SetupFatigue::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupFatigue, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000024, "Member 'GA_Commando_DebilitatingShots_C_SetupFatigue::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.K2_ShouldAbilityRespondToEvent
// 0x009C (0x009C - 0x0000)
struct GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0034(0x0058)(Parm)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoGameplayTagsMatch_ReturnValue;          // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerHaveTag_ReturnValue;         // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanExecute;                                        // 0x0097(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPawn;                                            // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent) == 0x000004, "Wrong alignment on GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent) == 0x00009C, "Wrong size on GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000034, "Member 'GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
