#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Explorer_Fragment

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_ExplorerClassList_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "E_ExplorerFragmentTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.ExecuteUbergraph_GA_Explorer_Fragment
// 0x04A0 (0x04A0 - 0x0000)
struct GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData3;                // 0x0004(0x001C)(ConstParm, ContainsInstancedReference)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData2;                // 0x0020(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData;                 // 0x004C(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   Temp_struct_Variable;                              // 0x0078(0x001C)(ContainsInstancedReference)
	struct FAbilityToolSpawnParameters            CallFunc_GetSpawnParameters_OutSpawnParamters;     // 0x0094(0x0020)()
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0124(0x0034)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0158(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x016C(0x0008)()
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x017C(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01D4(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01E8(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate4;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x020C(0x0014)()
	struct FGameplayTag                           Temp_struct_Variable3;                             // 0x0220(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0228(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x023C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData4;                    // 0x0254(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag4;                // 0x0268(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData4;                // 0x0280(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate7;             // 0x029C(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData5;                // 0x02AC(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate8;             // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData6;                // 0x02D8(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate9;             // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable4;                             // 0x0304(0x0014)()
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable5;                             // 0x0348(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable6;                             // 0x0350(0x0014)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData5;                    // 0x0374(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag5;                // 0x0388(0x0008)()
	struct FGameplayTag                           Temp_struct_Variable7;                             // 0x0390(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate14;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor)
	E_ExplorerFragmentTypes                       CallFunc_ActivateFragment_FragmentType;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ExplorerClassList                           CallFunc_ActivateFragment_ClassType;               // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_ActivateFragment_ActivateEvent;           // 0x03AC(0x0008)()
	bool                                          CallFunc_ActivateFragment_EndAbility;              // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData6;                    // 0x03B8(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag6;                // 0x03CC(0x0008)()
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue2;         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue3;         // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate15;            // 0x03E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0400(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0414(0x0008)()
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAbilityDecoTool*                   K2Node_DynamicCast_AsFort_Ability_Deco_Tool;       // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_SpawnProjectileAndWait* CallFunc_SpawnProjectileAndWait_ReturnValue;       // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_455[0xB];                                      // 0x0455(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0460(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment) == 0x000010, "Wrong alignment on GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment");
static_assert(sizeof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment) == 0x0004A0, "Wrong size on GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, EntryPoint) == 0x000000, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData3) == 0x000004, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData2) == 0x000020, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData) == 0x00004C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable) == 0x000078, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_GetSpawnParameters_OutSpawnParamters) == 0x000094, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_GetSpawnParameters_OutSpawnParamters' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BreakTransform_Location) == 0x0000B4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BreakTransform_Rotation) == 0x0000C0, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BreakTransform_Scale) == 0x0000CC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_K2_CommitAbility_ReturnValue) == 0x000110, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate3) == 0x000114, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_GetActorInfo_ReturnValue) == 0x000124, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData2) == 0x000158, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag2) == 0x00016C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000174, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_MakeStruct_GameplayEventData) == 0x00017C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001D4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001E8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_bool_A_Execution_Happened_Variable) == 0x0001F4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate4) == 0x0001F8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_bool_B_Execution_Happened_Variable) == 0x000208, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BooleanAND_ReturnValue) == 0x000209, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable2) == 0x00020C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable3) == 0x000220, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData3) == 0x000228, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag3) == 0x00023C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate5) == 0x000244, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData4) == 0x000254, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag4) == 0x000268, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate6) == 0x000270, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData4) == 0x000280, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate7) == 0x00029C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData5) == 0x0002AC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData5' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate8) == 0x0002C8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ProjectileData6) == 0x0002D8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ProjectileData6' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate9) == 0x0002F4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable4) == 0x000304, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate10) == 0x000318, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate11) == 0x000328, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate12) == 0x000338, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable5) == 0x000348, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable6) == 0x000350, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate13) == 0x000364, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData5) == 0x000374, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData5' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag5) == 0x000388, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag5' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, Temp_struct_Variable7) == 0x000390, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate14) == 0x000398, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_ActivateFragment_FragmentType) == 0x0003A8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_ActivateFragment_FragmentType' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_ActivateFragment_ClassType) == 0x0003A9, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_ActivateFragment_ClassType' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_ActivateFragment_ActivateEvent) == 0x0003AC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_ActivateFragment_ActivateEvent' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_ActivateFragment_EndAbility) == 0x0003B4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_ActivateFragment_EndAbility' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_SwitchEnum_CmpSuccess) == 0x0003B5, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData6) == 0x0003B8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData6' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag6) == 0x0003CC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag6' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_WaitTargetSelection_ReturnValue) == 0x0003D4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_IsValid_ReturnValue) == 0x0003D8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_WaitTargetSelection_ReturnValue2) == 0x0003DC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_WaitTargetSelection_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_IsValid_ReturnValue2) == 0x0003E0, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_WaitTargetSelection_ReturnValue3) == 0x0003E4, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_WaitTargetSelection_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CreateDelegate_OutputDelegate15) == 0x0003E8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_IsValid_ReturnValue3) == 0x0003F8, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0003FC, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_TargetData) == 0x000400, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_CustomEvent_ApplicationTag) == 0x000414, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_IsValid_ReturnValue4) == 0x00041C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000420, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_AsFort_Pawn) == 0x000424, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_bSuccess2) == 0x000428, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_AsFort_Ability_Deco_Tool) == 0x00042C, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_AsFort_Ability_Deco_Tool' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, K2Node_DynamicCast_bSuccess3) == 0x000430, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000434, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_SpawnProjectileAndWait_ReturnValue) == 0x000440, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_SpawnProjectileAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000444, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000450, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_BeginSpawningActor_ReturnValue) == 0x000454, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_MakeTransform_ReturnValue2) == 0x000460, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment, CallFunc_IsValid_ReturnValue5) == 0x000490, "Member 'GA_Explorer_Fragment_C_ExecuteUbergraph_GA_Explorer_Fragment::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Created_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Created_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Touched_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Touched_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Bounced_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Bounced_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Stopped_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Stopped_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Exploded_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Exploded_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(sizeof(GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928");
static_assert(offsetof(GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928, ProjectileData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Destroyed_56D0E8B74E6D3560ABB4BF82A5A31928::ProjectileData' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Targeted_D9A99A8E430AA4101B325597D2C21C37
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37");
static_assert(sizeof(GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Targeted_D9A99A8E430AA4101B325597D2C21C37::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Cancelled_D9A99A8E430AA4101B325597D2C21C37
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37");
static_assert(sizeof(GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Cancelled_D9A99A8E430AA4101B325597D2C21C37::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB");
static_assert(sizeof(GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Targeted_0DCC89D649F1683B5F78AC9AEEA4CBBB::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB");
static_assert(sizeof(GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Cancelled_0DCC89D649F1683B5F78AC9AEEA4CBBB::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Targeted_AB9C57344D21682887FAA6B895FA1C6D
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D");
static_assert(sizeof(GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Targeted_AB9C57344D21682887FAA6B895FA1C6D::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.Cancelled_AB9C57344D21682887FAA6B895FA1C6D
// 0x001C (0x001C - 0x0000)
struct GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D");
static_assert(sizeof(GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D) == 0x00001C, "Wrong size on GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D, TargetData) == 0x000000, "Member 'GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D, ApplicationTag) == 0x000014, "Member 'GA_Explorer_Fragment_C_Cancelled_AB9C57344D21682887FAA6B895FA1C6D::ApplicationTag' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.OffensiveFragment
// 0x00CC (0x00CC - 0x0000)
struct GA_Explorer_Fragment_C_OffensiveFragment final
{
public:
	E_ExplorerClassList                           ClassType_0;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0004(0x0014)(Parm)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_BGA_Explorer_OutlanderFragmentBear_C* K2Node_DynamicCast_AsB_BGA_Explorer_Outlander_Fragment_Bear; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x003C(0x0064)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00A0(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00B4(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortAreaOfEffectCloud*                 CallFunc_SpawnAreaOfEffectCloud_ReturnValue;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AAOE_Explorer_OffensiveFragment_C*      K2Node_DynamicCast_AsAOE_Explorer_Offensive_Fragment; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Explorer_Fragment_C_OffensiveFragment) == 0x000004, "Wrong alignment on GA_Explorer_Fragment_C_OffensiveFragment");
static_assert(sizeof(GA_Explorer_Fragment_C_OffensiveFragment) == 0x0000CC, "Wrong size on GA_Explorer_Fragment_C_OffensiveFragment");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, ClassType_0) == 0x000000, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::ClassType_0' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, TargetData) == 0x000004, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000018, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000020, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x000024, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x00002C, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_HasAuthority_ReturnValue) == 0x00002D, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000030, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, K2Node_DynamicCast_AsB_BGA_Explorer_Outlander_Fragment_Bear) == 0x000034, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::K2Node_DynamicCast_AsB_BGA_Explorer_Outlander_Fragment_Bear' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x00003C, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000A0, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000B4, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, CallFunc_SpawnAreaOfEffectCloud_ReturnValue) == 0x0000C0, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::CallFunc_SpawnAreaOfEffectCloud_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, K2Node_DynamicCast_AsAOE_Explorer_Offensive_Fragment) == 0x0000C4, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::K2Node_DynamicCast_AsAOE_Explorer_Offensive_Fragment' has a wrong offset!");
static_assert(offsetof(GA_Explorer_Fragment_C_OffensiveFragment, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'GA_Explorer_Fragment_C_OffensiveFragment::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function GA_Explorer_Fragment.GA_Explorer_Fragment_C.ActivateFragment
// 0x0084 (0x0084 - 0x0000)
struct GA_Explorer_Fragment_C_ActivateFragment final
{
public:
	E_ExplorerFragmentTypes                       FragmentType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ExplorerClassList                           ClassType_0;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ActivateEvent;                                     // 0x0004(0x0008)(Parm, OutParm)
	bool                                          EndAbility;                                        // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
