#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Floor_Health

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Floor_Health.GA_Floor_Health_C.ExecuteUbergraph_GA_Floor_Health
// 0x005C (0x005C - 0x0000)
struct GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
};
static_assert(alignof(GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health) == 0x000004, "Wrong alignment on GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health");
static_assert(sizeof(GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health) == 0x00005C, "Wrong size on GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health");
static_assert(offsetof(GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health, EntryPoint) == 0x000000, "Member 'GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health, K2Node_Event_EventData) == 0x000004, "Member 'GA_Floor_Health_C_ExecuteUbergraph_GA_Floor_Health::K2Node_Event_EventData' has a wrong offset!");

// Function GA_Floor_Health.GA_Floor_Health_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Floor_Health_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Floor_Health_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Floor_Health_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Floor_Health_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Floor_Health_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Floor_Health_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Floor_Health_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

#pragma pack(pop)
