#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Generic_ProximityMines

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Generic_ProximityMines.GA_Generic_ProximityMines_C.ExecuteUbergraph_GA_Generic_ProximityMines
// 0x0260 (0x0260 - 0x0000)
struct GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetAimLocationNearestPawn_ReturnValue;    // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0048(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0054(0x000C)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0060(0x0034)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x009C(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00F4(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0108(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0128(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue2;  // 0x0134(0x000C)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue2;  // 0x0140(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0154(0x000C)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue3;  // 0x0170(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x0184(0x000C)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D4[0xC];                                      // 0x01D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_BGA_ProximityMine_C*                 K2Node_DynamicCast_AsB_BGA_Proximity_Mine;         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines) == 0x000010, "Wrong alignment on GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines");
static_assert(sizeof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines) == 0x000260, "Wrong size on GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, EntryPoint) == 0x000000, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000004, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetAimLocationNearestPawn_ReturnValue) == 0x000010, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetAimLocationNearestPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor) == 0x000038, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_ClassDynamicCast_bSuccess) == 0x00003C, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_HasAuthority_ReturnValue) == 0x00003D, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000040, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000048, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000054, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetActorInfo_ReturnValue) == 0x000060, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000094, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_MakeStruct_GameplayEventData) == 0x00009C, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000F4, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000108, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_IsValid_ReturnValue2) == 0x000114, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000118, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x00011C, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000120, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_K2_CommitAbility_ReturnValue) == 0x000124, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000128, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_AssignSetByCallerMagnitude_ReturnValue2) == 0x000134, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_AssignSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_AbilityTargetDataFromActor_ReturnValue2) == 0x000140, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_AbilityTargetDataFromActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000154, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_CreateDelegate_OutputDelegate2) == 0x000160, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_AbilityTargetDataFromActor_ReturnValue3) == 0x000170, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_AbilityTargetDataFromActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x000184, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_Add_FloatFloat_ReturnValue) == 0x000190, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_MakeRotator_ReturnValue) == 0x000194, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0001A0, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_CreateDelegate_OutputDelegate3) == 0x0001AC, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_Normal_ReturnValue) == 0x0001BC, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C8, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_TransformLocation_ReturnValue) == 0x000210, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_MakeTransform_ReturnValue2) == 0x000220, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000250, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_DynamicCast_AsB_BGA_Proximity_Mine) == 0x000254, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_DynamicCast_AsB_BGA_Proximity_Mine' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines, K2Node_DynamicCast_bSuccess2) == 0x000258, "Member 'GA_Generic_ProximityMines_C_ExecuteUbergraph_GA_Generic_ProximityMines::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function GA_Generic_ProximityMines.GA_Generic_ProximityMines_C.Set_Level_Upgrades
// 0x0014 (0x0014 - 0x0000)
struct GA_Generic_ProximityMines_C_Set_Level_Upgrades final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Generic_ProximityMines_C_Set_Level_Upgrades) == 0x000004, "Wrong alignment on GA_Generic_ProximityMines_C_Set_Level_Upgrades");
static_assert(sizeof(GA_Generic_ProximityMines_C_Set_Level_Upgrades) == 0x000014, "Wrong size on GA_Generic_ProximityMines_C_Set_Level_Upgrades");
static_assert(offsetof(GA_Generic_ProximityMines_C_Set_Level_Upgrades, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'GA_Generic_ProximityMines_C_Set_Level_Upgrades::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_Set_Level_Upgrades, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000004, "Member 'GA_Generic_ProximityMines_C_Set_Level_Upgrades::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_Set_Level_Upgrades, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Generic_ProximityMines_C_Set_Level_Upgrades::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_Set_Level_Upgrades, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'GA_Generic_ProximityMines_C_Set_Level_Upgrades::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_ProximityMines_C_Set_Level_Upgrades, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'GA_Generic_ProximityMines_C_Set_Level_Upgrades::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

#pragma pack(pop)
