#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ninja_Assassination

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Ninja_Assassination.GA_Ninja_Assassination_C.ExecuteUbergraph_GA_Ninja_Assassination
// 0x00BC (0x00BC - 0x0000)
struct GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0004(0x0034)(ContainsInstancedReference)
	class APlayerPawn_Ninja_C*                    K2Node_DynamicCast_AsPlayer_Pawn_Ninja;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0040(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0098(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00AC(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination) == 0x000004, "Wrong alignment on GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination");
static_assert(sizeof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination) == 0x0000BC, "Wrong size on GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, EntryPoint) == 0x000000, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, CallFunc_GetActorInfo_ReturnValue) == 0x000004, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, K2Node_DynamicCast_AsPlayer_Pawn_Ninja) == 0x000038, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::K2Node_DynamicCast_AsPlayer_Pawn_Ninja' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, K2Node_DynamicCast_bSuccess) == 0x00003C, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, K2Node_MakeStruct_GameplayEventData) == 0x000040, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000AC, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_Ninja_Assassination_C_ExecuteUbergraph_GA_Ninja_Assassination::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Ninja_Assassination.GA_Ninja_Assassination_C.K2_ShouldAbilityRespondToEvent
// 0x009C (0x009C - 0x0000)
struct GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0034(0x0058)(Parm)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue2; // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFortPawn;                                        // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent) == 0x000004, "Wrong alignment on GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent) == 0x00009C, "Wrong size on GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000034, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x00008C, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue) == 0x00008D, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_AsFort_Pawn) == 0x000090, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_bSuccess) == 0x000094, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000095, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue2) == 0x000096, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::CallFunc_DoesContainerMatchAllTagsInContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue) == 0x000097, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue2) == 0x000098, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent, IsFortPawn) == 0x000099, "Member 'GA_Ninja_Assassination_C_K2_ShouldAbilityRespondToEvent::IsFortPawn' has a wrong offset!");

// Function GA_Ninja_Assassination.GA_Ninja_Assassination_C.ApplyStack
// 0x002C (0x002C - 0x0000)
struct GA_Ninja_Assassination_C_ApplyStack final
{
public:
	class APlayerPawn_Ninja_C*                    NinjaPawn_0;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0004)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0024(0x0004)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3; // 0x0028(0x0004)()
};
static_assert(alignof(GA_Ninja_Assassination_C_ApplyStack) == 0x000004, "Wrong alignment on GA_Ninja_Assassination_C_ApplyStack");
static_assert(sizeof(GA_Ninja_Assassination_C_ApplyStack) == 0x00002C, "Wrong size on GA_Ninja_Assassination_C_ApplyStack");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, NinjaPawn_0) == 0x000000, "Member 'GA_Ninja_Assassination_C_ApplyStack::NinjaPawn_0' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x00000C, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000014, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x000018, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000020, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000024, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_Assassination_C_ApplyStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3) == 0x000028, "Member 'GA_Ninja_Assassination_C_ApplyStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3' has a wrong offset!");

}

#pragma pack(pop)
