#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ninja_ShadowStance

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Ninja_ShadowStance.GA_Ninja_ShadowStance_C
// 0x00A4 (0x0780 - 0x06DC)
class UGA_Ninja_ShadowStance_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     EventPayload;                                      // 0x06E0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventActivation;                                   // 0x0738(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventComplete;                                     // 0x0740(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerPawn_Ninja_C*                    NinjaPawn;                                         // 0x0748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_ShadowStance;                                   // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_ShadowStanceActivate;                           // 0x0750(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_EdgedWeapons;                                   // 0x0768(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Ninja_ShadowStance(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ninja_ShadowStance_C">();
	}
	static class UGA_Ninja_ShadowStance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ninja_ShadowStance_C>();
	}
};
static_assert(alignof(UGA_Ninja_ShadowStance_C) == 0x000004, "Wrong alignment on UGA_Ninja_ShadowStance_C");
static_assert(sizeof(UGA_Ninja_ShadowStance_C) == 0x000780, "Wrong size on UGA_Ninja_ShadowStance_C");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_Ninja_ShadowStance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, EventPayload) == 0x0006E0, "Member 'UGA_Ninja_ShadowStance_C::EventPayload' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, EventActivation) == 0x000738, "Member 'UGA_Ninja_ShadowStance_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, EventComplete) == 0x000740, "Member 'UGA_Ninja_ShadowStance_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, NinjaPawn) == 0x000748, "Member 'UGA_Ninja_ShadowStance_C::NinjaPawn' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, GE_ShadowStance) == 0x00074C, "Member 'UGA_Ninja_ShadowStance_C::GE_ShadowStance' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, TC_ShadowStanceActivate) == 0x000750, "Member 'UGA_Ninja_ShadowStance_C::TC_ShadowStanceActivate' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_ShadowStance_C, TC_EdgedWeapons) == 0x000768, "Member 'UGA_Ninja_ShadowStance_C::TC_EdgedWeapons' has a wrong offset!");

}

#pragma pack(pop)
