#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_AntiMaterialCharge

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C.ExecuteUbergraph_GA_Outlander_AntiMaterialCharge
// 0x0410 (0x0410 - 0x0000)
struct GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData8;                    // 0x0004(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag8;                // 0x0018(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData7;                    // 0x0030(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag7;                // 0x0044(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x005C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0064(0x0014)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData6;                    // 0x0078(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag6;                // 0x008C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData5;                    // 0x00A4(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag5;                // 0x00B8(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData4;                    // 0x00D0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag4;                // 0x00E4(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable3;                             // 0x00FC(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable4;                             // 0x0104(0x0014)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0118(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x012C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0144(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0158(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0170(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0184(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate8;             // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable5;                             // 0x019C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable6;                             // 0x01A4(0x0014)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData9;                    // 0x01B8(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag9;                // 0x01CC(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate9;             // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate10;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable7;                             // 0x0208(0x0014)()
	struct FGameplayTag                           Temp_struct_Variable8;                             // 0x021C(0x0008)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable2;          // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable2;          // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData12;                   // 0x022C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag12;               // 0x0240(0x0008)()
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate11;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue2;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0278(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_CheckOverlappingActors_ShouldContinue;    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x02FC(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0308(0x000C)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckOverlappingActors_ShouldContinue2;   // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E[0x2];                                      // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate12;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData13;                   // 0x0350(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag13;               // 0x0364(0x0008)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable9;                             // 0x0370(0x0014)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue2;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0386(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_387[0x1];                                      // 0x0387(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue2; // 0x0388(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTag                           Temp_struct_Variable10;                            // 0x0394(0x0008)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue3;           // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData10;                   // 0x03A0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag10;               // 0x03B4(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate13;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate14;            // 0x03CC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData11;                   // 0x03DC(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag11;               // 0x03F0(0x0008)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWithCharPartsWait_ReturnValue; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWithCharPartsWait_ReturnValue2; // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWithCharPartsWait_ReturnValue3; // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCooldownTimeRemaining_ReturnValue;     // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x040D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x040E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge) == 0x000004, "Wrong alignment on GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge");
static_assert(sizeof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge) == 0x000410, "Wrong size on GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, EntryPoint) == 0x000000, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData8) == 0x000004, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData8' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag8) == 0x000018, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag8' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData7) == 0x000030, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData7' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag7) == 0x000044, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag7' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable) == 0x00005C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable2) == 0x000064, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData6) == 0x000078, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag6) == 0x00008C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate3) == 0x000094, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData5) == 0x0000A4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag5) == 0x0000B8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C0, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData4) == 0x0000D0, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag4) == 0x0000E4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate5) == 0x0000EC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable3) == 0x0000FC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable4) == 0x000104, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData3) == 0x000118, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag3) == 0x00012C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate6) == 0x000134, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData2) == 0x000144, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag2) == 0x000158, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate7) == 0x000160, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData) == 0x000170, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag) == 0x000184, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate8) == 0x00018C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable5) == 0x00019C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable6) == 0x0001A4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData9) == 0x0001B8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData9' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag9) == 0x0001CC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag9' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate9) == 0x0001D4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_int_Loop_Counter_Variable) == 0x0001E4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate10) == 0x0001E8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Add_IntInt_ReturnValue) == 0x0001F8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_int_Array_Index_Variable) == 0x0001FC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_IsClosed_Variable) == 0x000200, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_Has_Been_Initd_Variable) == 0x000201, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_A_Execution_Happened_Variable) == 0x000202, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_B_Execution_Happened_Variable) == 0x000203, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_BooleanAND_ReturnValue) == 0x000204, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable7) == 0x000208, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable8) == 0x00021C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_TargetDataHasActor_ReturnValue) == 0x000224, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_A_Execution_Happened_Variable2) == 0x000225, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_A_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_B_Execution_Happened_Variable2) == 0x000226, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_B_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_BooleanAND_ReturnValue2) == 0x000227, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_IsClosed_Variable2) == 0x000228, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_Has_Been_Initd_Variable2) == 0x000229, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData12) == 0x00022C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData12' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag12) == 0x000240, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag12' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_IsClosed_Variable3) == 0x000248, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_bool_Has_Been_Initd_Variable3) == 0x000249, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate11) == 0x00024C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_WaitTargetSelection_ReturnValue) == 0x00025C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_WaitTargetSelection_ReturnValue2) == 0x000260, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_WaitTargetSelection_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_IsValid_ReturnValue) == 0x000264, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_IsValid_ReturnValue2) == 0x000265, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_OtherActor) == 0x000268, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_OtherComp) == 0x00026C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_OtherBodyIndex) == 0x000270, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_bFromSweep) == 0x000274, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_SweepResult) == 0x000278, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_CheckOverlappingActors_ShouldContinue) == 0x0002F8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_CheckOverlappingActors_ShouldContinue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0002FC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000308, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Array_Get_Item) == 0x000314, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Array_Length_ReturnValue) == 0x000318, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_CheckOverlappingActors_ShouldContinue2) == 0x00031C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_CheckOverlappingActors_ShouldContinue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Less_IntInt_ReturnValue) == 0x00031D, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate12) == 0x000320, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000330, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000334, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Less_FloatFloat_ReturnValue) == 0x000338, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00033C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_FClamp_ReturnValue) == 0x000340, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000344, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Lerp_ReturnValue) == 0x000348, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x00034C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData13) == 0x000350, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData13' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag13) == 0x000364, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag13' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00036C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00036D, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable9) == 0x000370, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_TargetDataHasActor_ReturnValue2) == 0x000384, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_TargetDataHasActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000385, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_BooleanAND_ReturnValue3) == 0x000386, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_ApplyGameplayEffectContainer_ReturnValue2) == 0x000388, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_ApplyGameplayEffectContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, Temp_struct_Variable10) == 0x000394, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x00039C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_NotEqual_ByteByte_ReturnValue3) == 0x00039D, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_NotEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData10) == 0x0003A0, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData10' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag10) == 0x0003B4, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag10' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate13) == 0x0003BC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CreateDelegate_OutputDelegate14) == 0x0003CC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_TargetData11) == 0x0003DC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_TargetData11' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, K2Node_CustomEvent_ApplicationTag11) == 0x0003F0, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::K2Node_CustomEvent_ApplicationTag11' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_PlayMontageWithCharPartsWait_ReturnValue) == 0x0003F8, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_PlayMontageWithCharPartsWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_PlayMontageWithCharPartsWait_ReturnValue2) == 0x0003FC, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_PlayMontageWithCharPartsWait_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_IsValid_ReturnValue3) == 0x000400, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_IsValid_ReturnValue4) == 0x000401, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_PlayMontageWithCharPartsWait_ReturnValue3) == 0x000404, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_PlayMontageWithCharPartsWait_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_GetCooldownTimeRemaining_ReturnValue) == 0x000408, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_GetCooldownTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00040C, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_BooleanOR_ReturnValue) == 0x00040D, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge, CallFunc_IsValid_ReturnValue5) == 0x00040E, "Member 'GA_Outlander_AntiMaterialCharge_C_ExecuteUbergraph_GA_Outlander_AntiMaterialCharge::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C.OverlapEvent
// 0x0090 (0x0090 - 0x0000)
struct GA_Outlander_AntiMaterialCharge_C_OverlapEvent final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent) == 0x000004, "Wrong alignment on GA_Outlander_AntiMaterialCharge_C_OverlapEvent");
static_assert(sizeof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent) == 0x000090, "Wrong size on GA_Outlander_AntiMaterialCharge_C_OverlapEvent");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent, OtherActor) == 0x000000, "Member 'GA_Outlander_AntiMaterialCharge_C_OverlapEvent::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent, OtherComp) == 0x000004, "Member 'GA_Outlander_AntiMaterialCharge_C_OverlapEvent::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent, OtherBodyIndex) == 0x000008, "Member 'GA_Outlander_AntiMaterialCharge_C_OverlapEvent::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent, bFromSweep) == 0x00000C, "Member 'GA_Outlander_AntiMaterialCharge_C_OverlapEvent::bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_OverlapEvent, SweepResult) == 0x000010, "Member 'GA_Outlander_AntiMaterialCharge_C_OverlapEvent::SweepResult' has a wrong offset!");

// Function GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C.Triggered_BC1210B54390EF35DEFD88AE8F47FDE8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x000004, "Wrong alignment on GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(sizeof(GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x00001C, "Wrong size on GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8, TargetData) == 0x000000, "Member 'GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8, ApplicationTag) == 0x000014, "Member 'GA_Outlander_AntiMaterialCharge_C_Triggered_BC1210B54390EF35DEFD88AE8F47FDE8::ApplicationTag' has a wrong offset!");

// Function GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C.Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x000004, "Wrong alignment on GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(sizeof(GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x00001C, "Wrong size on GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8, TargetData) == 0x000000, "Member 'GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8, ApplicationTag) == 0x000014, "Member 'GA_Outlander_AntiMaterialCharge_C_Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8::ApplicationTag' has a wrong offset!");

// Function GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C.Completed_BC1210B54390EF35DEFD88AE8F47FDE8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x000004, "Wrong alignment on GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(sizeof(GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8) == 0x00001C, "Wrong size on GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8, TargetData) == 0x000000, "Member 'GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8, ApplicationTag) == 0x000014, "Member 'GA_Outlander_AntiMaterialCharge_C_Completed_BC1210B54390EF35DEFD88AE8F47FDE8::ApplicationTag' has a wrong offset!");

