#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_InTheZone

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_InTheZone.GA_Outlander_InTheZone_C.ExecuteUbergraph_GA_Outlander_InTheZone
// 0x0118 (0x0118 - 0x0000)
struct GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0060(0x0004)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0064(0x0034)(ContainsInstancedReference)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0098(0x0058)()
	class APlayerPawn_Outlander_C*                K2Node_DynamicCast_AsPlayer_Pawn_Outlander;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00F8(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x010C(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone) == 0x000004, "Wrong alignment on GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone");
static_assert(sizeof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone) == 0x000118, "Wrong size on GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, EntryPoint) == 0x000000, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, K2Node_Event_EventData) == 0x000004, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, CallFunc_K2_CommitAbility_ReturnValue) == 0x00005C, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000060, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, CallFunc_GetActorInfo_ReturnValue) == 0x000064, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, K2Node_MakeStruct_GameplayEventData) == 0x000098, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, K2Node_DynamicCast_AsPlayer_Pawn_Outlander) == 0x0000F0, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::K2Node_DynamicCast_AsPlayer_Pawn_Outlander' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, K2Node_DynamicCast_bSuccess) == 0x0000F4, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000F8, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00010C, "Member 'GA_Outlander_InTheZone_C_ExecuteUbergraph_GA_Outlander_InTheZone::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Outlander_InTheZone.GA_Outlander_InTheZone_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_Outlander_InTheZone_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

}

#pragma pack(pop)
