#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_WhereWereGoingWeNeedRoadsApply

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_WhereWereGoingWeNeedRoadsApply.GA_Outlander_WhereWereGoingWeNeedRoadsApply_C.ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply
// 0x006C (0x006C - 0x0000)
struct GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_SetVariables_GameplaySpec;                // 0x0004(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0010(0x0004)()
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0014(0x0058)(ConstParm)
};
static_assert(alignof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply) == 0x000004, "Wrong alignment on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply");
static_assert(sizeof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply) == 0x00006C, "Wrong size on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply, EntryPoint) == 0x000000, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply, CallFunc_SetVariables_GameplaySpec) == 0x000004, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply::CallFunc_SetVariables_GameplaySpec' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000010, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply, K2Node_Event_EventData) == 0x000014, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_ExecuteUbergraph_GA_Outlander_WhereWereGoingWeNeedRoadsApply::K2Node_Event_EventData' has a wrong offset!");

// Function GA_Outlander_WhereWereGoingWeNeedRoadsApply.GA_Outlander_WhereWereGoingWeNeedRoadsApply_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

// Function GA_Outlander_WhereWereGoingWeNeedRoadsApply.GA_Outlander_WhereWereGoingWeNeedRoadsApply_C.SetVariables
// 0x0048 (0x0048 - 0x0000)
struct GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables final
{
public:
	struct FGameplayEffectSpecHandle              GameplaySpec;                                      // 0x0000(0x000C)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x002C(0x000C)()
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x003C(0x000C)()
};
static_assert(alignof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables) == 0x000004, "Wrong alignment on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables");
static_assert(sizeof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables) == 0x000048, "Wrong size on GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, GameplaySpec) == 0x000000, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::GameplaySpec' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, Temp_bool_Variable) == 0x00000C, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000014, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_GetFloatAttribute_ReturnValue) == 0x000018, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000020, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000028, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x00002C, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, K2Node_Select_Default) == 0x000038, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x00003C, "Member 'GA_Outlander_WhereWereGoingWeNeedRoadsApply_C_SetVariables::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
