#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_GravitySphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.ExecuteUbergraph_GA_Outlander_GravitySphere
// 0x0424 (0x0424 - 0x0000)
struct GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData5;                // 0x0014(0x001C)(ConstParm, ContainsInstancedReference)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData4;                // 0x0030(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData3;                // 0x005C(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData2;                // 0x0088(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData;                 // 0x00B4(0x001C)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   Temp_struct_Variable;                              // 0x00E0(0x001C)(ContainsInstancedReference)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x010C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0120(0x0008)()
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0128(0x0080)(ContainsInstancedReference)
	class AB_Prj_Outlander_GravitySphere_C*       K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_Prj_Outlander_GravitySphere_C*       K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere2; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x021C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0230(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0248(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x025C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0264(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x0274(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable3;                             // 0x027C(0x0014)()
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData6;                // 0x0294(0x001C)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x02B0(0x0034)(ContainsInstancedReference)
	class APlayerPawn_Outlander_C*                K2Node_DynamicCast_AsPlayer_Pawn_Outlander;        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x02EC(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0344(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0358(0x000C)(ZeroConstructor, ReferenceParm)
	TDelegate<void(const struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 CallFunc_SetupCollector_MatterCollector;           // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SetupCollector_SpawnLocation;             // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SetupCollector_ProjectileRotation;        // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetupCollector_MatterSpeed;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetupCollector_MatterGravity;             // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_SetupCollector_TargetSpec;                // 0x0398(0x0064)()
	class UFortAbilityTask_SpawnProjectileAndWait* CallFunc_SpawnProjectileAndWait_ReturnValue;       // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40B[0x1];                                      // 0x040B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x040C(0x0004)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere");
static_assert(sizeof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere) == 0x000424, "Wrong size on GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, EntryPoint) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData5) == 0x000014, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData4) == 0x000030, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData3) == 0x00005C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData2) == 0x000088, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A4, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData) == 0x0000B4, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, Temp_struct_Variable) == 0x0000E0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate6) == 0x0000FC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_TargetData3) == 0x00010C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ApplicationTag3) == 0x000120, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_Array_Get_Item) == 0x000128, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere) == 0x0001A8, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess) == 0x0001AC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_bBlockingHit) == 0x0001AD, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001AE, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_Time) == 0x0001B0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_Location) == 0x0001B4, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_ImpactPoint) == 0x0001C0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_Normal) == 0x0001CC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D8, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_PhysMat) == 0x0001E4, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_HitActor) == 0x0001E8, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_HitComponent) == 0x0001EC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_TraceStart) == 0x0001FC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere2) == 0x000214, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_AsB_Prj_Outlander_Gravity_Sphere2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess2) == 0x000218, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_TargetData2) == 0x00021C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ApplicationTag2) == 0x000230, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate7) == 0x000238, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_TargetData) == 0x000248, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ApplicationTag) == 0x00025C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate8) == 0x000264, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, Temp_struct_Variable2) == 0x000274, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, Temp_struct_Variable3) == 0x00027C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_K2_CommitAbility_ReturnValue) == 0x000290, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CustomEvent_ProjectileData6) == 0x000294, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CustomEvent_ProjectileData6' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_GetActorInfo_ReturnValue) == 0x0002B0, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_AsPlayer_Pawn_Outlander) == 0x0002E4, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_AsPlayer_Pawn_Outlander' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_DynamicCast_bSuccess3) == 0x0002E8, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_MakeStruct_GameplayEventData) == 0x0002EC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000344, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000358, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, K2Node_CreateDelegate_OutputDelegate9) == 0x000364, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_MatterCollector) == 0x000374, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_MatterCollector' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_SpawnLocation) == 0x000378, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_SpawnLocation' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_ProjectileRotation) == 0x000384, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_ProjectileRotation' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_MatterSpeed) == 0x000390, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_MatterSpeed' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_MatterGravity) == 0x000394, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_MatterGravity' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SetupCollector_TargetSpec) == 0x000398, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SetupCollector_TargetSpec' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_SpawnProjectileAndWait_ReturnValue) == 0x0003FC, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_SpawnProjectileAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000400, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000404, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BeginSpawningActor_ReturnValue) == 0x000408, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_IsValid_ReturnValue) == 0x000409, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_IsValid_ReturnValue2) == 0x00040A, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_K2_SetTimer_ReturnValue) == 0x00040C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000410, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000418, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000419, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_GetFloatAttribute_ReturnValue) == 0x00041C, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000420, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere, CallFunc_BooleanAND_ReturnValue) == 0x000421, "Member 'GA_Outlander_GravitySphere_C_ExecuteUbergraph_GA_Outlander_GravitySphere::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Triggered_A8F6F5F8468ED284B63ADFA133F95943
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943, TargetData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943, ApplicationTag) == 0x000014, "Member 'GA_Outlander_GravitySphere_C_Triggered_A8F6F5F8468ED284B63ADFA133F95943::ApplicationTag' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Cancelled_A8F6F5F8468ED284B63ADFA133F95943
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943, TargetData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943, ApplicationTag) == 0x000014, "Member 'GA_Outlander_GravitySphere_C_Cancelled_A8F6F5F8468ED284B63ADFA133F95943::ApplicationTag' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Completed_A8F6F5F8468ED284B63ADFA133F95943
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943, TargetData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943, ApplicationTag) == 0x000014, "Member 'GA_Outlander_GravitySphere_C_Completed_A8F6F5F8468ED284B63ADFA133F95943::ApplicationTag' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Created_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Created_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Touched_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Touched_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8
// 0x001C (0x001C - 0x0000)
struct GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(sizeof(GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8) == 0x00001C, "Wrong size on GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8");
static_assert(offsetof(GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8, ProjectileData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8::ProjectileData' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.SetupCollector
// 0x0178 (0x0178 - 0x0000)
struct GA_Outlander_GravitySphere_C_SetupCollector final
{
public:
	class UClass*                                 MatterCollector;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                SpawnLocation;                                     // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ProjectileRotation;                                // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MatterSpeed;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MatterGravity;                                     // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       TargetSpec;                                        // 0x0024(0x0064)(Parm, OutParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x008C(0x0064)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetAimLocationNearestPawn_ReturnValue;    // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2; // 0x0114(0x0064)()
};
static_assert(alignof(GA_Outlander_GravitySphere_C_SetupCollector) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_SetupCollector");
static_assert(sizeof(GA_Outlander_GravitySphere_C_SetupCollector) == 0x000178, "Wrong size on GA_Outlander_GravitySphere_C_SetupCollector");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, MatterCollector) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::MatterCollector' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, SpawnLocation) == 0x000004, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::SpawnLocation' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, ProjectileRotation) == 0x000010, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::ProjectileRotation' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, MatterSpeed) == 0x00001C, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::MatterSpeed' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, MatterGravity) == 0x000020, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::MatterGravity' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, TargetSpec) == 0x000024, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::TargetSpec' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x00008C, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x0000F0, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x0000F8, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x0000FC, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_GetAimLocationNearestPawn_ReturnValue) == 0x000108, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_GetAimLocationNearestPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_SetupCollector, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2) == 0x000114, "Member 'GA_Outlander_GravitySphere_C_SetupCollector::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.DamageTargets
// 0x0060 (0x0060 - 0x0000)
struct GA_Outlander_GravitySphere_C_DamageTargets final
{
public:
	struct FProjectileEventData                   ProjectileEventData;                               // 0x0000(0x001C)(Parm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetContextFromOwner_ReturnValue;          // 0x0030(0x000C)()
	class AProp_Explorer_OutlanderFragment_Llama_C* K2Node_DynamicCast_AsProp_Explorer_Outlander_Fragment_Llama; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0054(0x0004)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_DamageTargets) == 0x000004, "Wrong alignment on GA_Outlander_GravitySphere_C_DamageTargets");
static_assert(sizeof(GA_Outlander_GravitySphere_C_DamageTargets) == 0x000060, "Wrong size on GA_Outlander_GravitySphere_C_DamageTargets");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, ProjectileEventData) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::ProjectileEventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_Array_Get_Item) == 0x000024, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, K2Node_DynamicCast_AsBuilding_SMActor) == 0x000028, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, K2Node_DynamicCast_bSuccess) == 0x00002C, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_GetContextFromOwner_ReturnValue) == 0x000030, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_GetContextFromOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, K2Node_DynamicCast_AsProp_Explorer_Outlander_Fragment_Llama) == 0x00003C, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::K2Node_DynamicCast_AsProp_Explorer_Outlander_Fragment_Llama' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, K2Node_DynamicCast_bSuccess2) == 0x000040, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000044, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x00004C, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000054, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_DamageTargets, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'GA_Outlander_GravitySphere_C_DamageTargets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C.GetCustomAbilitySourceTransform
// 0x0060 (0x0060 - 0x0000)
struct GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform) == 0x000010, "Wrong alignment on GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform");
static_assert(sizeof(GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform) == 0x000060, "Wrong size on GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform");
static_assert(offsetof(GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform, ReturnValue) == 0x000000, "Member 'GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'GA_Outlander_GravitySphere_C_GetCustomAbilitySourceTransform::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
