#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_TriggerHappy

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_OutlanderTriggeredAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_Outlander_TriggerHappy.GA_Outlander_TriggerHappy_C
// 0x0038 (0x0778 - 0x0740)
class UGA_Outlander_TriggerHappy_C final : public UGAT_OutlanderTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Outlander_TriggerHappy_C;        // 0x0740(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_TriggerHappy;                                   // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_AMCDamage;                                      // 0x0748(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_TriggerHappy;                                   // 0x0760(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Outlander_TriggerHappy(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Outlander_TriggerHappy_C">();
	}
	static class UGA_Outlander_TriggerHappy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Outlander_TriggerHappy_C>();
	}
};
static_assert(alignof(UGA_Outlander_TriggerHappy_C) == 0x000004, "Wrong alignment on UGA_Outlander_TriggerHappy_C");
static_assert(sizeof(UGA_Outlander_TriggerHappy_C) == 0x000778, "Wrong size on UGA_Outlander_TriggerHappy_C");
static_assert(offsetof(UGA_Outlander_TriggerHappy_C, UberGraphFrame_GA_Outlander_TriggerHappy_C) == 0x000740, "Member 'UGA_Outlander_TriggerHappy_C::UberGraphFrame_GA_Outlander_TriggerHappy_C' has a wrong offset!");
static_assert(offsetof(UGA_Outlander_TriggerHappy_C, GE_TriggerHappy) == 0x000744, "Member 'UGA_Outlander_TriggerHappy_C::GE_TriggerHappy' has a wrong offset!");
static_assert(offsetof(UGA_Outlander_TriggerHappy_C, TC_AMCDamage) == 0x000748, "Member 'UGA_Outlander_TriggerHappy_C::TC_AMCDamage' has a wrong offset!");
static_assert(offsetof(UGA_Outlander_TriggerHappy_C, TC_TriggerHappy) == 0x000760, "Member 'UGA_Outlander_TriggerHappy_C::TC_TriggerHappy' has a wrong offset!");

}

#pragma pack(pop)
