#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_KeenEyes

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "StructKeenEyesTargets_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.ExecuteUbergraph_GA_Outlander_KeenEyes
// 0x01A0 (0x01A0 - 0x0000)
struct GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0024(0x0058)(ConstParm)
	class AActor*                                 K2Node_CustomEvent_OtherActor2;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp2;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_OtherBodyIndex2;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x008C(0x0080)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingContainer*                     K2Node_DynamicCast_AsBuilding_Container;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0178(0x0004)()
	TDelegate<void(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              CallFunc_Array_Get_Item;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes");
static_assert(sizeof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes) == 0x0001A0, "Wrong size on GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, EntryPoint) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, Temp_bool_Variable) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_Event_EventData) == 0x000024, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherActor2) == 0x00007C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherComp2) == 0x000080, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherBodyIndex2) == 0x000084, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_bFromSweep) == 0x000088, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_SweepResult) == 0x00008C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherActor) == 0x00010C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherComp) == 0x000110, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CustomEvent_OtherBodyIndex) == 0x000114, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_DynamicCast_AsFort_Pawn) == 0x000118, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_DynamicCast_bSuccess) == 0x00011C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_DynamicCast_AsBuilding_Container) == 0x000120, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_DynamicCast_AsBuilding_Container' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_DynamicCast_bSuccess2) == 0x000124, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Greater_IntInt_ReturnValue) == 0x00012C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000130, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000140, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000148, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x00014C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000154, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000155, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_GetFloatAttribute_ReturnValue) == 0x000158, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00015C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_Select_Default) == 0x000160, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_BooleanAND_ReturnValue) == 0x000164, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CreateDelegate_OutputDelegate2) == 0x000168, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000178, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, K2Node_CreateDelegate_OutputDelegate3) == 0x00017C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Array_Get_Item) == 0x00018C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Array_Length_ReturnValue2) == 0x000190, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_IsValid_ReturnValue) == 0x000194, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Less_IntInt_ReturnValue) == 0x000195, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000198, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes, CallFunc_Add_FloatFloat_ReturnValue) == 0x00019C, "Member 'GA_Outlander_KeenEyes_C_ExecuteUbergraph_GA_Outlander_KeenEyes::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.EndOverlap
// 0x000C (0x000C - 0x0000)
struct GA_Outlander_KeenEyes_C_EndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_EndOverlap) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_EndOverlap");
static_assert(sizeof(GA_Outlander_KeenEyes_C_EndOverlap) == 0x00000C, "Wrong size on GA_Outlander_KeenEyes_C_EndOverlap");
static_assert(offsetof(GA_Outlander_KeenEyes_C_EndOverlap, OtherActor) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_EndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_EndOverlap, OtherComp) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_EndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_EndOverlap, OtherBodyIndex) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_EndOverlap::OtherBodyIndex' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.OverlapTreasure
// 0x0090 (0x0090 - 0x0000)
struct GA_Outlander_KeenEyes_C_OverlapTreasure final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_OverlapTreasure) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_OverlapTreasure");
static_assert(sizeof(GA_Outlander_KeenEyes_C_OverlapTreasure) == 0x000090, "Wrong size on GA_Outlander_KeenEyes_C_OverlapTreasure");
static_assert(offsetof(GA_Outlander_KeenEyes_C_OverlapTreasure, OtherActor) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_OverlapTreasure::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_OverlapTreasure, OtherComp) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_OverlapTreasure::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_OverlapTreasure, OtherBodyIndex) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_OverlapTreasure::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_OverlapTreasure, bFromSweep) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_OverlapTreasure::bFromSweep' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_OverlapTreasure, SweepResult) == 0x000010, "Member 'GA_Outlander_KeenEyes_C_OverlapTreasure::SweepResult' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.GetNearbyLoot
// 0x0060 (0x0060 - 0x0000)
struct GA_Outlander_KeenEyes_C_GetNearbyLoot final
{
public:
	class AActor*                                 NewIncomingActor;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStructKeenEyesTargets                 K2Node_MakeStruct_StructKeenEyesTargets;           // 0x000C(0x000C)()
	class ABuildingContainer*                     K2Node_DynamicCast_AsBuilding_Container;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetLootTier_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStructKeenEyesTargets                 K2Node_MakeStruct_StructKeenEyesTargets2;          // 0x0050(0x000C)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_GetNearbyLoot) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_GetNearbyLoot");
static_assert(sizeof(GA_Outlander_KeenEyes_C_GetNearbyLoot) == 0x000060, "Wrong size on GA_Outlander_KeenEyes_C_GetNearbyLoot");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, NewIncomingActor) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::NewIncomingActor' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_DynamicCast_AsFort_Pawn) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_MakeStruct_StructKeenEyesTargets) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_MakeStruct_StructKeenEyesTargets' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_DynamicCast_AsBuilding_Container) == 0x000018, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_DynamicCast_AsBuilding_Container' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_DynamicCast_bSuccess2) == 0x00001C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_GetTeamAffiliation_ReturnValue) == 0x00001D, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_SwitchEnum_CmpSuccess) == 0x00001E, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x000020, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_GetLootTier_ReturnValue) == 0x000024, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_GetLootTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00002C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_Conv_VectorToLinearColor_ReturnValue2) == 0x00003C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_Conv_VectorToLinearColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x00004C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, K2Node_MakeStruct_StructKeenEyesTargets2) == 0x000050, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::K2Node_MakeStruct_StructKeenEyesTargets2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_GetNearbyLoot, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'GA_Outlander_KeenEyes_C_GetNearbyLoot::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.Set Or Remove Keen Eyes Custom Depth
// 0x0050 (0x0050 - 0x0000)
struct GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth final
{
public:
	class AFortPawn*                              Character_Mesh;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Render_CustomDepth;                                // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue2;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Round_ReturnValue2;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth");
static_assert(sizeof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth) == 0x000050, "Wrong size on GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, Character_Mesh) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::Character_Mesh' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, Render_CustomDepth) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::Render_CustomDepth' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, Temp_int_Variable) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, K2Node_DynamicCast_bSuccess) == 0x000014, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000018, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_IsValid_ReturnValue2) == 0x00001D, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, Temp_int_Variable2) == 0x000020, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000028, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000029, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Array_AddUnique_ReturnValue) == 0x000030, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Array_RemoveItem_ReturnValue) == 0x000034, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000038, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_MakeLiteralInt_ReturnValue) == 0x00003C, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Round_ReturnValue) == 0x000040, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_GetScalarParameterValue_ReturnValue2) == 0x000048, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth, CallFunc_Round_ReturnValue2) == 0x00004C, "Member 'GA_Outlander_KeenEyes_C_Set_Or_Remove_Keen_Eyes_Custom_Depth::CallFunc_Round_ReturnValue2' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.Deactivate Keen Eye Particles as Objects Leave the Overlap Region
// 0x0038 (0x0038 - 0x0000)
struct GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region final
{
public:
	class ABuildingContainer*                     Building_Container;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              Fort_Pawn;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Fort_Pawn_True_Building_container_False;           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStructKeenEyesTargets                 CallFunc_Array_Get_Item;                           // 0x0020(0x000C)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsContainer;                                       // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFortPawn;                                        // 0x0037(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region");
static_assert(sizeof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region) == 0x000038, "Wrong size on GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Building_Container) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Building_Container' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Fort_Pawn) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Fort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Fort_Pawn_True_Building_container_False) == 0x000008, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Fort_Pawn_True_Building_container_False' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Temp_bool_True_if_break_was_hit_Variable) == 0x000009, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, Temp_bool_Variable) == 0x000018, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Array_Get_Item) == 0x000020, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000033, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000034, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, K2Node_Select_Default) == 0x000035, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, IsContainer) == 0x000036, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::IsContainer' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region, IsFortPawn) == 0x000037, "Member 'GA_Outlander_KeenEyes_C_Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region::IsFortPawn' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.Activate Deactivate Outline Post Process
// 0x0018 (0x0018 - 0x0000)
struct GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process final
{
public:
	float                                         Outline_Weight;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process");
static_assert(sizeof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process) == 0x000018, "Wrong size on GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process, Outline_Weight) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process::Outline_Weight' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000004, "Member 'GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process, CallFunc_IsValid_ReturnValue2) == 0x000014, "Member 'GA_Outlander_KeenEyes_C_Activate_Deactivate_Outline_Post_Process::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C.Setup Post Fades
// 0x0034 (0x0034 - 0x0000)
struct GA_Outlander_KeenEyes_C_Setup_Post_Fades final
{
public:
	bool                                          Activating__T__Or_Deactivating__F_;                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue2;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue2;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Outlander_KeenEyes_C_Setup_Post_Fades) == 0x000004, "Wrong alignment on GA_Outlander_KeenEyes_C_Setup_Post_Fades");
static_assert(sizeof(GA_Outlander_KeenEyes_C_Setup_Post_Fades) == 0x000034, "Wrong size on GA_Outlander_KeenEyes_C_Setup_Post_Fades");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Setup_Post_Fades, Activating__T__Or_Deactivating__F_) == 0x000000, "Member 'GA_Outlander_KeenEyes_C_Setup_Post_Fades::Activating__T__Or_Deactivating__F_' has a wrong offset!");
static_assert(offsetof(GA_Outlander_KeenEyes_C_Setup_Post_Fades, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'GA_Outlander_KeenEyes_C_Setup_Post_Fades::CallFunc_IsValid_ReturnValue' has a wrong offset!");
