#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Outlander_FindersKeepers

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Outlander_FindersKeepers.GA_Outlander_FindersKeepers_C.ExecuteUbergraph_GA_Outlander_FindersKeepers
// 0x0060 (0x0060 - 0x0000)
struct GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x005C(0x0004)()
};
static_assert(alignof(GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers) == 0x000004, "Wrong alignment on GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers");
static_assert(sizeof(GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers) == 0x000060, "Wrong size on GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers");
static_assert(offsetof(GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers, EntryPoint) == 0x000000, "Member 'GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers, K2Node_Event_EventData) == 0x000004, "Member 'GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00005C, "Member 'GA_Outlander_FindersKeepers_C_ExecuteUbergraph_GA_Outlander_FindersKeepers::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Outlander_FindersKeepers.GA_Outlander_FindersKeepers_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_Outlander_FindersKeepers_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

}

#pragma pack(pop)
