#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReflectDamage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_ReflectDamage.GA_ReflectDamage_C.ExecuteUbergraph_GA_ReflectDamage
// 0x0094 (0x0094 - 0x0000)
struct GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerHaveTag_ReturnValue;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue3;   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue4;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue5;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoGameplayTagsMatch_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EvaluateAttributeValueWithTags_bSuccess;  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeValueWithTags_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EvaluateAttributeValueWithTags_bSuccess2; // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeValueWithTags_ReturnValue2; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage) == 0x000004, "Wrong alignment on GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage");
static_assert(sizeof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage) == 0x000094, "Wrong size on GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, EntryPoint) == 0x000000, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, K2Node_Event_EventData) == 0x000004, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, K2Node_DynamicCast_AsActor) == 0x00005C, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_DoesContainerHaveTag_ReturnValue) == 0x000061, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_DoesContainerHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000064, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x000068, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00006C, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_GetAbilitySystemComponent_ReturnValue3) == 0x000070, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_GetAbilitySystemComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_GetAbilitySystemComponent_ReturnValue4) == 0x000074, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_GetAbilitySystemComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_GetAbilitySystemComponent_ReturnValue5) == 0x000078, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_GetAbilitySystemComponent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_DoGameplayTagsMatch_ReturnValue) == 0x00007C, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_DoGameplayTagsMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_bSuccess) == 0x00007D, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_ReturnValue) == 0x000080, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_bSuccess2) == 0x000084, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_ReturnValue2) == 0x000088, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'GA_ReflectDamage_C_ExecuteUbergraph_GA_ReflectDamage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_ReflectDamage.GA_ReflectDamage_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_ReflectDamage_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_ReflectDamage_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_ReflectDamage_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_ReflectDamage_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_ReflectDamage_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_ReflectDamage_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_ReflectDamage_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_ReflectDamage.GA_ReflectDamage_C.ReflectDamage
// 0x007C (0x007C - 0x0000)
struct GA_ReflectDamage_C_ReflectDamage final
{
public:
	class UAbilitySystemComponent*                OriginalDmgCauser;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                OriginalDmgReceiver;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                ReflectedDmgDealer;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         OriginalDmg;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  OriginalDmgReceiverTags;                           // 0x0010(0x0018)(Parm)
	struct FGameplayTagContainer                  OriginalDmgCauserTags;                             // 0x0028(0x0018)(Parm)
	bool                                          CallFunc_EvaluateAttributeValueWithTags_bSuccess;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeValueWithTags_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0048(0x000C)()
	bool                                          CallFunc_EvaluateAttributeValueWithTags_bSuccess2; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeValueWithTags_ReturnValue2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0068(0x000C)()
	bool                                          CallFunc_DoesContainerHaveTag_ReturnValue;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0078(0x0004)()
};
static_assert(alignof(GA_ReflectDamage_C_ReflectDamage) == 0x000004, "Wrong alignment on GA_ReflectDamage_C_ReflectDamage");
static_assert(sizeof(GA_ReflectDamage_C_ReflectDamage) == 0x00007C, "Wrong size on GA_ReflectDamage_C_ReflectDamage");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, OriginalDmgCauser) == 0x000000, "Member 'GA_ReflectDamage_C_ReflectDamage::OriginalDmgCauser' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, OriginalDmgReceiver) == 0x000004, "Member 'GA_ReflectDamage_C_ReflectDamage::OriginalDmgReceiver' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, ReflectedDmgDealer) == 0x000008, "Member 'GA_ReflectDamage_C_ReflectDamage::ReflectedDmgDealer' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, OriginalDmg) == 0x00000C, "Member 'GA_ReflectDamage_C_ReflectDamage::OriginalDmg' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, OriginalDmgReceiverTags) == 0x000010, "Member 'GA_ReflectDamage_C_ReflectDamage::OriginalDmgReceiverTags' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, OriginalDmgCauserTags) == 0x000028, "Member 'GA_ReflectDamage_C_ReflectDamage::OriginalDmgCauserTags' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_bSuccess) == 0x000040, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_ReturnValue) == 0x000044, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000048, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_bSuccess2) == 0x000054, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_EvaluateAttributeValueWithTags_ReturnValue2) == 0x000058, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_EvaluateAttributeValueWithTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00005C, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000068, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_DoesContainerHaveTag_ReturnValue) == 0x000074, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_DoesContainerHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_C_ReflectDamage, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000078, "Member 'GA_ReflectDamage_C_ReflectDamage::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
