#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReflectDamage_WithSource

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_ReflectDamage_WithSource.GA_ReflectDamage_WithSource_C.ExecuteUbergraph_GA_ReflectDamage_WithSource
// 0x00C0 (0x00C0 - 0x0000)
struct GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0068(0x0058)()
};
static_assert(alignof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource) == 0x000004, "Wrong alignment on GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource");
static_assert(sizeof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource) == 0x0000C0, "Wrong size on GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, EntryPoint) == 0x000000, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, K2Node_Event_EventData) == 0x000004, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x00005C, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, K2Node_DynamicCast_AsActor) == 0x000060, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, K2Node_DynamicCast_bSuccess) == 0x000064, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource, K2Node_MakeStruct_GameplayEventData) == 0x000068, "Member 'GA_ReflectDamage_WithSource_C_ExecuteUbergraph_GA_ReflectDamage_WithSource::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");

// Function GA_ReflectDamage_WithSource.GA_ReflectDamage_WithSource_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_ReflectDamage_WithSource_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

#pragma pack(pop)
