#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SupplyDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GA_SupplyDrop.GA_SupplyDrop_C
// 0x00CC (0x07A8 - 0x06DC)
class UGA_SupplyDrop_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        Fort_Player_Pawn;                                  // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           EventComplete;                                     // 0x06E4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventActivation;                                   // 0x06EC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortAbilityTargetSelection            T_Explosion;                                       // 0x06F4(0x004C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             ActivationSound;                                   // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     EventData;                                         // 0x0744(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AbilityMultiplier;                                 // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayAttribute                     ExplorersGuildBuilding3;                           // 0x07A0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PowerLevel;                                        // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_SupplyDrop(int32 EntryPoint);
	void K2_ActivateAbility();
	void GetAttributeValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SupplyDrop_C">();
	}
	static class UGA_SupplyDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SupplyDrop_C>();
	}
};
static_assert(alignof(UGA_SupplyDrop_C) == 0x000004, "Wrong alignment on UGA_SupplyDrop_C");
static_assert(sizeof(UGA_SupplyDrop_C) == 0x0007A8, "Wrong size on UGA_SupplyDrop_C");
static_assert(offsetof(UGA_SupplyDrop_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_SupplyDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, Fort_Player_Pawn) == 0x0006E0, "Member 'UGA_SupplyDrop_C::Fort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, EventComplete) == 0x0006E4, "Member 'UGA_SupplyDrop_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, EventActivation) == 0x0006EC, "Member 'UGA_SupplyDrop_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, T_Explosion) == 0x0006F4, "Member 'UGA_SupplyDrop_C::T_Explosion' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, ActivationSound) == 0x000740, "Member 'UGA_SupplyDrop_C::ActivationSound' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, EventData) == 0x000744, "Member 'UGA_SupplyDrop_C::EventData' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, AbilityMultiplier) == 0x00079C, "Member 'UGA_SupplyDrop_C::AbilityMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, ExplorersGuildBuilding3) == 0x0007A0, "Member 'UGA_SupplyDrop_C::ExplorersGuildBuilding3' has a wrong offset!");
static_assert(offsetof(UGA_SupplyDrop_C, PowerLevel) == 0x0007A4, "Member 'UGA_SupplyDrop_C::PowerLevel' has a wrong offset!");

}

#pragma pack(pop)
