#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Teleporter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GA_Teleporter.GA_Teleporter_C
// 0x0058 (0x0734 - 0x06DC)
class UGA_Teleporter_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 TeleporterClass;                                   // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortAbilityDecoTool*                   DecoTool;                                          // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayAttribute                     BuildingAttribute;                                 // 0x06EC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 UpgradeMaxRange;                                   // 0x06F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 UpgradeRechargeDecay;                              // 0x06FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                   PlayerColors;                                      // 0x0708(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FAbilityToolSpawnParameters            SpawnParameters;                                   // 0x0714(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Teleporter(int32 EntryPoint);
	void K2_ActivateAbility();
	void DestroyExistingPortalsForPlayer(class AController* Controller);
	void InitPortalAndSpawnTargetTeleporter(class AB_Teleporter_C* NewTeleporter);
	void GetSecondTeleporterSpawnLoc(class AActor* FirstTeleporter, struct FTransform* SpawnTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Teleporter_C">();
	}
	static class UGA_Teleporter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Teleporter_C>();
	}
};
static_assert(alignof(UGA_Teleporter_C) == 0x000004, "Wrong alignment on UGA_Teleporter_C");
static_assert(sizeof(UGA_Teleporter_C) == 0x000734, "Wrong size on UGA_Teleporter_C");
static_assert(offsetof(UGA_Teleporter_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_Teleporter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, TeleporterClass) == 0x0006E0, "Member 'UGA_Teleporter_C::TeleporterClass' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, PlayerPawn) == 0x0006E4, "Member 'UGA_Teleporter_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, DecoTool) == 0x0006E8, "Member 'UGA_Teleporter_C::DecoTool' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, BuildingAttribute) == 0x0006EC, "Member 'UGA_Teleporter_C::BuildingAttribute' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, UpgradeMaxRange) == 0x0006F0, "Member 'UGA_Teleporter_C::UpgradeMaxRange' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, UpgradeRechargeDecay) == 0x0006FC, "Member 'UGA_Teleporter_C::UpgradeRechargeDecay' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, PlayerColors) == 0x000708, "Member 'UGA_Teleporter_C::PlayerColors' has a wrong offset!");
static_assert(offsetof(UGA_Teleporter_C, SpawnParameters) == 0x000714, "Member 'UGA_Teleporter_C::SpawnParameters' has a wrong offset!");

}

#pragma pack(pop)
