#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TrapGeneric

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_TrapGeneric.GA_TrapGeneric_C.ExecuteUbergraph_GA_TrapGeneric
// 0x0070 (0x0070 - 0x0000)
struct GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTrapLevel_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetTouchingDamageTargets_ReturnValue;     // 0x0024(0x000C)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0038(0x0014)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0050(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue2; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric) == 0x000004, "Wrong alignment on GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric");
static_assert(sizeof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric) == 0x000070, "Wrong size on GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, EntryPoint) == 0x000000, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_K2_CommitAbility_ReturnValue) == 0x000010, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000014, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap) == 0x000018, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess) == 0x00001C, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetTrapLevel_ReturnValue) == 0x000020, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetTrapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetTouchingDamageTargets_ReturnValue) == 0x000024, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetTouchingDamageTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetDamageDelay_ReturnValue) == 0x000030, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_Array_Get_Item) == 0x000034, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000038, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000050, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetFireDelay_ReturnValue) == 0x000060, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue2) == 0x000064, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap2) == 0x000068, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess2) == 0x00006C, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

#pragma pack(pop)
