#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_FloorLauncher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Trap_FloorLauncher.GA_Trap_FloorLauncher_C.ExecuteUbergraph_GA_Trap_FloorLauncher
// 0x0128 (0x0128 - 0x0000)
struct GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0020(0x000C)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x002C(0x0004)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue2; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap2;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0050(0x000C)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x005C(0x000C)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFullBodyHit_ReturnValue;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable2;                             // 0x0078(0x0004)()
	TArray<class AActor*>                         CallFunc_GetTouchingDamageTargets_ReturnValue;     // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x00A4(0x0018)()
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x00BC(0x0030)()
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0108(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x011C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher) == 0x000004, "Wrong alignment on GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher");
static_assert(sizeof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher) == 0x000128, "Wrong size on GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, EntryPoint) == 0x000000, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_AsBuilding_Trap) == 0x00000C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetDamageDelay_ReturnValue) == 0x000014, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetFireDelay_ReturnValue) == 0x000018, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_CustomEvent_Target) == 0x00001C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_CustomEvent_SpecHandle) == 0x000020, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_CustomEvent_ActiveHandle) == 0x00002C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetOwningActorFromActorInfo_ReturnValue2) == 0x000030, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetOwningActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_AsBuilding_Trap2) == 0x000034, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_AsBuilding_Trap2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, Temp_object_Variable) == 0x00004C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, Temp_struct_Variable) == 0x000050, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetEffectContext_ReturnValue) == 0x00005C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_IsFullBodyHit_ReturnValue) == 0x00006C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_IsFullBodyHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, Temp_int_Array_Index_Variable) == 0x000074, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, Temp_struct_Variable2) == 0x000078, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetTouchingDamageTargets_ReturnValue) == 0x00007C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetTouchingDamageTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Array_Get_Item) == 0x000088, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_AsCharacter) == 0x000090, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_DynamicCast_bSuccess3) == 0x000094, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x00009C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x0000A4, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, K2Node_MakeStruct_GameplayTagRequirements) == 0x0000BC, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x0000EC, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F0, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F4, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_MakeVector_ReturnValue) == 0x0000F8, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000108, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x00011C, "Member 'GA_Trap_FloorLauncher_C_ExecuteUbergraph_GA_Trap_FloorLauncher::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");

// Function GA_Trap_FloorLauncher.GA_Trap_FloorLauncher_C.OnApplied_A7A2BC074785D273036EA19D186AC748
// 0x0014 (0x0014 - 0x0000)
struct GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748 final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0004(0x000C)(Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0010(0x0004)(Parm)
};
static_assert(alignof(GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748) == 0x000004, "Wrong alignment on GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748");
static_assert(sizeof(GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748) == 0x000014, "Wrong size on GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748");
static_assert(offsetof(GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748, Target) == 0x000000, "Member 'GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748::Target' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748, SpecHandle) == 0x000004, "Member 'GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748, ActiveHandle) == 0x000010, "Member 'GA_Trap_FloorLauncher_C_OnApplied_A7A2BC074785D273036EA19D186AC748::ActiveHandle' has a wrong offset!");

}

#pragma pack(pop)
