#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WhereWeregoingWeNeedRoadsRemove

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C.ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove
// 0x0114 (0x0114 - 0x0000)
struct GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0004(0x0034)(ContainsInstancedReference)
	class APlayerPawn_Outlander_C*                K2Node_DynamicCast_AsPlayer_Pawn_Outlander;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0040(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0098(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00AC(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00B8(0x0058)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove) == 0x000004, "Wrong alignment on GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove");
static_assert(sizeof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove) == 0x000114, "Wrong size on GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, EntryPoint) == 0x000000, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, CallFunc_GetActorInfo_ReturnValue) == 0x000004, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, K2Node_DynamicCast_AsPlayer_Pawn_Outlander) == 0x000038, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::K2Node_DynamicCast_AsPlayer_Pawn_Outlander' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, K2Node_DynamicCast_bSuccess) == 0x00003C, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, K2Node_MakeStruct_GameplayEventData) == 0x000040, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000AC, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, K2Node_Event_EventData) == 0x0000B8, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove, CallFunc_K2_CommitAbility_ReturnValue) == 0x000110, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_WhereWeregoingWeNeedRoadsRemove_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

}

#pragma pack(pop)
