#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WhereWeregoingWeNeedRoadsRemove

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C
// 0x0080 (0x075C - 0x06DC)
class UGA_WhereWeregoingWeNeedRoadsRemove_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     EventData;                                         // 0x06E0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerPawn_Outlander_C*                OutlanderPawn;                                     // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           EventComplete;                                     // 0x073C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_Roads;                                          // 0x0744(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WhereWeregoingWeNeedRoadsRemove_C">();
	}
	static class UGA_WhereWeregoingWeNeedRoadsRemove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WhereWeregoingWeNeedRoadsRemove_C>();
	}
};
static_assert(alignof(UGA_WhereWeregoingWeNeedRoadsRemove_C) == 0x000004, "Wrong alignment on UGA_WhereWeregoingWeNeedRoadsRemove_C");
static_assert(sizeof(UGA_WhereWeregoingWeNeedRoadsRemove_C) == 0x00075C, "Wrong size on UGA_WhereWeregoingWeNeedRoadsRemove_C");
static_assert(offsetof(UGA_WhereWeregoingWeNeedRoadsRemove_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_WhereWeregoingWeNeedRoadsRemove_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_WhereWeregoingWeNeedRoadsRemove_C, EventData) == 0x0006E0, "Member 'UGA_WhereWeregoingWeNeedRoadsRemove_C::EventData' has a wrong offset!");
static_assert(offsetof(UGA_WhereWeregoingWeNeedRoadsRemove_C, OutlanderPawn) == 0x000738, "Member 'UGA_WhereWeregoingWeNeedRoadsRemove_C::OutlanderPawn' has a wrong offset!");
static_assert(offsetof(UGA_WhereWeregoingWeNeedRoadsRemove_C, EventComplete) == 0x00073C, "Member 'UGA_WhereWeregoingWeNeedRoadsRemove_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_WhereWeregoingWeNeedRoadsRemove_C, TC_Roads) == 0x000744, "Member 'UGA_WhereWeregoingWeNeedRoadsRemove_C::TC_Roads' has a wrong offset!");

}

#pragma pack(pop)
