#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerRanged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAB_AIBaseRanged_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAB_FlingerRanged.GAB_FlingerRanged_C
// 0x0020 (0x070C - 0x06EC)
class UGAB_FlingerRanged_C final : public UGAB_AIBaseRanged_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_FlingerRanged_C;                // 0x06EC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ThrowFX;                                           // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        ThrowFXTemplate;                                   // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 FlingerMesh;                                       // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           GC_NPCRangedGrab;                                  // 0x06FC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GC_NPCRangedThrow;                                 // 0x0704(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAB_FlingerRanged(int32 EntryPoint);
	void K2_OnEndAbility();
	void StopFX();
	void SpawnFX();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_FlingerRanged_C">();
	}
	static class UGAB_FlingerRanged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_FlingerRanged_C>();
	}
};
static_assert(alignof(UGAB_FlingerRanged_C) == 0x000004, "Wrong alignment on UGAB_FlingerRanged_C");
static_assert(sizeof(UGAB_FlingerRanged_C) == 0x00070C, "Wrong size on UGAB_FlingerRanged_C");
static_assert(offsetof(UGAB_FlingerRanged_C, UberGraphFrame_GAB_FlingerRanged_C) == 0x0006EC, "Member 'UGAB_FlingerRanged_C::UberGraphFrame_GAB_FlingerRanged_C' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerRanged_C, ThrowFX) == 0x0006F0, "Member 'UGAB_FlingerRanged_C::ThrowFX' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerRanged_C, ThrowFXTemplate) == 0x0006F4, "Member 'UGAB_FlingerRanged_C::ThrowFXTemplate' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerRanged_C, FlingerMesh) == 0x0006F8, "Member 'UGAB_FlingerRanged_C::FlingerMesh' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerRanged_C, GC_NPCRangedGrab) == 0x0006FC, "Member 'UGAB_FlingerRanged_C::GC_NPCRangedGrab' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerRanged_C, GC_NPCRangedThrow) == 0x000704, "Member 'UGAB_FlingerRanged_C::GC_NPCRangedThrow' has a wrong offset!");

}

#pragma pack(pop)
