#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_BlasterRanged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GAB_BlasterRanged.GAB_BlasterRanged_C
// 0x0010 (0x06EC - 0x06DC)
class UGAB_BlasterRanged_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NumShotsMax;                                       // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABlasterPawn_C*                         BlasterPawn;                                       // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RotationRateWhenAttacking;                         // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAB_BlasterRanged(int32 EntryPoint);
	void StopFiring();
	void K2_OnEndAbility();
	void Reset_Ending_Montage_DoOnce();
	void K2_ActivateAbility();
	void Triggered_B70914E34DF839C9F27FBA8D66801C0D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_B70914E34DF839C9F27FBA8D66801C0D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_B70914E34DF839C9F27FBA8D66801C0D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnComplete_F2E0D80F47E87F169FADB1814583F0E0();
	void OnInterrupted_F2E0D80F47E87F169FADB1814583F0E0();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_BlasterRanged_C">();
	}
	static class UGAB_BlasterRanged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_BlasterRanged_C>();
	}
};
static_assert(alignof(UGAB_BlasterRanged_C) == 0x000004, "Wrong alignment on UGAB_BlasterRanged_C");
static_assert(sizeof(UGAB_BlasterRanged_C) == 0x0006EC, "Wrong size on UGAB_BlasterRanged_C");
static_assert(offsetof(UGAB_BlasterRanged_C, UberGraphFrame) == 0x0006DC, "Member 'UGAB_BlasterRanged_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_BlasterRanged_C, NumShotsMax) == 0x0006E0, "Member 'UGAB_BlasterRanged_C::NumShotsMax' has a wrong offset!");
static_assert(offsetof(UGAB_BlasterRanged_C, BlasterPawn) == 0x0006E4, "Member 'UGAB_BlasterRanged_C::BlasterPawn' has a wrong offset!");
static_assert(offsetof(UGAB_BlasterRanged_C, RotationRateWhenAttacking) == 0x0006E8, "Member 'UGAB_BlasterRanged_C::RotationRateWhenAttacking' has a wrong offset!");

}

#pragma pack(pop)
