#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerThrowHusk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C
// 0x001C (0x06F8 - 0x06DC)
class UGAB_FlingerThrowHusk_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class AFlingerPawn_C*                         FlingerPawn;                                       // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AHuskPawn_C*                            HuskHeldByFlinger;                                 // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           GC_FlingerGrabNPC;                                 // 0x06E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GC_NPCRangedThrow;                                 // 0x06F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAB_FlingerThrowHusk(int32 EntryPoint);
	void StopFX();
	void SpawnFX();
	void CommitAndEndAbility();
	void K2_OnEndAbility();
	void K2_ActivateAbility();
	void Triggered_B56594C44CE933A96A3E13BDCFC1097D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_B56594C44CE933A96A3E13BDCFC1097D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_B56594C44CE933A96A3E13BDCFC1097D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_FlingerThrowHusk_C">();
	}
	static class UGAB_FlingerThrowHusk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_FlingerThrowHusk_C>();
	}
};
static_assert(alignof(UGAB_FlingerThrowHusk_C) == 0x000004, "Wrong alignment on UGAB_FlingerThrowHusk_C");
static_assert(sizeof(UGAB_FlingerThrowHusk_C) == 0x0006F8, "Wrong size on UGAB_FlingerThrowHusk_C");
static_assert(offsetof(UGAB_FlingerThrowHusk_C, UberGraphFrame) == 0x0006DC, "Member 'UGAB_FlingerThrowHusk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerThrowHusk_C, FlingerPawn) == 0x0006E0, "Member 'UGAB_FlingerThrowHusk_C::FlingerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerThrowHusk_C, HuskHeldByFlinger) == 0x0006E4, "Member 'UGAB_FlingerThrowHusk_C::HuskHeldByFlinger' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerThrowHusk_C, GC_FlingerGrabNPC) == 0x0006E8, "Member 'UGAB_FlingerThrowHusk_C::GC_FlingerGrabNPC' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerThrowHusk_C, GC_NPCRangedThrow) == 0x0006F0, "Member 'UGAB_FlingerThrowHusk_C::GC_NPCRangedThrow' has a wrong offset!");

}

#pragma pack(pop)
