#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerApplyFullBodyHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAB_GenericApplyFullBodyHit_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAB_FlingerApplyFullBodyHit.GAB_FlingerApplyFullBodyHit_C
// 0x0014 (0x071C - 0x0708)
class UGAB_FlingerApplyFullBodyHit_C final : public UGAB_GenericApplyFullBodyHit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_FlingerApplyFullBodyHit_C;      // 0x0708(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   HitReactBack;                                      // 0x070C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   HitReactSectionName;                               // 0x0714(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAB_FlingerApplyFullBodyHit(int32 EntryPoint);
	void PickFullBodyHitMontageSection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_FlingerApplyFullBodyHit_C">();
	}
	static class UGAB_FlingerApplyFullBodyHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_FlingerApplyFullBodyHit_C>();
	}
};
static_assert(alignof(UGAB_FlingerApplyFullBodyHit_C) == 0x000004, "Wrong alignment on UGAB_FlingerApplyFullBodyHit_C");
static_assert(sizeof(UGAB_FlingerApplyFullBodyHit_C) == 0x00071C, "Wrong size on UGAB_FlingerApplyFullBodyHit_C");
static_assert(offsetof(UGAB_FlingerApplyFullBodyHit_C, UberGraphFrame_GAB_FlingerApplyFullBodyHit_C) == 0x000708, "Member 'UGAB_FlingerApplyFullBodyHit_C::UberGraphFrame_GAB_FlingerApplyFullBodyHit_C' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerApplyFullBodyHit_C, HitReactBack) == 0x00070C, "Member 'UGAB_FlingerApplyFullBodyHit_C::HitReactBack' has a wrong offset!");
static_assert(offsetof(UGAB_FlingerApplyFullBodyHit_C, HitReactSectionName) == 0x000714, "Member 'UGAB_FlingerApplyFullBodyHit_C::HitReactSectionName' has a wrong offset!");

}

#pragma pack(pop)
