#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AIBaseMelee

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_AIBaseMelee.GAB_AIBaseMelee_C.ExecuteUbergraph_GAB_AIBaseMelee
// 0x00C0 (0x00C0 - 0x0000)
struct GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0014(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0028(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0030(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0044(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x005C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0070(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0090(0x0014)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00A8(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee) == 0x000004, "Wrong alignment on GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee");
static_assert(sizeof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee) == 0x0000C0, "Wrong size on GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, EntryPoint) == 0x000000, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_TargetData3) == 0x000014, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_ApplicationTag3) == 0x000028, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_TargetData2) == 0x000030, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_ApplicationTag2) == 0x000044, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_TargetData) == 0x00005C, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CustomEvent_ApplicationTag) == 0x000070, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, Temp_struct_Variable) == 0x000088, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, Temp_struct_Variable2) == 0x000090, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, CallFunc_TargetDataHasActor_ReturnValue) == 0x0000A4, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000A8, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B4, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000B8, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'GAB_AIBaseMelee_C_ExecuteUbergraph_GAB_AIBaseMelee::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GAB_AIBaseMelee.GAB_AIBaseMelee_C.Triggered_8CCC8A6B41B7B728038BDE887BD23BCC
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x000004, "Wrong alignment on GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(sizeof(GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x00001C, "Wrong size on GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(offsetof(GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseMelee_C_Triggered_8CCC8A6B41B7B728038BDE887BD23BCC::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee.GAB_AIBaseMelee_C.Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x000004, "Wrong alignment on GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(sizeof(GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x00001C, "Wrong size on GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(offsetof(GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseMelee_C_Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee.GAB_AIBaseMelee_C.Completed_8CCC8A6B41B7B728038BDE887BD23BCC
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x000004, "Wrong alignment on GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(sizeof(GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC) == 0x00001C, "Wrong size on GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC");
static_assert(offsetof(GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseMelee_C_Completed_8CCC8A6B41B7B728038BDE887BD23BCC::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
