#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerRanged

#include "Basic.hpp"

#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_FlingerRanged.GAB_FlingerRanged_C.ExecuteUbergraph_GAB_FlingerRanged
// 0x000C (0x000C - 0x0000)
struct GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0004(0x0004)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x0008(0x0004)()
};
static_assert(alignof(GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged) == 0x000004, "Wrong alignment on GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged");
static_assert(sizeof(GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged) == 0x00000C, "Wrong size on GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged");
static_assert(offsetof(GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged, EntryPoint) == 0x000000, "Member 'GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged, CallFunc_K2_SetTimer_ReturnValue) == 0x000004, "Member 'GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged, CallFunc_K2_SetTimer_ReturnValue2) == 0x000008, "Member 'GAB_FlingerRanged_C_ExecuteUbergraph_GAB_FlingerRanged::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");

}

#pragma pack(pop)
