#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericStunned

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_GenericStunned.GAB_GenericStunned_C.ExecuteUbergraph_GAB_GenericStunned
// 0x000C (0x000C - 0x0000)
struct GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned) == 0x000004, "Wrong alignment on GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned");
static_assert(sizeof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned) == 0x00000C, "Wrong size on GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, EntryPoint) == 0x000000, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingPawn_ReturnValue) == 0x000004, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_IsValid_ReturnValue2) == 0x000009, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

}

#pragma pack(pop)
