#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericApplyPush

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_GenericApplyPush.GAB_GenericApplyPush_C.ExecuteUbergraph_GAB_GenericApplyPush
// 0x015C (0x015C - 0x0000)
struct GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0034(0x0058)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate4;             // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x009C(0x0058)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00FC(0x0058)(ConstParm)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush) == 0x000004, "Wrong alignment on GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush");
static_assert(sizeof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush) == 0x00015C, "Wrong size on GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, EntryPoint) == 0x000000, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_CreateDelegate_OutputDelegate3) == 0x000024, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_CustomEvent_Payload) == 0x000034, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_CreateDelegate_OutputDelegate4) == 0x00008C, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, Temp_struct_Variable) == 0x00009C, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0000F4, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, K2Node_Event_EventData) == 0x0000FC, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000154, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush, CallFunc_IsValid_ReturnValue2) == 0x000158, "Member 'GAB_GenericApplyPush_C_ExecuteUbergraph_GAB_GenericApplyPush::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GAB_GenericApplyPush.GAB_GenericApplyPush_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_GenericApplyPush_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_GenericApplyPush.GAB_GenericApplyPush_C.EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE
// 0x0058 (0x0058 - 0x0000)
struct GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x0058)(Parm)
};
static_assert(alignof(GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE) == 0x000004, "Wrong alignment on GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE");
static_assert(sizeof(GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE) == 0x000058, "Wrong size on GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE");
static_assert(offsetof(GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE, Payload) == 0x000000, "Member 'GAB_GenericApplyPush_C_EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE::Payload' has a wrong offset!");

}

#pragma pack(pop)
