#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AIBaseRanged

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_AIBaseRanged.GAB_AIBaseRanged_C.ExecuteUbergraph_GAB_AIBaseRanged
// 0x0170 (0x0170 - 0x0000)
struct GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0004(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0018(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0030(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0044(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x005C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0070(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0090(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00A4(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x00B4(0x0008)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileSpeed; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetProjectileInitialValues_outSpawnDirection; // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileGravity; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetProjectileInitialValues_HomingTarget;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x00EC(0x0064)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged) == 0x000004, "Wrong alignment on GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged");
static_assert(sizeof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged) == 0x000170, "Wrong size on GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, EntryPoint) == 0x000000, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_TargetData3) == 0x000004, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_ApplicationTag3) == 0x000018, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_TargetData2) == 0x000030, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_ApplicationTag2) == 0x000044, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_TargetData) == 0x00005C, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CustomEvent_ApplicationTag) == 0x000070, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, Temp_struct_Variable) == 0x000088, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, Temp_struct_Variable2) == 0x000090, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000A4, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B0, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, K2Node_Event_ApplicationTag) == 0x0000B4, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000BC, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000C0, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetFireLocation_ReturnValue) == 0x0000C8, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetProjectileInitialValues_outProjectileSpeed) == 0x0000D4, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetProjectileInitialValues_outProjectileSpeed' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetProjectileInitialValues_outSpawnDirection) == 0x0000D8, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetProjectileInitialValues_outSpawnDirection' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetProjectileInitialValues_outProjectileGravity) == 0x0000E4, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetProjectileInitialValues_outProjectileGravity' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetProjectileInitialValues_HomingTarget) == 0x0000E8, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetProjectileInitialValues_HomingTarget' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x0000EC, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_SpawnProjectile_ReturnValue) == 0x000154, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000158, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00015C, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000160, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_GetGameTimeInSeconds_ReturnValue2) == 0x000164, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_GetGameTimeInSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000168, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00016C, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged, CallFunc_BooleanOR_ReturnValue) == 0x00016D, "Member 'GAB_AIBaseRanged_C_ExecuteUbergraph_GAB_AIBaseRanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GAB_AIBaseRanged.GAB_AIBaseRanged_C.K2_TriggerFromAnimation
// 0x0008 (0x0008 - 0x0000)
struct GAB_AIBaseRanged_C_K2_TriggerFromAnimation final
{
public:
	struct FGameplayTag                           ApplicationTag;                                    // 0x0000(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseRanged_C_K2_TriggerFromAnimation) == 0x000004, "Wrong alignment on GAB_AIBaseRanged_C_K2_TriggerFromAnimation");
static_assert(sizeof(GAB_AIBaseRanged_C_K2_TriggerFromAnimation) == 0x000008, "Wrong size on GAB_AIBaseRanged_C_K2_TriggerFromAnimation");
static_assert(offsetof(GAB_AIBaseRanged_C_K2_TriggerFromAnimation, ApplicationTag) == 0x000000, "Member 'GAB_AIBaseRanged_C_K2_TriggerFromAnimation::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseRanged.GAB_AIBaseRanged_C.Triggered_2221E89D4148023005FB94B04BA06EF9
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9) == 0x000004, "Wrong alignment on GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9");
static_assert(sizeof(GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9) == 0x00001C, "Wrong size on GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9");
static_assert(offsetof(GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9, TargetData) == 0x000000, "Member 'GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseRanged_C_Triggered_2221E89D4148023005FB94B04BA06EF9::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseRanged.GAB_AIBaseRanged_C.Cancelled_2221E89D4148023005FB94B04BA06EF9
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9) == 0x000004, "Wrong alignment on GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9");
static_assert(sizeof(GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9) == 0x00001C, "Wrong size on GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9");
static_assert(offsetof(GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9, TargetData) == 0x000000, "Member 'GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseRanged_C_Cancelled_2221E89D4148023005FB94B04BA06EF9::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseRanged.GAB_AIBaseRanged_C.Completed_2221E89D4148023005FB94B04BA06EF9
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9) == 0x000004, "Wrong alignment on GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9");
static_assert(sizeof(GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9) == 0x00001C, "Wrong size on GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9");
static_assert(offsetof(GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9, TargetData) == 0x000000, "Member 'GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseRanged_C_Completed_2221E89D4148023005FB94B04BA06EF9::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
