#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskMelee

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskMelee.GAB_HuskMelee_C.ExecuteUbergraph_GAB_HuskMelee
// 0x0118 (0x0118 - 0x0000)
struct GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0024(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0038(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0040(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0054(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x006C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0074(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0088(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_C*                            K2Node_DynamicCast_AsHusk_Pawn;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_C*                            K2Node_DynamicCast_AsHusk_Pawn2;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_MoveAI*                CallFunc_CreateMoveAITask_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue2;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x00F4(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0108(0x0008)()
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee) == 0x000004, "Wrong alignment on GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee");
static_assert(sizeof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee) == 0x000118, "Wrong size on GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, EntryPoint) == 0x000000, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_TargetData2) == 0x000024, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_ApplicationTag2) == 0x000038, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_TargetData) == 0x000040, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_ApplicationTag) == 0x000054, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate3) == 0x00005C, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, Temp_struct_Variable) == 0x00006C, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, Temp_struct_Variable2) == 0x000074, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000088, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate4) == 0x000094, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate5) == 0x0000A4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CreateDelegate_OutputDelegate6) == 0x0000B4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000C4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_AsHusk_Pawn) == 0x0000C8, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_AsHusk_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_bSuccess) == 0x0000CC, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_GetActivatingPawn_ReturnValue2) == 0x0000D0, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_AsHusk_Pawn2) == 0x0000D4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_AsHusk_Pawn2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_bSuccess2) == 0x0000D8, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000DC, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000E0, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x0000E4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_CreateMoveAITask_ReturnValue) == 0x0000E8, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_CreateMoveAITask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000EC, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_BooleanAND_ReturnValue) == 0x0000ED, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_IsValid_ReturnValue2) == 0x0000EE, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, CallFunc_GetAIAbilityTarget_ReturnValue2) == 0x0000F0, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::CallFunc_GetAIAbilityTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_TargetData3) == 0x0000F4, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_CustomEvent_ApplicationTag3) == 0x000108, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_AsFort_Pawn) == 0x000110, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee, K2Node_DynamicCast_bSuccess3) == 0x000114, "Member 'GAB_HuskMelee_C_ExecuteUbergraph_GAB_HuskMelee::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function GAB_HuskMelee.GAB_HuskMelee_C.Triggered_39FC57D848D381E3A3C7E798E995ED9A
// 0x001C (0x001C - 0x0000)
struct GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A) == 0x000004, "Wrong alignment on GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(sizeof(GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A) == 0x00001C, "Wrong size on GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(offsetof(GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A, TargetData) == 0x000000, "Member 'GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A, ApplicationTag) == 0x000014, "Member 'GAB_HuskMelee_C_Triggered_39FC57D848D381E3A3C7E798E995ED9A::ApplicationTag' has a wrong offset!");

// Function GAB_HuskMelee.GAB_HuskMelee_C.Cancelled_39FC57D848D381E3A3C7E798E995ED9A
// 0x001C (0x001C - 0x0000)
struct GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A) == 0x000004, "Wrong alignment on GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(sizeof(GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A) == 0x00001C, "Wrong size on GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(offsetof(GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A, TargetData) == 0x000000, "Member 'GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A, ApplicationTag) == 0x000014, "Member 'GAB_HuskMelee_C_Cancelled_39FC57D848D381E3A3C7E798E995ED9A::ApplicationTag' has a wrong offset!");

// Function GAB_HuskMelee.GAB_HuskMelee_C.Completed_39FC57D848D381E3A3C7E798E995ED9A
// 0x001C (0x001C - 0x0000)
struct GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A) == 0x000004, "Wrong alignment on GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(sizeof(GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A) == 0x00001C, "Wrong size on GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A");
static_assert(offsetof(GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A, TargetData) == 0x000000, "Member 'GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A, ApplicationTag) == 0x000014, "Member 'GAB_HuskMelee_C_Completed_39FC57D848D381E3A3C7E798E995ED9A::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
