#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskPoisonLobberRanged

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskPoisonLobberRanged.GAB_HuskPoisonLobberRanged_C.ExecuteUbergraph_GAB_HuskPoisonLobberRanged
// 0x0100 (0x0100 - 0x0000)
struct GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0004(0x0064)()
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x0068(0x0008)()
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileSpeed; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetProjectileInitialValues_outSpawnDirection; // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileGravity; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetProjectileInitialValues_HomingTarget;  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2; // 0x0098(0x0064)()
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged) == 0x000004, "Wrong alignment on GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged");
static_assert(sizeof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged) == 0x000100, "Wrong size on GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, EntryPoint) == 0x000000, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000004, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, K2Node_Event_ApplicationTag) == 0x000068, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetActivatingPawn_ReturnValue) == 0x000070, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetFireLocation_ReturnValue) == 0x000074, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetProjectileInitialValues_outProjectileSpeed) == 0x000080, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetProjectileInitialValues_outProjectileSpeed' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetProjectileInitialValues_outSpawnDirection) == 0x000084, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetProjectileInitialValues_outSpawnDirection' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetProjectileInitialValues_outProjectileGravity) == 0x000090, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetProjectileInitialValues_outProjectileGravity' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_GetProjectileInitialValues_HomingTarget) == 0x000094, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_GetProjectileInitialValues_HomingTarget' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2) == 0x000098, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged, CallFunc_SpawnProjectile_ReturnValue) == 0x0000FC, "Member 'GAB_HuskPoisonLobberRanged_C_ExecuteUbergraph_GAB_HuskPoisonLobberRanged::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");

// Function GAB_HuskPoisonLobberRanged.GAB_HuskPoisonLobberRanged_C.K2_TriggerFromAnimation
// 0x0008 (0x0008 - 0x0000)
struct GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation final
{
public:
	struct FGameplayTag                           ApplicationTag;                                    // 0x0000(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation) == 0x000004, "Wrong alignment on GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation");
static_assert(sizeof(GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation) == 0x000008, "Wrong size on GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation");
static_assert(offsetof(GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation, ApplicationTag) == 0x000000, "Member 'GAB_HuskPoisonLobberRanged_C_K2_TriggerFromAnimation::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
