#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerThrowHusk

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C.ExecuteUbergraph_GAB_FlingerThrowHusk
// 0x01B8 (0x01B8 - 0x0000)
struct GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAIEncounterInfo*                   CallFunc_GetEncounterInfo_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0018(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x002C(0x0008)()
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x003C(0x0014)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            CallFunc_SpawnAIPawnReservedForEnemySpawner_ReturnValue; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_C*                            K2Node_DynamicCast_AsHusk_Pawn;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileSpeed; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetProjectileInitialValues_outSpawnDirection; // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileGravity; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetProjectileInitialValues_HomingTarget;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFlingerPawn_C*                         K2Node_DynamicCast_AsFlinger_Pawn;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x00D4(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00E8(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFireLocation_ReturnValue2;             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0110(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0194(0x0004)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x0198(0x0004)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x019C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x01B0(0x0008)()
};
static_assert(alignof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk) == 0x000004, "Wrong alignment on GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk");
static_assert(sizeof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk) == 0x0001B8, "Wrong size on GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, EntryPoint) == 0x000000, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetEncounterInfo_ReturnValue) == 0x000004, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetEncounterInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_TargetData) == 0x000018, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_ApplicationTag) == 0x00002C, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, Temp_struct_Variable) == 0x000034, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, Temp_struct_Variable2) == 0x00003C, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_CommitAbility_ReturnValue) == 0x000060, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetActivatingPawn_ReturnValue) == 0x000064, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetFireLocation_ReturnValue) == 0x000068, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000074, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue) == 0x000080, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_SpawnAIPawnReservedForEnemySpawner_ReturnValue) == 0x000084, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_SpawnAIPawnReservedForEnemySpawner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_DynamicCast_AsHusk_Pawn) == 0x000088, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_DynamicCast_AsHusk_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_DynamicCast_bSuccess) == 0x00008C, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000090, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetProjectileInitialValues_outProjectileSpeed) == 0x000094, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetProjectileInitialValues_outProjectileSpeed' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetProjectileInitialValues_outSpawnDirection) == 0x000098, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetProjectileInitialValues_outSpawnDirection' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetProjectileInitialValues_outProjectileGravity) == 0x0000A4, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetProjectileInitialValues_outProjectileGravity' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetProjectileInitialValues_HomingTarget) == 0x0000A8, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetProjectileInitialValues_HomingTarget' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000AC, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetActivatingPawn_ReturnValue2) == 0x0000C8, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_DynamicCast_AsFlinger_Pawn) == 0x0000CC, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_DynamicCast_AsFlinger_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_TargetData2) == 0x0000D4, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_ApplicationTag2) == 0x0000E8, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_IsValid_ReturnValue2) == 0x000100, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_IsValid_ReturnValue3) == 0x000101, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_GetFireLocation_ReturnValue2) == 0x000104, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_GetFireLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000110, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000190, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_SetTimer_ReturnValue) == 0x000194, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, CallFunc_K2_SetTimer_ReturnValue2) == 0x000198, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_TargetData3) == 0x00019C, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk, K2Node_CustomEvent_ApplicationTag3) == 0x0001B0, "Member 'GAB_FlingerThrowHusk_C_ExecuteUbergraph_GAB_FlingerThrowHusk::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");

// Function GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C.Triggered_B56594C44CE933A96A3E13BDCFC1097D
// 0x001C (0x001C - 0x0000)
struct GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D) == 0x000004, "Wrong alignment on GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(sizeof(GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D) == 0x00001C, "Wrong size on GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D, TargetData) == 0x000000, "Member 'GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D, ApplicationTag) == 0x000014, "Member 'GAB_FlingerThrowHusk_C_Triggered_B56594C44CE933A96A3E13BDCFC1097D::ApplicationTag' has a wrong offset!");

// Function GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C.Cancelled_B56594C44CE933A96A3E13BDCFC1097D
// 0x001C (0x001C - 0x0000)
struct GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D) == 0x000004, "Wrong alignment on GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(sizeof(GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D) == 0x00001C, "Wrong size on GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D, TargetData) == 0x000000, "Member 'GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D, ApplicationTag) == 0x000014, "Member 'GAB_FlingerThrowHusk_C_Cancelled_B56594C44CE933A96A3E13BDCFC1097D::ApplicationTag' has a wrong offset!");

// Function GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C.Completed_B56594C44CE933A96A3E13BDCFC1097D
// 0x001C (0x001C - 0x0000)
struct GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D) == 0x000004, "Wrong alignment on GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(sizeof(GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D) == 0x00001C, "Wrong size on GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D, TargetData) == 0x000000, "Member 'GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D, ApplicationTag) == 0x000014, "Member 'GAB_FlingerThrowHusk_C_Completed_B56594C44CE933A96A3E13BDCFC1097D::ApplicationTag' has a wrong offset!");

// Function GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C.K2_CanActivateAbility
// 0x0064 (0x0064 - 0x0000)
struct GAB_FlingerThrowHusk_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0034(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAIEncounterInfo*                   CallFunc_GetEncounterInfo_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanActivate;                                       // 0x0063(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility) == 0x000004, "Wrong alignment on GAB_FlingerThrowHusk_C_K2_CanActivateAbility");
static_assert(sizeof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility) == 0x000064, "Wrong size on GAB_FlingerThrowHusk_C_K2_CanActivateAbility");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, RelevantTags) == 0x000034, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, ReturnValue) == 0x00004C, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CallFunc_GetActivatingPawn_ReturnValue) == 0x000050, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_AIPawn) == 0x000054, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CallFunc_GetEncounterInfo_ReturnValue) == 0x00005C, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CallFunc_GetEncounterInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue) == 0x000060, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CallFunc_EncounterHasReservedSpawnRequestForEnemySpawner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerThrowHusk_C_K2_CanActivateAbility, CanActivate) == 0x000063, "Member 'GAB_FlingerThrowHusk_C_K2_CanActivateAbility::CanActivate' has a wrong offset!");

}

#pragma pack(pop)
