#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericDeath

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_GenericDeath.GAB_GenericDeath_C.ExecuteUbergraph_GAB_GenericDeath
// 0x00A4 (0x00A4 - 0x0000)
struct GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0024(0x0058)(ConstParm)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_SetFNameBasedOnHitDirection_NameResult;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath) == 0x000004, "Wrong alignment on GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath");
static_assert(sizeof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath) == 0x0000A4, "Wrong size on GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, EntryPoint) == 0x000000, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_Event_EventData) == 0x000024, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x00007C, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetActivatingPawn_ReturnValue) == 0x000084, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_SetFNameBasedOnHitDirection_NameResult) == 0x000088, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_SetFNameBasedOnHitDirection_NameResult' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetActivatingPawn_ReturnValue2) == 0x000090, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate3) == 0x000094, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GAB_GenericDeath_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GAB_GenericDeath_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GAB_GenericDeath_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_GenericDeath_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.InitializeDeathHitDirection
// 0x00F8 (0x00F8 - 0x0000)
struct GAB_GenericDeath_C_InitializeDeathHitDirection final
{
public:
	struct FGameplayEventData                     EventHitData;                                      // 0x0000(0x0058)(Parm)
	struct FVector                                CallFunc_GetImpulseData_ImpulseDirection;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetImpulseData_KnockbackMagnitude;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetImpulseData_KnockbackZAngle;           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x006C(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericDeath_C_InitializeDeathHitDirection) == 0x000004, "Wrong alignment on GAB_GenericDeath_C_InitializeDeathHitDirection");
static_assert(sizeof(GAB_GenericDeath_C_InitializeDeathHitDirection) == 0x0000F8, "Wrong size on GAB_GenericDeath_C_InitializeDeathHitDirection");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, EventHitData) == 0x000000, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::EventHitData' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_ImpulseDirection) == 0x000058, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_ImpulseDirection' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_KnockbackMagnitude) == 0x000064, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_KnockbackMagnitude' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_KnockbackZAngle) == 0x000068, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_KnockbackZAngle' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x00006C, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000EC, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
