#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskDeath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskDeath.GAB_HuskDeath_C.ExecuteUbergraph_GAB_HuskDeath
// 0x0090 (0x0090 - 0x0000)
struct GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDamageZone                               CallFunc_GetDamageZone_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue2;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_SetFNameBasedOnHitDirection_NameResult;   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerHaveTag_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath) == 0x000004, "Wrong alignment on GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath");
static_assert(sizeof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath) == 0x000090, "Wrong size on GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, EntryPoint) == 0x000000, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_GetActivatingPawn_ReturnValue) == 0x000004, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, K2Node_DynamicCast_AsFort_AIPawn) == 0x000008, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_bBlockingHit) == 0x00000D, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_bInitialOverlap) == 0x00000E, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_Time) == 0x000010, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_Location) == 0x000014, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_ImpactPoint) == 0x000020, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_Normal) == 0x00002C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_ImpactNormal) == 0x000038, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_PhysMat) == 0x000044, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_HitActor) == 0x000048, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_HitComponent) == 0x00004C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_HitBoneName) == 0x000050, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_HitItem) == 0x000058, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_TraceStart) == 0x00005C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_BreakHitResult_TraceEnd) == 0x000068, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_Percent_IntInt_ReturnValue) == 0x000074, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_GetDamageZone_ReturnValue) == 0x000078, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_GetDamageZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, K2Node_SwitchInteger_CmpSuccess) == 0x000079, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_Percent_IntInt_ReturnValue2) == 0x00007C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_Percent_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, K2Node_SwitchInteger2_CmpSuccess) == 0x000080, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_SetFNameBasedOnHitDirection_NameResult) == 0x000084, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_SetFNameBasedOnHitDirection_NameResult' has a wrong offset!");
static_assert(offsetof(GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath, CallFunc_DoesContainerHaveTag_ReturnValue) == 0x00008C, "Member 'GAB_HuskDeath_C_ExecuteUbergraph_GAB_HuskDeath::CallFunc_DoesContainerHaveTag_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
