#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FlingerRoar

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_FlingerRoar.GAB_FlingerRoar_C.ExecuteUbergraph_GAB_FlingerRoar
// 0x003C (0x003C - 0x0000)
struct GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar) == 0x000004, "Wrong alignment on GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar");
static_assert(sizeof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar) == 0x00003C, "Wrong size on GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, EntryPoint) == 0x000000, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, K2Node_CreateDelegate_OutputDelegate3) == 0x000024, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000034, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar, CallFunc_K2_CommitAbility_ReturnValue) == 0x000039, "Member 'GAB_FlingerRoar_C_ExecuteUbergraph_GAB_FlingerRoar::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
