#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericApplyPush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GAB_GenericApplyPush.GAB_GenericApplyPush_C
// 0x0010 (0x06EC - 0x06DC)
class UGAB_GenericApplyPush_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           PushedMontage;                                     // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           PushAsideTag;                                      // 0x06E4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAB_GenericApplyPush(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void EventReceived_7764EAC14FD514E952F78BA2A0CF9ABE(const struct FGameplayEventData& Payload);
	void OnComplete_569FFD0446FBE214B15C2B8019481F5F();
	void OnInterrupted_569FFD0446FBE214B15C2B8019481F5F();
	void OnCancelled_569FFD0446FBE214B15C2B8019481F5F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_GenericApplyPush_C">();
	}
	static class UGAB_GenericApplyPush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_GenericApplyPush_C>();
	}
};
static_assert(alignof(UGAB_GenericApplyPush_C) == 0x000004, "Wrong alignment on UGAB_GenericApplyPush_C");
static_assert(sizeof(UGAB_GenericApplyPush_C) == 0x0006EC, "Wrong size on UGAB_GenericApplyPush_C");
static_assert(offsetof(UGAB_GenericApplyPush_C, UberGraphFrame) == 0x0006DC, "Member 'UGAB_GenericApplyPush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyPush_C, PushedMontage) == 0x0006E0, "Member 'UGAB_GenericApplyPush_C::PushedMontage' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyPush_C, PushAsideTag) == 0x0006E4, "Member 'UGAB_GenericApplyPush_C::PushAsideTag' has a wrong offset!");

}

#pragma pack(pop)
