#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GadgetSelectBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass GadgetSelectBar.GadgetSelectBar_C
// 0x0028 (0x026C - 0x0244)
class UGadgetSelectBar_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGadgetSelectButton_C*                  GadgetItem1;                                       // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGadgetSelectButton_C*                  GadgetItem2;                                       // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UFortWorldItem*>                 GadgetList;                                        // 0x0254(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortWorldItem*>                 SlottedGadgets;                                    // 0x0260(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GadgetSelectBar(int32 EntryPoint);
	void HandleHomebaseInventoryUpdated();
	void HandleLobbyStarted();
	void HandleAccountInfoChanged(const struct FFortPrivateAccountInfo& NewInfo);
	void BndEvt__GadgetItem1_K2Node_ComponentBoundEvent_960_GadgetSelected__DelegateSignature(class UFortWorldItem* Gadget);
	void BndEvt__GadgetItem2_K2Node_ComponentBoundEvent_957_GadgetSelected__DelegateSignature(class UFortWorldItem* Gadget);
	void Construct();
	void Init();
	void InitBar();
	void InitGadget(class UGadgetSelectButton_C* Item_Widget, int32 Slot_Index);
	void SelectGadget(class UFortWorldItem* Item, int32 Slot_0);
	void BindDelegates();
	void SetShown(bool bShown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GadgetSelectBar_C">();
	}
	static class UGadgetSelectBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGadgetSelectBar_C>();
	}
};
static_assert(alignof(UGadgetSelectBar_C) == 0x000004, "Wrong alignment on UGadgetSelectBar_C");
static_assert(sizeof(UGadgetSelectBar_C) == 0x00026C, "Wrong size on UGadgetSelectBar_C");
static_assert(offsetof(UGadgetSelectBar_C, UberGraphFrame) == 0x000244, "Member 'UGadgetSelectBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGadgetSelectBar_C, Border) == 0x000248, "Member 'UGadgetSelectBar_C::Border' has a wrong offset!");
static_assert(offsetof(UGadgetSelectBar_C, GadgetItem1) == 0x00024C, "Member 'UGadgetSelectBar_C::GadgetItem1' has a wrong offset!");
static_assert(offsetof(UGadgetSelectBar_C, GadgetItem2) == 0x000250, "Member 'UGadgetSelectBar_C::GadgetItem2' has a wrong offset!");
static_assert(offsetof(UGadgetSelectBar_C, GadgetList) == 0x000254, "Member 'UGadgetSelectBar_C::GadgetList' has a wrong offset!");
static_assert(offsetof(UGadgetSelectBar_C, SlottedGadgets) == 0x000260, "Member 'UGadgetSelectBar_C::SlottedGadgets' has a wrong offset!");

}

#pragma pack(pop)
