#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GadgetDisplayItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass GadgetDisplayItem.GadgetDisplayItem_C
// 0x000C (0x01C4 - 0x01B8)
class UGadgetDisplayItem_C final : public UUserWidget
{
public:
	class UWidgetSwitcher*                        ContentSwitcher;                                   // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_232;                                         // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UItem_C*                                Item;                                              // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void SetGadgetItemData(class UFortItem* GadgetItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GadgetDisplayItem_C">();
	}
	static class UGadgetDisplayItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGadgetDisplayItem_C>();
	}
};
static_assert(alignof(UGadgetDisplayItem_C) == 0x000004, "Wrong alignment on UGadgetDisplayItem_C");
static_assert(sizeof(UGadgetDisplayItem_C) == 0x0001C4, "Wrong size on UGadgetDisplayItem_C");
static_assert(offsetof(UGadgetDisplayItem_C, ContentSwitcher) == 0x0001B8, "Member 'UGadgetDisplayItem_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayItem_C, Image_232) == 0x0001BC, "Member 'UGadgetDisplayItem_C::Image_232' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayItem_C, Item) == 0x0001C0, "Member 'UGadgetDisplayItem_C::Item' has a wrong offset!");

}

#pragma pack(pop)
