#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GadgetDisplayBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass GadgetDisplayBar.GadgetDisplayBar_C
// 0x002C (0x0270 - 0x0244)
class UGadgetDisplayBar_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             _Text__PlayerName;                                 // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                Border;                                            // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGadgetDisplayItem_C*                   Gadget1;                                           // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGadgetDisplayItem_C*                   Gadget2;                                           // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class URatingWidget_C*                        Rating;                                            // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	int32                                         PlayerIndex;                                       // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortTeam                                     Team;                                              // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          TrackLocalPlayerTeam;                              // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSelectableGadgets;                              // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APartyCharacterPlacementHelper_C*       PartyPlacementActor;                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowable;                                         // 0x026C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GadgetDisplayBar(int32 EntryPoint);
	void OnTeamMemberRemoved(int32 PlayerIndex_0);
	void OnTeamMemberUpdated(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void OnTeamMemberAdded(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void Update(const struct FFortTeamMemberInfo& InMemberInfo);
	void BindDelegates();
	void HandleTeamMemberUpdated(struct FFortTeamMemberInfo& InNewMemberInfo);
	void RemoveAssignedTeamMember();
	void BindTeamDelegates(class UFortUITeamInfo* TeamInfo);
	void HandlePartyLeft();
	void SetPlayerIndex(int32 InPlayerIndex);
	void SetShown(bool bShown);
	void UpdateAssignedTeamMember();
	void UpdateVisibility();
	void HandledTeamMemberAdded(struct FFortTeamMemberInfo& InNewMemberInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GadgetDisplayBar_C">();
	}
	static class UGadgetDisplayBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGadgetDisplayBar_C>();
	}
};
static_assert(alignof(UGadgetDisplayBar_C) == 0x000004, "Wrong alignment on UGadgetDisplayBar_C");
static_assert(sizeof(UGadgetDisplayBar_C) == 0x000270, "Wrong size on UGadgetDisplayBar_C");
static_assert(offsetof(UGadgetDisplayBar_C, UberGraphFrame) == 0x000244, "Member 'UGadgetDisplayBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, _Text__PlayerName) == 0x000248, "Member 'UGadgetDisplayBar_C::_Text__PlayerName' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, Border) == 0x00024C, "Member 'UGadgetDisplayBar_C::Border' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, Gadget1) == 0x000250, "Member 'UGadgetDisplayBar_C::Gadget1' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, Gadget2) == 0x000254, "Member 'UGadgetDisplayBar_C::Gadget2' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, Rating) == 0x000258, "Member 'UGadgetDisplayBar_C::Rating' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, PlayerIndex) == 0x00025C, "Member 'UGadgetDisplayBar_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, Team) == 0x000260, "Member 'UGadgetDisplayBar_C::Team' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, TrackLocalPlayerTeam) == 0x000261, "Member 'UGadgetDisplayBar_C::TrackLocalPlayerTeam' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, MaxSelectableGadgets) == 0x000264, "Member 'UGadgetDisplayBar_C::MaxSelectableGadgets' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, PartyPlacementActor) == 0x000268, "Member 'UGadgetDisplayBar_C::PartyPlacementActor' has a wrong offset!");
static_assert(offsetof(UGadgetDisplayBar_C, bShowable) == 0x00026C, "Member 'UGadgetDisplayBar_C::bShowable' has a wrong offset!");

}

#pragma pack(pop)
