#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayAbilities

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GameplayAbilities.AbilityTask_WaitGameplayEffectRemoved.WaitForGameplayEffectRemoved
// 0x000C (0x000C - 0x0000)
struct AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            Handle;                                            // 0x0004(0x0004)(Parm, NativeAccessSpecifierPublic)
	class UAbilityTask_WaitGameplayEffectRemoved* ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved) == 0x000004, "Wrong alignment on AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved");
static_assert(sizeof(AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved) == 0x00000C, "Wrong size on AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved");
static_assert(offsetof(AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved, WorldContextObject) == 0x000000, "Member 'AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved, Handle) == 0x000004, "Member 'AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved::Handle' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved, ReturnValue) == 0x000008, "Member 'AbilityTask_WaitGameplayEffectRemoved_WaitForGameplayEffectRemoved::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.GameplayCueNotify_Static.K2_HandleGameplayCue
// 0x008C (0x008C - 0x0000)
struct GameplayCueNotify_Static_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayCueEvent                             EventType;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x0084)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayCueNotify_Static_K2_HandleGameplayCue) == 0x000004, "Wrong alignment on GameplayCueNotify_Static_K2_HandleGameplayCue");
static_assert(sizeof(GameplayCueNotify_Static_K2_HandleGameplayCue) == 0x00008C, "Wrong size on GameplayCueNotify_Static_K2_HandleGameplayCue");
static_assert(offsetof(GameplayCueNotify_Static_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GameplayCueNotify_Static_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_K2_HandleGameplayCue, EventType) == 0x000004, "Member 'GameplayCueNotify_Static_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_K2_HandleGameplayCue, Parameters) == 0x000008, "Member 'GameplayCueNotify_Static_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GameplayAbilities.GameplayCueNotify_Static.OnActive
// 0x008C (0x008C - 0x0000)
struct GameplayCueNotify_Static_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayCueNotify_Static_OnActive) == 0x000004, "Wrong alignment on GameplayCueNotify_Static_OnActive");
static_assert(sizeof(GameplayCueNotify_Static_OnActive) == 0x00008C, "Wrong size on GameplayCueNotify_Static_OnActive");
static_assert(offsetof(GameplayCueNotify_Static_OnActive, MyTarget) == 0x000000, "Member 'GameplayCueNotify_Static_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnActive, Parameters) == 0x000004, "Member 'GameplayCueNotify_Static_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnActive, ReturnValue) == 0x000088, "Member 'GameplayCueNotify_Static_OnActive::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.GameplayCueNotify_Static.OnExecute
// 0x008C (0x008C - 0x0000)
struct GameplayCueNotify_Static_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayCueNotify_Static_OnExecute) == 0x000004, "Wrong alignment on GameplayCueNotify_Static_OnExecute");
static_assert(sizeof(GameplayCueNotify_Static_OnExecute) == 0x00008C, "Wrong size on GameplayCueNotify_Static_OnExecute");
static_assert(offsetof(GameplayCueNotify_Static_OnExecute, MyTarget) == 0x000000, "Member 'GameplayCueNotify_Static_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnExecute, Parameters) == 0x000004, "Member 'GameplayCueNotify_Static_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnExecute, ReturnValue) == 0x000088, "Member 'GameplayCueNotify_Static_OnExecute::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.GameplayCueNotify_Static.OnRemove
// 0x008C (0x008C - 0x0000)
struct GameplayCueNotify_Static_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayCueNotify_Static_OnRemove) == 0x000004, "Wrong alignment on GameplayCueNotify_Static_OnRemove");
static_assert(sizeof(GameplayCueNotify_Static_OnRemove) == 0x00008C, "Wrong size on GameplayCueNotify_Static_OnRemove");
static_assert(offsetof(GameplayCueNotify_Static_OnRemove, MyTarget) == 0x000000, "Member 'GameplayCueNotify_Static_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnRemove, Parameters) == 0x000004, "Member 'GameplayCueNotify_Static_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_OnRemove, ReturnValue) == 0x000088, "Member 'GameplayCueNotify_Static_OnRemove::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.GameplayCueNotify_Static.WhileActive
// 0x008C (0x008C - 0x0000)
struct GameplayCueNotify_Static_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayCueNotify_Static_WhileActive) == 0x000004, "Wrong alignment on GameplayCueNotify_Static_WhileActive");
static_assert(sizeof(GameplayCueNotify_Static_WhileActive) == 0x00008C, "Wrong size on GameplayCueNotify_Static_WhileActive");
static_assert(offsetof(GameplayCueNotify_Static_WhileActive, MyTarget) == 0x000000, "Member 'GameplayCueNotify_Static_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_WhileActive, Parameters) == 0x000004, "Member 'GameplayCueNotify_Static_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GameplayCueNotify_Static_WhileActive, ReturnValue) == 0x000088, "Member 'GameplayCueNotify_Static_WhileActive::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilityTask_WaitAttributeChange.WaitForAttributeChange
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_WaitAttributeChange_WaitForAttributeChange final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0004(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           WithSrcTag;                                        // 0x0008(0x0008)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           WithoutSrcTag;                                     // 0x0010(0x0008)(Parm, NativeAccessSpecifierPublic)
	bool                                          TriggerOnce;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_WaitAttributeChange_WaitForAttributeChange) == 0x000004, "Wrong alignment on AbilityTask_WaitAttributeChange_WaitForAttributeChange");
static_assert(sizeof(AbilityTask_WaitAttributeChange_WaitForAttributeChange) == 0x000020, "Wrong size on AbilityTask_WaitAttributeChange_WaitForAttributeChange");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, WorldContextObject) == 0x000000, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, Attribute) == 0x000004, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::Attribute' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, WithSrcTag) == 0x000008, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::WithSrcTag' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, WithoutSrcTag) == 0x000010, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::WithoutSrcTag' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, TriggerOnce) == 0x000018, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::TriggerOnce' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChange, ReturnValue) == 0x00001C, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChange::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilityTask_WaitAttributeChange.WaitForAttributeChangeWithComparison
// 0x0028 (0x0028 - 0x0000)
struct AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     InAttribute;                                       // 0x0004(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InWithTag;                                         // 0x0008(0x0008)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InWithoutTag;                                      // 0x0010(0x0008)(Parm, NativeAccessSpecifierPublic)
	EWaitAttributeChangeComparison                InComparisonType;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InComparisonValue;                                 // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TriggerOnce;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison) == 0x000004, "Wrong alignment on AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison");
static_assert(sizeof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison) == 0x000028, "Wrong size on AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, WorldContextObject) == 0x000000, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, InAttribute) == 0x000004, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::InAttribute' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, InWithTag) == 0x000008, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::InWithTag' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, InWithoutTag) == 0x000010, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::InWithoutTag' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, InComparisonType) == 0x000018, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::InComparisonType' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, InComparisonValue) == 0x00001C, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::InComparisonValue' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, TriggerOnce) == 0x000020, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::TriggerOnce' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison, ReturnValue) == 0x000024, "Member 'AbilityTask_WaitAttributeChange_WaitForAttributeChangeWithComparison::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilityTask_SpawnActor.SpawnActor
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_SpawnActor_SpawnActor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0004(0x0014)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     Class_0;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_SpawnActor*                ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_SpawnActor_SpawnActor) == 0x000004, "Wrong alignment on AbilityTask_SpawnActor_SpawnActor");
static_assert(sizeof(AbilityTask_SpawnActor_SpawnActor) == 0x000020, "Wrong size on AbilityTask_SpawnActor_SpawnActor");
static_assert(offsetof(AbilityTask_SpawnActor_SpawnActor, WorldContextObject) == 0x000000, "Member 'AbilityTask_SpawnActor_SpawnActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_SpawnActor, TargetData) == 0x000004, "Member 'AbilityTask_SpawnActor_SpawnActor::TargetData' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_SpawnActor, Class_0) == 0x000018, "Member 'AbilityTask_SpawnActor_SpawnActor::Class_0' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_SpawnActor, ReturnValue) == 0x00001C, "Member 'AbilityTask_SpawnActor_SpawnActor::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilityTask_SpawnActor.BeginSpawningActor
// 0x0024 (0x0024 - 0x0000)
struct AbilityTask_SpawnActor_BeginSpawningActor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0004(0x0014)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     Class_0;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SpawnedActor;                                      // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AbilityTask_SpawnActor_BeginSpawningActor) == 0x000004, "Wrong alignment on AbilityTask_SpawnActor_BeginSpawningActor");
static_assert(sizeof(AbilityTask_SpawnActor_BeginSpawningActor) == 0x000024, "Wrong size on AbilityTask_SpawnActor_BeginSpawningActor");
static_assert(offsetof(AbilityTask_SpawnActor_BeginSpawningActor, WorldContextObject) == 0x000000, "Member 'AbilityTask_SpawnActor_BeginSpawningActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_BeginSpawningActor, TargetData) == 0x000004, "Member 'AbilityTask_SpawnActor_BeginSpawningActor::TargetData' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_BeginSpawningActor, Class_0) == 0x000018, "Member 'AbilityTask_SpawnActor_BeginSpawningActor::Class_0' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_BeginSpawningActor, SpawnedActor) == 0x00001C, "Member 'AbilityTask_SpawnActor_BeginSpawningActor::SpawnedActor' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_BeginSpawningActor, ReturnValue) == 0x000020, "Member 'AbilityTask_SpawnActor_BeginSpawningActor::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilityTask_SpawnActor.FinishSpawningActor
// 0x001C (0x001C - 0x0000)
struct AbilityTask_SpawnActor_FinishSpawningActor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0004(0x0014)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 SpawnedActor;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_SpawnActor_FinishSpawningActor) == 0x000004, "Wrong alignment on AbilityTask_SpawnActor_FinishSpawningActor");
static_assert(sizeof(AbilityTask_SpawnActor_FinishSpawningActor) == 0x00001C, "Wrong size on AbilityTask_SpawnActor_FinishSpawningActor");
static_assert(offsetof(AbilityTask_SpawnActor_FinishSpawningActor, WorldContextObject) == 0x000000, "Member 'AbilityTask_SpawnActor_FinishSpawningActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_FinishSpawningActor, TargetData) == 0x000004, "Member 'AbilityTask_SpawnActor_FinishSpawningActor::TargetData' has a wrong offset!");
static_assert(offsetof(AbilityTask_SpawnActor_FinishSpawningActor, SpawnedActor) == 0x000018, "Member 'AbilityTask_SpawnActor_FinishSpawningActor::SpawnedActor' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.BP_ApplyGameplayEffectSpecToSelf
// 0x0010 (0x0010 - 0x0000)
struct AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf final
{
public:
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0000(0x000C)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf) == 0x000004, "Wrong alignment on AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf");
static_assert(sizeof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf) == 0x000010, "Wrong size on AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf, SpecHandle) == 0x000000, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf::SpecHandle' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf, ReturnValue) == 0x00000C, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelf::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.BP_ApplyGameplayEffectSpecToTarget
// 0x0014 (0x0014 - 0x0000)
struct AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget final
{
public:
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0000(0x000C)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                Target;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget) == 0x000004, "Wrong alignment on AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget");
static_assert(sizeof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget) == 0x000014, "Wrong size on AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget, SpecHandle) == 0x000000, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget::SpecHandle' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget, Target) == 0x00000C, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget::Target' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget, ReturnValue) == 0x000010, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectSpecToTarget::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.BP_ApplyGameplayEffectToSelf
// 0x0018 (0x0018 - 0x0000)
struct AbilitySystemComponent_BP_ApplyGameplayEffectToSelf final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf) == 0x000004, "Wrong alignment on AbilitySystemComponent_BP_ApplyGameplayEffectToSelf");
static_assert(sizeof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf) == 0x000018, "Wrong size on AbilitySystemComponent_BP_ApplyGameplayEffectToSelf");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf, GameplayEffectClass) == 0x000000, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToSelf::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf, Level) == 0x000004, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToSelf::Level' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf, EffectContext) == 0x000008, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToSelf::EffectContext' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToSelf, ReturnValue) == 0x000014, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToSelf::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.BP_ApplyGameplayEffectToTarget
// 0x001C (0x001C - 0x0000)
struct AbilitySystemComponent_BP_ApplyGameplayEffectToTarget final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                Target;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           Context;                                           // 0x000C(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget) == 0x000004, "Wrong alignment on AbilitySystemComponent_BP_ApplyGameplayEffectToTarget");
static_assert(sizeof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget) == 0x00001C, "Wrong size on AbilitySystemComponent_BP_ApplyGameplayEffectToTarget");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget, GameplayEffectClass) == 0x000000, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToTarget::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget, Target) == 0x000004, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToTarget::Target' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget, Level) == 0x000008, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToTarget::Level' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget, Context) == 0x00000C, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToTarget::Context' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_BP_ApplyGameplayEffectToTarget, ReturnValue) == 0x000018, "Member 'AbilitySystemComponent_BP_ApplyGameplayEffectToTarget::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientActivateAbilityFailed
// 0x0008 (0x0008 - 0x0000)
struct AbilitySystemComponent_ClientActivateAbilityFailed final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToActivate;                                 // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
	int16                                         PredictionKey;                                     // 0x0004(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AbilitySystemComponent_ClientActivateAbilityFailed) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientActivateAbilityFailed");
static_assert(sizeof(AbilitySystemComponent_ClientActivateAbilityFailed) == 0x000008, "Wrong size on AbilitySystemComponent_ClientActivateAbilityFailed");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilityFailed, AbilityToActivate) == 0x000000, "Member 'AbilitySystemComponent_ClientActivateAbilityFailed::AbilityToActivate' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilityFailed, PredictionKey) == 0x000004, "Member 'AbilitySystemComponent_ClientActivateAbilityFailed::PredictionKey' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientActivateAbilitySucceed
// 0x0010 (0x0010 - 0x0000)
struct AbilitySystemComponent_ClientActivateAbilitySucceed final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToActivate;                                 // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0004(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientActivateAbilitySucceed) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientActivateAbilitySucceed");
static_assert(sizeof(AbilitySystemComponent_ClientActivateAbilitySucceed) == 0x000010, "Wrong size on AbilitySystemComponent_ClientActivateAbilitySucceed");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilitySucceed, AbilityToActivate) == 0x000000, "Member 'AbilitySystemComponent_ClientActivateAbilitySucceed::AbilityToActivate' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilitySucceed, PredictionKey) == 0x000004, "Member 'AbilitySystemComponent_ClientActivateAbilitySucceed::PredictionKey' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientActivateAbilitySucceedWithEventData
// 0x0068 (0x0068 - 0x0000)
struct AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToActivate;                                 // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0004(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     TriggerEventData;                                  // 0x0010(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData");
static_assert(sizeof(AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData) == 0x000068, "Wrong size on AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData, AbilityToActivate) == 0x000000, "Member 'AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData::AbilityToActivate' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData, PredictionKey) == 0x000004, "Member 'AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData::PredictionKey' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData, TriggerEventData) == 0x000010, "Member 'AbilitySystemComponent_ClientActivateAbilitySucceedWithEventData::TriggerEventData' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientCancelAbility
// 0x0014 (0x0014 - 0x0000)
struct AbilitySystemComponent_ClientCancelAbility final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToCancel;                                   // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0004(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientCancelAbility) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientCancelAbility");
static_assert(sizeof(AbilitySystemComponent_ClientCancelAbility) == 0x000014, "Wrong size on AbilitySystemComponent_ClientCancelAbility");
static_assert(offsetof(AbilitySystemComponent_ClientCancelAbility, AbilityToCancel) == 0x000000, "Member 'AbilitySystemComponent_ClientCancelAbility::AbilityToCancel' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientCancelAbility, ActivationInfo) == 0x000004, "Member 'AbilitySystemComponent_ClientCancelAbility::ActivationInfo' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientEndAbility
// 0x0014 (0x0014 - 0x0000)
struct AbilitySystemComponent_ClientEndAbility final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToEnd;                                      // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0004(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientEndAbility) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientEndAbility");
static_assert(sizeof(AbilitySystemComponent_ClientEndAbility) == 0x000014, "Wrong size on AbilitySystemComponent_ClientEndAbility");
static_assert(offsetof(AbilitySystemComponent_ClientEndAbility, AbilityToEnd) == 0x000000, "Member 'AbilitySystemComponent_ClientEndAbility::AbilityToEnd' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientEndAbility, ActivationInfo) == 0x000004, "Member 'AbilitySystemComponent_ClientEndAbility::ActivationInfo' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientPrintDebug_Response
// 0x000C (0x000C - 0x0000)
struct AbilitySystemComponent_ClientPrintDebug_Response final
{
public:
	TArray<class FString>                         Strings;                                           // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientPrintDebug_Response) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientPrintDebug_Response");
static_assert(sizeof(AbilitySystemComponent_ClientPrintDebug_Response) == 0x00000C, "Wrong size on AbilitySystemComponent_ClientPrintDebug_Response");
static_assert(offsetof(AbilitySystemComponent_ClientPrintDebug_Response, Strings) == 0x000000, "Member 'AbilitySystemComponent_ClientPrintDebug_Response::Strings' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientSetReplicatedEvent
// 0x0014 (0x0014 - 0x0000)
struct AbilitySystemComponent_ClientSetReplicatedEvent final
{
public:
	EAbilityGenericReplicatedEvent                EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0004(0x0004)(Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         AbilityOriginalPredictionKey;                      // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientSetReplicatedEvent) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientSetReplicatedEvent");
static_assert(sizeof(AbilitySystemComponent_ClientSetReplicatedEvent) == 0x000014, "Wrong size on AbilitySystemComponent_ClientSetReplicatedEvent");
static_assert(offsetof(AbilitySystemComponent_ClientSetReplicatedEvent, EventType) == 0x000000, "Member 'AbilitySystemComponent_ClientSetReplicatedEvent::EventType' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientSetReplicatedEvent, AbilityHandle) == 0x000004, "Member 'AbilitySystemComponent_ClientSetReplicatedEvent::AbilityHandle' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_ClientSetReplicatedEvent, AbilityOriginalPredictionKey) == 0x000008, "Member 'AbilitySystemComponent_ClientSetReplicatedEvent::AbilityOriginalPredictionKey' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.ClientTryActivateAbility
// 0x0004 (0x0004 - 0x0000)
struct AbilitySystemComponent_ClientTryActivateAbility final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityToActivate;                                 // 0x0000(0x0004)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_ClientTryActivateAbility) == 0x000004, "Wrong alignment on AbilitySystemComponent_ClientTryActivateAbility");
static_assert(sizeof(AbilitySystemComponent_ClientTryActivateAbility) == 0x000004, "Wrong size on AbilitySystemComponent_ClientTryActivateAbility");
static_assert(offsetof(AbilitySystemComponent_ClientTryActivateAbility, AbilityToActivate) == 0x000000, "Member 'AbilitySystemComponent_ClientTryActivateAbility::AbilityToActivate' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.GetGameplayEffectCount
// 0x0010 (0x0010 - 0x0000)
struct AbilitySystemComponent_GetGameplayEffectCount final
{
public:
	TSubclassOf<class UGameplayEffect>            SourceGameplayEffect;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                OptionalInstigatorFilterComponent;                 // 0x0004(0x0004)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforceOnGoingCheck;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_GetGameplayEffectCount) == 0x000004, "Wrong alignment on AbilitySystemComponent_GetGameplayEffectCount");
static_assert(sizeof(AbilitySystemComponent_GetGameplayEffectCount) == 0x000010, "Wrong size on AbilitySystemComponent_GetGameplayEffectCount");
static_assert(offsetof(AbilitySystemComponent_GetGameplayEffectCount, SourceGameplayEffect) == 0x000000, "Member 'AbilitySystemComponent_GetGameplayEffectCount::SourceGameplayEffect' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_GetGameplayEffectCount, OptionalInstigatorFilterComponent) == 0x000004, "Member 'AbilitySystemComponent_GetGameplayEffectCount::OptionalInstigatorFilterComponent' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_GetGameplayEffectCount, bEnforceOnGoingCheck) == 0x000008, "Member 'AbilitySystemComponent_GetGameplayEffectCount::bEnforceOnGoingCheck' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_GetGameplayEffectCount, ReturnValue) == 0x00000C, "Member 'AbilitySystemComponent_GetGameplayEffectCount::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.K2_ApplyGameplayEffectToSelf
// 0x0018 (0x0018 - 0x0000)
struct AbilitySystemComponent_K2_ApplyGameplayEffectToSelf final
{
public:
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf) == 0x000004, "Wrong alignment on AbilitySystemComponent_K2_ApplyGameplayEffectToSelf");
static_assert(sizeof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf) == 0x000018, "Wrong size on AbilitySystemComponent_K2_ApplyGameplayEffectToSelf");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf, GameplayEffect) == 0x000000, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToSelf::GameplayEffect' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf, Level) == 0x000004, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToSelf::Level' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf, EffectContext) == 0x000008, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToSelf::EffectContext' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToSelf, ReturnValue) == 0x000014, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToSelf::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.K2_ApplyGameplayEffectToTarget
// 0x001C (0x001C - 0x0000)
struct AbilitySystemComponent_K2_ApplyGameplayEffectToTarget final
{
public:
	class UGameplayEffect*                        GameplayEffect;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                Target;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           Context;                                           // 0x000C(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget) == 0x000004, "Wrong alignment on AbilitySystemComponent_K2_ApplyGameplayEffectToTarget");
static_assert(sizeof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget) == 0x00001C, "Wrong size on AbilitySystemComponent_K2_ApplyGameplayEffectToTarget");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget, GameplayEffect) == 0x000000, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToTarget::GameplayEffect' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget, Target) == 0x000004, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToTarget::Target' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget, Level) == 0x000008, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToTarget::Level' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget, Context) == 0x00000C, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToTarget::Context' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_ApplyGameplayEffectToTarget, ReturnValue) == 0x000018, "Member 'AbilitySystemComponent_K2_ApplyGameplayEffectToTarget::ReturnValue' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.K2_InitStats
// 0x0008 (0x0008 - 0x0000)
struct AbilitySystemComponent_K2_InitStats final
{
public:
	TSubclassOf<class UAttributeSet>              Attributes;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_K2_InitStats) == 0x000004, "Wrong alignment on AbilitySystemComponent_K2_InitStats");
static_assert(sizeof(AbilitySystemComponent_K2_InitStats) == 0x000008, "Wrong size on AbilitySystemComponent_K2_InitStats");
static_assert(offsetof(AbilitySystemComponent_K2_InitStats, Attributes) == 0x000000, "Member 'AbilitySystemComponent_K2_InitStats::Attributes' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_K2_InitStats, DataTable) == 0x000004, "Member 'AbilitySystemComponent_K2_InitStats::DataTable' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.NetMulticast_InvokeGameplayCueAdded
// 0x0020 (0x0020 - 0x0000)
struct AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0014(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded) == 0x000004, "Wrong alignment on AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded");
static_assert(sizeof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded) == 0x000020, "Wrong size on AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded, GameplayCueTag) == 0x000000, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded, PredictionKey) == 0x000008, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded::PredictionKey' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded, EffectContext) == 0x000014, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueAdded::EffectContext' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec
// 0x005C (0x005C - 0x0000)
struct AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec final
{
public:
	struct FGameplayEffectSpecForRPC              Spec;                                              // 0x0000(0x0050)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0050(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec) == 0x000004, "Wrong alignment on AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec");
static_assert(sizeof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec) == 0x00005C, "Wrong size on AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec, Spec) == 0x000000, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec::Spec' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec, PredictionKey) == 0x000050, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec::PredictionKey' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.NetMulticast_InvokeGameplayCueExecuted
// 0x0020 (0x0020 - 0x0000)
struct AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0014(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted) == 0x000004, "Wrong alignment on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted");
static_assert(sizeof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted) == 0x000020, "Wrong size on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted, GameplayCueTag) == 0x000000, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted, PredictionKey) == 0x000008, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted::PredictionKey' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted, EffectContext) == 0x000014, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted::EffectContext' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.NetMulticast_InvokeGameplayCueExecuted_FromSpec
// 0x005C (0x005C - 0x0000)
struct AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec final
{
public:
	struct FGameplayEffectSpecForRPC              Spec;                                              // 0x0000(0x0050)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0050(0x000C)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec) == 0x000004, "Wrong alignment on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec");
static_assert(sizeof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec) == 0x00005C, "Wrong size on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec, Spec) == 0x000000, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec::Spec' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec, PredictionKey) == 0x000050, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_FromSpec::PredictionKey' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.NetMulticast_InvokeGameplayCueExecuted_WithParams
// 0x0098 (0x0098 - 0x0000)
struct AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0008(0x000C)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0014(0x0084)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams) == 0x000004, "Wrong alignment on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams");
static_assert(sizeof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams) == 0x000098, "Wrong size on AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams, GameplayCueTag) == 0x000000, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams, PredictionKey) == 0x000008, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams::PredictionKey' has a wrong offset!");
static_assert(offsetof(AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams, GameplayCueParameters) == 0x000014, "Member 'AbilitySystemComponent_NetMulticast_InvokeGameplayCueExecuted_WithParams::GameplayCueParameters' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.RemoveActiveEffectsWithAppliedTags
// 0x0018 (0x0018 - 0x0000)
struct AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags) == 0x000004, "Wrong alignment on AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags");
static_assert(sizeof(AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags) == 0x000018, "Wrong size on AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags");
static_assert(offsetof(AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags, Tags) == 0x000000, "Member 'AbilitySystemComponent_RemoveActiveEffectsWithAppliedTags::Tags' has a wrong offset!");

// Function GameplayAbilities.AbilitySystemComponent.RemoveActiveEffectsWithGrantedTags
// 0x0018 (0x0018 - 0x0000)
struct AbilitySystemComponent_RemoveActiveEffectsWithGrantedTags final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilitySystemComponent_RemoveActiveEffectsWithGrantedTags) == 0x000004, "Wrong alignment on AbilitySystemComponent_RemoveActiveEffectsWithGrantedTags");
