#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayAbilities

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class GameplayAbilities.AbilityTask
// 0x000C (0x0050 - 0x0044)
class UAbilityTask : public UGameplayTask
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0048(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask">();
	}
	static class UAbilityTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask>();
	}
};
static_assert(alignof(UAbilityTask) == 0x000004, "Wrong alignment on UAbilityTask");
static_assert(sizeof(UAbilityTask) == 0x000050, "Wrong size on UAbilityTask");
static_assert(offsetof(UAbilityTask, Ability) == 0x000044, "Member 'UAbilityTask::Ability' has a wrong offset!");
static_assert(offsetof(UAbilityTask, AbilitySystemComponent) == 0x000048, "Member 'UAbilityTask::AbilitySystemComponent' has a wrong offset!");

// Class GameplayAbilities.AbilityTask_WaitGameplayEffectRemoved
// 0x0028 (0x0078 - 0x0050)
class UAbilityTask_WaitGameplayEffectRemoved final : public UAbilityTask
{
public:
	UMulticastDelegateProperty_                   OnRemoved;                                         // 0x0050(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   InvalidHandle;                                     // 0x005C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitGameplayEffectRemoved* WaitForGameplayEffectRemoved(class UObject* WorldContextObject, const struct FActiveGameplayEffectHandle& Handle);

	void OnGameplayEffectRemoved();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitGameplayEffectRemoved">();
	}
	static class UAbilityTask_WaitGameplayEffectRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitGameplayEffectRemoved>();
	}
};
static_assert(alignof(UAbilityTask_WaitGameplayEffectRemoved) == 0x000004, "Wrong alignment on UAbilityTask_WaitGameplayEffectRemoved");
static_assert(sizeof(UAbilityTask_WaitGameplayEffectRemoved) == 0x000078, "Wrong size on UAbilityTask_WaitGameplayEffectRemoved");
static_assert(offsetof(UAbilityTask_WaitGameplayEffectRemoved, OnRemoved) == 0x000050, "Member 'UAbilityTask_WaitGameplayEffectRemoved::OnRemoved' has a wrong offset!");
static_assert(offsetof(UAbilityTask_WaitGameplayEffectRemoved, InvalidHandle) == 0x00005C, "Member 'UAbilityTask_WaitGameplayEffectRemoved::InvalidHandle' has a wrong offset!");

// Class GameplayAbilities.GameplayCueNotify_Static
// 0x0014 (0x0030 - 0x001C)
class UGameplayCueNotify_Static : public UObject
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x001C(0x0008)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   GameplayCueName;                                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverride;                                        // 0x002C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters) const;
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCueNotify_Static">();
	}
	static class UGameplayCueNotify_Static* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCueNotify_Static>();
	}
};
static_assert(alignof(UGameplayCueNotify_Static) == 0x000004, "Wrong alignment on UGameplayCueNotify_Static");
static_assert(sizeof(UGameplayCueNotify_Static) == 0x000030, "Wrong size on UGameplayCueNotify_Static");
static_assert(offsetof(UGameplayCueNotify_Static, GameplayCueTag) == 0x00001C, "Member 'UGameplayCueNotify_Static::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(UGameplayCueNotify_Static, GameplayCueName) == 0x000024, "Member 'UGameplayCueNotify_Static::GameplayCueName' has a wrong offset!");
static_assert(offsetof(UGameplayCueNotify_Static, IsOverride) == 0x00002C, "Member 'UGameplayCueNotify_Static::IsOverride' has a wrong offset!");

// Class GameplayAbilities.AbilityTask_WaitAttributeChange
// 0x0034 (0x0084 - 0x0050)
class UAbilityTask_WaitAttributeChange final : public UAbilityTask
{
public:
	UMulticastDelegateProperty_                   OnChange;                                          // 0x0050(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x28];                                      // 0x005C(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitAttributeChange* WaitForAttributeChange(class UObject* WorldContextObject, const struct FGameplayAttribute& Attribute, const struct FGameplayTag& WithSrcTag, const struct FGameplayTag& WithoutSrcTag, bool TriggerOnce);
	static class UAbilityTask_WaitAttributeChange* WaitForAttributeChangeWithComparison(class UObject* WorldContextObject, const struct FGameplayAttribute& InAttribute, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool TriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitAttributeChange">();
	}
	static class UAbilityTask_WaitAttributeChange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitAttributeChange>();
	}
};
static_assert(alignof(UAbilityTask_WaitAttributeChange) == 0x000004, "Wrong alignment on UAbilityTask_WaitAttributeChange");
static_assert(sizeof(UAbilityTask_WaitAttributeChange) == 0x000084, "Wrong size on UAbilityTask_WaitAttributeChange");
static_assert(offsetof(UAbilityTask_WaitAttributeChange, OnChange) == 0x000050, "Member 'UAbilityTask_WaitAttributeChange::OnChange' has a wrong offset!");

// Class GameplayAbilities.AttributeSet
// 0x0004 (0x0020 - 0x001C)
class UAttributeSet : public UObject
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeSet">();
	}
	static class UAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeSet>();
	}
};
static_assert(alignof(UAttributeSet) == 0x000004, "Wrong alignment on UAttributeSet");
static_assert(sizeof(UAttributeSet) == 0x000020, "Wrong size on UAttributeSet");

// Class GameplayAbilities.AbilityTask_SpawnActor
// 0x002C (0x007C - 0x0050)
class UAbilityTask_SpawnActor final : public UAbilityTask
{
public:
	UMulticastDelegateProperty_                   Success;                                           // 0x0050(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   DidNotSpawn;                                       // 0x005C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x14];                                      // 0x0068(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_SpawnActor* SpawnActor(class UObject* WorldContextObject, const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class AActor> Class_0);

	bool BeginSpawningActor(class UObject* WorldContextObject, const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class AActor> Class_0, class AActor** SpawnedActor);
	void FinishSpawningActor(class UObject* WorldContextObject, const struct FGameplayAbilityTargetDataHandle& TargetData, class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_SpawnActor">();
	}
	static class UAbilityTask_SpawnActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_SpawnActor>();
	}
};
static_assert(alignof(UAbilityTask_SpawnActor) == 0x000004, "Wrong alignment on UAbilityTask_SpawnActor");
static_assert(sizeof(UAbilityTask_SpawnActor) == 0x00007C, "Wrong size on UAbilityTask_SpawnActor");
static_assert(offsetof(UAbilityTask_SpawnActor, Success) == 0x000050, "Member 'UAbilityTask_SpawnActor::Success' has a wrong offset!");
static_assert(offsetof(UAbilityTask_SpawnActor, DidNotSpawn) == 0x00005C, "Member 'UAbilityTask_SpawnActor::DidNotSpawn' has a wrong offset!");

// Class GameplayAbilities.AbilitySystemComponent
// 0x0938 (0x0A08 - 0x00D0)
class UAbilitySystemComponent : public UGameplayTasksComponent
{
public:
	uint8                                         Pad_D0[0x4];                                       // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAttributeDefaults>             DefaultStartingData;                               // 0x00D4(0x000C)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAttributeSet*>                  SpawnedAttributes;                                 // 0x00E0(0x000C)(ExportObject, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FPredictionKey                         ReplicatedPredictionKey;                           // 0x00EC(0x000C)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0xA0];                                      // 0x00F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutgoingDuration;                                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncomingDuration;                                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecContainer          ActivatableAbilities;                              // 0x01A0(0x0090)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_230[0x3C];                                     // 0x0230(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayAbility*>               AllReplicatedInstancedAbilities;                   // 0x026C(0x000C)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x1B0];                                    // 0x0278(0x01B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameplayAbilityTargetActor*>    SpawnedTargetActors;                               // 0x0428(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityRepAnimMontage         RepAnimMontageInfo;                                // 0x0434(0x0020)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FGameplayAbilityLocalAnimMontage       LocalAnimMontageInfo;                              // 0x0454(0x0018)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x78];                                     // 0x046C(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x04E4(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AvatarActor;                                       // 0x04E8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x8];                                      // 0x04EC(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectsContainer        ActiveGameplayEffects;                             // 0x04F4(0x029C)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FActiveGameplayCueContainer            ActiveGameplayCues;                                // 0x0790(0x0090)(Net, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_820[0xE8];                                     // 0x0820(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 BlockedAbilityBindings;                            // 0x0908(0x000C)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_914[0xF4];                                     // 0x0914(0x00F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToSelf(struct FGameplayEffectSpecHandle& SpecHandle);
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToTarget(struct FGameplayEffectSpecHandle& SpecHandle, class UAbilitySystemComponent* Target);
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToSelf(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level, const struct FGameplayEffectContextHandle& EffectContext);
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToTarget(TSubclassOf<class UGameplayEffect> GameplayEffectClass, class UAbilitySystemComponent* Target, float Level, const struct FGameplayEffectContextHandle& Context);
	void ClientActivateAbilityFailed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, int16 PredictionKey);
	void ClientActivateAbilitySucceed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey);
	void ClientActivateAbilitySucceedWithEventData(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey, const struct FGameplayEventData& TriggerEventData);
	void ClientCancelAbility(const struct FGameplayAbilitySpecHandle& AbilityToCancel, const struct FGameplayAbilityActivationInfo& ActivationInfo);
	void ClientEndAbility(const struct FGameplayAbilitySpecHandle& AbilityToEnd, const struct FGameplayAbilityActivationInfo& ActivationInfo);
	void ClientPrintDebug_Response(const TArray<class FString>& Strings);
	void ClientSetReplicatedEvent(EAbilityGenericReplicatedEvent EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey);
	void ClientTryActivateAbility(const struct FGameplayAbilitySpecHandle& AbilityToActivate);
	int32 GetGameplayEffectCount(TSubclassOf<class UGameplayEffect> SourceGameplayEffect, class UAbilitySystemComponent* OptionalInstigatorFilterComponent, bool bEnforceOnGoingCheck);
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectToSelf(const class UGameplayEffect* GameplayEffect, float Level, const struct FGameplayEffectContextHandle& EffectContext);
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectToTarget(class UGameplayEffect* GameplayEffect, class UAbilitySystemComponent* Target, float Level, const struct FGameplayEffectContextHandle& Context);
	void K2_InitStats(TSubclassOf<class UAttributeSet> Attributes, const class UDataTable* DataTable);
	void NetMulticast_InvokeGameplayCueAdded(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayEffectContextHandle& EffectContext);
	void NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec(const struct FGameplayEffectSpecForRPC& Spec, const struct FPredictionKey& PredictionKey);
	void NetMulticast_InvokeGameplayCueExecuted(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayEffectContextHandle& EffectContext);
	void NetMulticast_InvokeGameplayCueExecuted_FromSpec(const struct FGameplayEffectSpecForRPC& Spec, const struct FPredictionKey& PredictionKey);
	void NetMulticast_InvokeGameplayCueExecuted_WithParams(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& GameplayCueParameters);
	void OnRep_ActivateAbilities();
	void OnRep_GameplayEffects();
	void OnRep_OwningActor();
	void OnRep_PredictionKey();
	void OnRep_ReplicatedAnimMontage();
	void RemoveActiveEffectsWithAppliedTags(const struct FGameplayTagContainer& Tags);
	void RemoveActiveEffectsWithGrantedTags(const struct FGameplayTagContainer& Tags);
	void RemoveActiveEffectsWithSourceTags(const struct FGameplayTagContainer& Tags);
	void RemoveActiveEffectsWithTags(const struct FGameplayTagContainer& Tags);
	bool RemoveActiveGameplayEffect(const struct FActiveGameplayEffectHandle& Handle, int32 StacksToRemove);
	void RemoveActiveGameplayEffectBySourceEffect(TSubclassOf<class UGameplayEffect> GameplayEffect, class UAbilitySystemComponent* InstigatorAbilitySystemComponent, int32 StacksToRemove);
	void ServerCancelAbility(const struct FGameplayAbilitySpecHandle& AbilityToCancel, const struct FGameplayAbilityActivationInfo& ActivationInfo);
	void ServerCurrentMontageJumpToSectionName(class UAnimMontage* ClientAnimMontage, class FName SectionName);
	void ServerCurrentMontageSetNextSectionName(class UAnimMontage* ClientAnimMontage, float ClientPosition, class FName SectionName, class FName NextSectionName);
	void ServerCurrentMontageSetPlayRate(class UAnimMontage* ClientAnimMontage, float InPlayRate);
	void ServerEndAbility(const struct FGameplayAbilitySpecHandle& AbilityToEnd, const struct FGameplayAbilityActivationInfo& ActivationInfo, const struct FPredictionKey& PredictionKey);
	void ServerPrintDebug_Request();
	void ServerSetInputPressed(const struct FGameplayAbilitySpecHandle& AbilityHandle);
	void ServerSetInputReleased(const struct FGameplayAbilitySpecHandle& AbilityHandle);
	void ServerSetReplicatedEvent(EAbilityGenericReplicatedEvent EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey);
	void ServerSetReplicatedEventWithPayload(EAbilityGenericReplicatedEvent EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey, const struct FVector_NetQuantize100& VectorPayload);
	void ServerSetReplicatedTargetData(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FGameplayAbilityTargetDataHandle& ReplicatedTargetDataHandle, const struct FGameplayTag& ApplicationTag, const struct FPredictionKey& CurrentPredictionKey);
	void ServerSetReplicatedTargetDataCancelled(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey);
	void ServerTryActivateAbility(const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool InputPressed, const struct FPredictionKey& PredictionKey);
	void ServerTryActivateAbilityWithEventData(const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool InputPressed, const struct FPredictionKey& PredictionKey, const struct FGameplayEventData& TriggerEventData);
	void SetActiveGameplayEffectLevel(const struct FActiveGameplayEffectHandle& ActiveHandle, int32 NewLevel);
	void SetUserAbilityActivationInhibited(bool NewInhibit);
	void TargetCancel();
	void TargetConfirm();
	bool TryActivateAbilitiesByTag(const struct FGameplayTagContainer& GameplayTagContainer, bool bAllowRemoteActivation);
	bool TryActivateAbilityByClass(TSubclassOf<class UGameplayAbility> InAbilityToActivate, bool bAllowRemoteActivation);

	float GetGameplayEffectMagnitude(const struct FActiveGameplayEffectHandle& Handle, const struct FGameplayAttribute& Attribute) const;
	struct FGameplayEffectSpecHandle GetOutgoingSpec(const class UGameplayEffect* GameplayEffect, float Level) const;
	bool GetUserAbilityActivationInhibited() const;
	bool IsGameplayCueActive(const struct FGameplayTag& GameplayCueTag) const;
	struct FGameplayEffectContextHandle MakeEffectContext() const;
	struct FGameplayEffectSpecHandle MakeOutgoingSpec(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level, const struct FGameplayEffectContextHandle& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemComponent">();
	}
	static class UAbilitySystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemComponent>();
	}
};
static_assert(alignof(UAbilitySystemComponent) == 0x000004, "Wrong alignment on UAbilitySystemComponent");
static_assert(sizeof(UAbilitySystemComponent) == 0x000A08, "Wrong size on UAbilitySystemComponent");
static_assert(offsetof(UAbilitySystemComponent, DefaultStartingData) == 0x0000D4, "Member 'UAbilitySystemComponent::DefaultStartingData' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, SpawnedAttributes) == 0x0000E0, "Member 'UAbilitySystemComponent::SpawnedAttributes' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, ReplicatedPredictionKey) == 0x0000EC, "Member 'UAbilitySystemComponent::ReplicatedPredictionKey' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, OutgoingDuration) == 0x000198, "Member 'UAbilitySystemComponent::OutgoingDuration' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, IncomingDuration) == 0x00019C, "Member 'UAbilitySystemComponent::IncomingDuration' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, ActivatableAbilities) == 0x0001A0, "Member 'UAbilitySystemComponent::ActivatableAbilities' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, AllReplicatedInstancedAbilities) == 0x00026C, "Member 'UAbilitySystemComponent::AllReplicatedInstancedAbilities' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, SpawnedTargetActors) == 0x000428, "Member 'UAbilitySystemComponent::SpawnedTargetActors' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, RepAnimMontageInfo) == 0x000434, "Member 'UAbilitySystemComponent::RepAnimMontageInfo' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, LocalAnimMontageInfo) == 0x000454, "Member 'UAbilitySystemComponent::LocalAnimMontageInfo' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, OwnerActor) == 0x0004E4, "Member 'UAbilitySystemComponent::OwnerActor' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, AvatarActor) == 0x0004E8, "Member 'UAbilitySystemComponent::AvatarActor' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, ActiveGameplayEffects) == 0x0004F4, "Member 'UAbilitySystemComponent::ActiveGameplayEffects' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, ActiveGameplayCues) == 0x000790, "Member 'UAbilitySystemComponent::ActiveGameplayCues' has a wrong offset!");
static_assert(offsetof(UAbilitySystemComponent, BlockedAbilityBindings) == 0x000908, "Member 'UAbilitySystemComponent::BlockedAbilityBindings' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor
// 0x0100 (0x0340 - 0x0240)
#pragma pack(push, 0x1)
class alignas(0x10) AGameplayAbilityTargetActor : public AActor
{
public:
	bool                                          ShouldProduceTargetDataOnServer;                   // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_241[0xF];                                      // 0x0241(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetingLocationInfo  StartLocation;                                     // 0x0250(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x38];                                     // 0x02C0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      MasterPC;                                          // 0x02F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       OwningAbility;                                     // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyOnConfirmation;                            // 0x0300(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SourceActor;                                       // 0x0304(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldReticleParameters                ReticleParams;                                     // 0x0308(0x000C)(BlueprintVisible, ExposeOnSpawn, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameplayAbilityWorldReticle> ReticleClass;                                      // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTargetDataFilterHandle        Filter;                                            // 0x0318(0x0008)(BlueprintVisible, Net, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x13];                                     // 0x0321(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                GenericDelegateBoundASC;                           // 0x0334(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CancelTargeting();
	void ConfirmTargeting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayAbilityTargetActor">();
	}
	static class AGameplayAbilityTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor>();
	}
};
#pragma pack(pop)
static_assert(alignof(AGameplayAbilityTargetActor) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor");
static_assert(sizeof(AGameplayAbilityTargetActor) == 0x000340, "Wrong size on AGameplayAbilityTargetActor");
static_assert(offsetof(AGameplayAbilityTargetActor, ShouldProduceTargetDataOnServer) == 0x000240, "Member 'AGameplayAbilityTargetActor::ShouldProduceTargetDataOnServer' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, StartLocation) == 0x000250, "Member 'AGameplayAbilityTargetActor::StartLocation' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, MasterPC) == 0x0002F8, "Member 'AGameplayAbilityTargetActor::MasterPC' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, OwningAbility) == 0x0002FC, "Member 'AGameplayAbilityTargetActor::OwningAbility' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, bDestroyOnConfirmation) == 0x000300, "Member 'AGameplayAbilityTargetActor::bDestroyOnConfirmation' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, SourceActor) == 0x000304, "Member 'AGameplayAbilityTargetActor::SourceActor' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, ReticleParams) == 0x000308, "Member 'AGameplayAbilityTargetActor::ReticleParams' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, ReticleClass) == 0x000314, "Member 'AGameplayAbilityTargetActor::ReticleClass' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, Filter) == 0x000318, "Member 'AGameplayAbilityTargetActor::Filter' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, bDebug) == 0x000320, "Member 'AGameplayAbilityTargetActor::bDebug' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, GenericDelegateBoundASC) == 0x000334, "Member 'AGameplayAbilityTargetActor::GenericDelegateBoundASC' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_Trace
// 0x0010 (0x0350 - 0x0340)
class AGameplayAbilityTargetActor_Trace : public AGameplayAbilityTargetActor
{
public:
	float                                         MaxRange;                                          // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollisionProfileName                  TraceProfile;                                      // 0x033C(0x0008)(Edit, BlueprintVisible, Config, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bTraceAffectsAimPitch;                             // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_345[0xB];                                      // 0x0345(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_Trace">();
	}
	static class AGameplayAbilityTargetActor_Trace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_Trace>();
	}
};
static_assert(alignof(AGameplayAbilityTargetActor_Trace) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_Trace");
static_assert(sizeof(AGameplayAbilityTargetActor_Trace) == 0x000350, "Wrong size on AGameplayAbilityTargetActor_Trace");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, MaxRange) == 0x000338, "Member 'AGameplayAbilityTargetActor_Trace::MaxRange' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, TraceProfile) == 0x00033C, "Member 'AGameplayAbilityTargetActor_Trace::TraceProfile' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, bTraceAffectsAimPitch) == 0x000344, "Member 'AGameplayAbilityTargetActor_Trace::bTraceAffectsAimPitch' has a wrong offset!");

// Class GameplayAbilities.AbilityTask_WaitGameplayEffectApplied
// 0x0070 (0x00C0 - 0x0050)
class UAbilityTask_WaitGameplayEffectApplied : public UAbilityTask
{
public:
	uint8                                         Pad_50[0x6C];                                      // 0x0050(0x006C)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                ExternalOwner;                                     // 0x00BC(0x0004)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnApplyGameplayEffectCallback(class UAbilitySystemComponent* Target, const struct FGameplayEffectSpec& SpecApplied, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitGameplayEffectApplied">();
	}
	static class UAbilityTask_WaitGameplayEffectApplied* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitGameplayEffectApplied>();
	}
};
static_assert(alignof(UAbilityTask_WaitGameplayEffectApplied) == 0x000004, "Wrong alignment on UAbilityTask_WaitGameplayEffectApplied");
static_assert(sizeof(UAbilityTask_WaitGameplayEffectApplied) == 0x0000C0, "Wrong size on UAbilityTask_WaitGameplayEffectApplied");
static_assert(offsetof(UAbilityTask_WaitGameplayEffectApplied, ExternalOwner) == 0x0000BC, "Member 'UAbilityTask_WaitGameplayEffectApplied::ExternalOwner' has a wrong offset!");

// Class GameplayAbilities.AbilitySystemGlobals
// 0x00EC (0x0108 - 0x001C)
class UAbilitySystemGlobals : public UObject
{
public:
	struct FStringClassReference                  AbilitySystemGlobalsClassName;                     // 0x001C(0x000C)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ActivateFailCooldownTag;                           // 0x0050(0x0008)(NativeAccessSpecifierPublic)
	class FName                                   ActivateFailCooldownName;                          // 0x0058(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailCostTag;                               // 0x0060(0x0008)(NativeAccessSpecifierPublic)
	class FName                                   ActivateFailCostName;                              // 0x0068(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailTagsBlockedTag;                        // 0x0070(0x0008)(NativeAccessSpecifierPublic)
	class FName                                   ActivateFailTagsBlockedName;                       // 0x0078(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailTagsMissingTag;                        // 0x0080(0x0008)(NativeAccessSpecifierPublic)
	class FName                                   ActivateFailTagsMissingName;                       // 0x0088(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailNetworkingTag;                         // 0x0090(0x0008)(NativeAccessSpecifierPublic)
	class FName                                   ActivateFailNetworkingName;                        // 0x0098(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GlobalCurveTableName;                              // 0x00A0(0x000C)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GlobalAttributeMetaDataTableName;                  // 0x00AC(0x000C)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GlobalAttributeSetDefaultsTableName;               // 0x00B8(0x000C)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStringAssetReference                  GlobalGameplayCueManagerName;                      // 0x00C4(0x000C)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<class FString>                         GameplayCueNotifyPaths;                            // 0x00D0(0x000C)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	struct FStringAssetReference                  GameplayTagResponseTableName;                      // 0x00DC(0x000C)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class UGameplayTagReponseTable*               GameplayTagResponseTable;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          PredictTargetGameplayEffects;                      // 0x00EC(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveTable*                            GlobalCurveTable;                                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveTable*                            GlobalAttributeDefaultsTable;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             GlobalAttributeMetaDataTable;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayCueManager*                    GlobalGameplayCueManager;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ToggleIgnoreAbilitySystemCooldowns();
	void ToggleIgnoreAbilitySystemCosts();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemGlobals">();
	}
	static class UAbilitySystemGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemGlobals>();
	}
};
static_assert(alignof(UAbilitySystemGlobals) == 0x000004, "Wrong alignment on UAbilitySystemGlobals");
static_assert(sizeof(UAbilitySystemGlobals) == 0x000108, "Wrong size on UAbilitySystemGlobals");
static_assert(offsetof(UAbilitySystemGlobals, AbilitySystemGlobalsClassName) == 0x00001C, "Member 'UAbilitySystemGlobals::AbilitySystemGlobalsClassName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailCooldownTag) == 0x000050, "Member 'UAbilitySystemGlobals::ActivateFailCooldownTag' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailCooldownName) == 0x000058, "Member 'UAbilitySystemGlobals::ActivateFailCooldownName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailCostTag) == 0x000060, "Member 'UAbilitySystemGlobals::ActivateFailCostTag' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailCostName) == 0x000068, "Member 'UAbilitySystemGlobals::ActivateFailCostName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailTagsBlockedTag) == 0x000070, "Member 'UAbilitySystemGlobals::ActivateFailTagsBlockedTag' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailTagsBlockedName) == 0x000078, "Member 'UAbilitySystemGlobals::ActivateFailTagsBlockedName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailTagsMissingTag) == 0x000080, "Member 'UAbilitySystemGlobals::ActivateFailTagsMissingTag' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailTagsMissingName) == 0x000088, "Member 'UAbilitySystemGlobals::ActivateFailTagsMissingName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailNetworkingTag) == 0x000090, "Member 'UAbilitySystemGlobals::ActivateFailNetworkingTag' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, ActivateFailNetworkingName) == 0x000098, "Member 'UAbilitySystemGlobals::ActivateFailNetworkingName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalCurveTableName) == 0x0000A0, "Member 'UAbilitySystemGlobals::GlobalCurveTableName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalAttributeMetaDataTableName) == 0x0000AC, "Member 'UAbilitySystemGlobals::GlobalAttributeMetaDataTableName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalAttributeSetDefaultsTableName) == 0x0000B8, "Member 'UAbilitySystemGlobals::GlobalAttributeSetDefaultsTableName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalGameplayCueManagerName) == 0x0000C4, "Member 'UAbilitySystemGlobals::GlobalGameplayCueManagerName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GameplayCueNotifyPaths) == 0x0000D0, "Member 'UAbilitySystemGlobals::GameplayCueNotifyPaths' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GameplayTagResponseTableName) == 0x0000DC, "Member 'UAbilitySystemGlobals::GameplayTagResponseTableName' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GameplayTagResponseTable) == 0x0000E8, "Member 'UAbilitySystemGlobals::GameplayTagResponseTable' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, PredictTargetGameplayEffects) == 0x0000EC, "Member 'UAbilitySystemGlobals::PredictTargetGameplayEffects' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalCurveTable) == 0x0000F0, "Member 'UAbilitySystemGlobals::GlobalCurveTable' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalAttributeDefaultsTable) == 0x0000F4, "Member 'UAbilitySystemGlobals::GlobalAttributeDefaultsTable' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalAttributeMetaDataTable) == 0x0000F8, "Member 'UAbilitySystemGlobals::GlobalAttributeMetaDataTable' has a wrong offset!");
static_assert(offsetof(UAbilitySystemGlobals, GlobalGameplayCueManager) == 0x0000FC, "Member 'UAbilitySystemGlobals::GlobalGameplayCueManager' has a wrong offset!");

// Class GameplayAbilities.GameplayAbility
// 0x02F0 (0x030C - 0x001C)
class UGameplayAbility : public UObject
{
public:
	uint8                                         Pad_1C[0x58];                                      // 0x001C(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x0074(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x1C];                                      // 0x008C(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bReplicateInputDirectly;                           // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x20];                                      // 0x00A9(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayAbilityReplicationPolicy             ReplicationPolicy;                                 // 0x00C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityInstancingPolicy              InstancingPolicy;                                  // 0x00CA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bServerRespectsRemoteAbilityCancellation;          // 0x00CB(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bRetriggerInstancedAbility;                        // 0x00CC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActivationInfo         CurrentActivationInfo;                             // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayEventData                     CurrentEventData;                                  // 0x00E0(0x0058)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EGameplayAbilityNetExecutionPolicy            NetExecutionPolicy;                                // 0x0138(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            CostGameplayEffectClass;                           // 0x013C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayEffect*                        CostGameplayEffect;                                // 0x0140(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAbilityTriggerData>            AbilityTriggers;                                   // 0x0144(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            CooldownGameplayEffectClass;                       // 0x0150(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayEffect*                        CooldownGameplayEffect;                            // 0x0154(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      CancelAbilitiesMatchingTagQuery;                   // 0x0158(0x0034)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      ConstTagQuery;                                     // 0x018C(0x0034)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CancelAbilitiesWithTag;                            // 0x01C0(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilitiesWithTag;                             // 0x01D8(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationOwnedTags;                               // 0x01F0(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationRequiredTags;                            // 0x0208(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationBlockedTags;                             // 0x0220(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceRequiredTags;                                // 0x0238(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceBlockedTags;                                 // 0x0250(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetRequiredTags;                                // 0x0268(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetBlockedTags;                                 // 0x0280(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UGameplayTask*>                  ActiveTasks;                                       // 0x0298(0x000C)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A4[0x50];                                     // 0x02A4(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentMontage;                                    // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActive;                                         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsCancelable;                                     // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FA[0xE];                                      // 0x02FA(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsBlockingOtherAbilities;                         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToOwner(TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks);
	TArray<struct FActiveGameplayEffectHandle> BP_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks);
	void BP_RemoveGameplayEffectFromOwnerWithAssetTags(const struct FGameplayTagContainer& WithAssetTags, int32 StacksToRemove);
	void BP_RemoveGameplayEffectFromOwnerWithGrantedTags(const struct FGameplayTagContainer& WithGrantedTags, int32 StacksToRemove);
	void CancelTaskByInstanceName(class FName InstanceName);
	void ConfirmTaskByInstanceName(class FName InstanceName, bool bEndTask);
	void EndAbilityState(class FName OptionalStateNameToEnd);
	void EndTaskByInstanceName(class FName InstanceName);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd);
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectSpecToOwner(const struct FGameplayEffectSpecHandle& EffectSpecHandle);
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& EffectSpecHandle, const struct FGameplayAbilityTargetDataHandle& TargetData);
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectToOwner(const class UGameplayEffect* GameplayEffect, int32 GameplayEffectLevel, int32 Stacks);
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, const class UGameplayEffect* GameplayEffect, int32 GameplayEffectLevel, int32 Stacks);
	bool K2_CheckAbilityCooldown();
	bool K2_CheckAbilityCost();
	bool K2_CommitAbility();
	bool K2_CommitAbilityCooldown(bool BroadcastCommitEvent, bool ForceCooldown);
	bool K2_CommitAbilityCost(bool BroadcastCommitEvent);
	void K2_CommitExecute();
	void K2_EndAbility();
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
	void K2_OnEndAbility();
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerActor();
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerSkeletalMeshComponent(class FName SocketName);
	void MontageJumpToSection(class FName SectionName);
	void MontageSetNextSectionName(class FName FromSectionName, class FName ToSectionName);
	void MontageStop(float OverrideBlendOutTime);
	void RemoveGrantedByEffect();
	void SendGameplayEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);
	void SetCanBeCanceled(bool bCanBeCanceled);
	void SetShouldBlockOtherAbilities(bool bShouldBlockAbilities);

	int32 GetAbilityLevel() const;
	struct FGameplayAbilityActorInfo GetActorInfo() const;
	class AActor* GetAvatarActorFromActorInfo() const;
	struct FGameplayEffectContextHandle GetContextFromOwner(const struct FGameplayAbilityTargetDataHandle& OptionalTargetData) const;
	float GetCoolDownTimeRemaining() const;
	class UAnimMontage* GetCurrentMontage() const;
	class UObject* GetCurrentSourceObject() const;
	struct FGameplayEffectContextHandle GetGrantedByEffectContext() const;
	struct FGameplayEffectSpecHandle GetOutgoingGameplayEffectSpec(const class UGameplayEffect* GameplayEffect, float Level) const;
	class AActor* GetOwningActorFromActorInfo() const;
	class USkeletalMeshComponent* GetOwningComponentFromActorInfo() const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;
	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;
	struct FGameplayEffectSpecHandle MakeOutgoingGameplayEffectSpec(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayAbility">();
	}
	static class UGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayAbility>();
	}
};
static_assert(alignof(UGameplayAbility) == 0x000004, "Wrong alignment on UGameplayAbility");
static_assert(sizeof(UGameplayAbility) == 0x00030C, "Wrong size on UGameplayAbility");
static_assert(offsetof(UGameplayAbility, AbilityTags) == 0x000074, "Member 'UGameplayAbility::AbilityTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bReplicateInputDirectly) == 0x0000A8, "Member 'UGameplayAbility::bReplicateInputDirectly' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ReplicationPolicy) == 0x0000C9, "Member 'UGameplayAbility::ReplicationPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, InstancingPolicy) == 0x0000CA, "Member 'UGameplayAbility::InstancingPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bServerRespectsRemoteAbilityCancellation) == 0x0000CB, "Member 'UGameplayAbility::bServerRespectsRemoteAbilityCancellation' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bRetriggerInstancedAbility) == 0x0000CC, "Member 'UGameplayAbility::bRetriggerInstancedAbility' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CurrentActivationInfo) == 0x0000D0, "Member 'UGameplayAbility::CurrentActivationInfo' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CurrentEventData) == 0x0000E0, "Member 'UGameplayAbility::CurrentEventData' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, NetExecutionPolicy) == 0x000138, "Member 'UGameplayAbility::NetExecutionPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CostGameplayEffectClass) == 0x00013C, "Member 'UGameplayAbility::CostGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CostGameplayEffect) == 0x000140, "Member 'UGameplayAbility::CostGameplayEffect' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, AbilityTriggers) == 0x000144, "Member 'UGameplayAbility::AbilityTriggers' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CooldownGameplayEffectClass) == 0x000150, "Member 'UGameplayAbility::CooldownGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CooldownGameplayEffect) == 0x000154, "Member 'UGameplayAbility::CooldownGameplayEffect' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CancelAbilitiesMatchingTagQuery) == 0x000158, "Member 'UGameplayAbility::CancelAbilitiesMatchingTagQuery' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ConstTagQuery) == 0x00018C, "Member 'UGameplayAbility::ConstTagQuery' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CancelAbilitiesWithTag) == 0x0001C0, "Member 'UGameplayAbility::CancelAbilitiesWithTag' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, BlockAbilitiesWithTag) == 0x0001D8, "Member 'UGameplayAbility::BlockAbilitiesWithTag' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationOwnedTags) == 0x0001F0, "Member 'UGameplayAbility::ActivationOwnedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationRequiredTags) == 0x000208, "Member 'UGameplayAbility::ActivationRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationBlockedTags) == 0x000220, "Member 'UGameplayAbility::ActivationBlockedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, SourceRequiredTags) == 0x000238, "Member 'UGameplayAbility::SourceRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, SourceBlockedTags) == 0x000250, "Member 'UGameplayAbility::SourceBlockedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, TargetRequiredTags) == 0x000268, "Member 'UGameplayAbility::TargetRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, TargetBlockedTags) == 0x000280, "Member 'UGameplayAbility::TargetBlockedTags' has a wrong offset!");
