#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_OutlanderActiveAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_ActiveAbility_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAT_OutlanderActiveAbility.GAT_OutlanderActiveAbility_C
// 0x0060 (0x0740 - 0x06E0)
class UGAT_OutlanderActiveAbility_C : public UGAT_ActiveAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_OutlanderActiveAbility_C;       // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Outlander_C*                OutlanderPlayerPawn;                               // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     Event_Data;                                        // 0x06E8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAT_OutlanderActiveAbility(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_OutlanderActiveAbility_C">();
	}
	static class UGAT_OutlanderActiveAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_OutlanderActiveAbility_C>();
	}
};
static_assert(alignof(UGAT_OutlanderActiveAbility_C) == 0x000004, "Wrong alignment on UGAT_OutlanderActiveAbility_C");
static_assert(sizeof(UGAT_OutlanderActiveAbility_C) == 0x000740, "Wrong size on UGAT_OutlanderActiveAbility_C");
static_assert(offsetof(UGAT_OutlanderActiveAbility_C, UberGraphFrame_GAT_OutlanderActiveAbility_C) == 0x0006E0, "Member 'UGAT_OutlanderActiveAbility_C::UberGraphFrame_GAT_OutlanderActiveAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_OutlanderActiveAbility_C, OutlanderPlayerPawn) == 0x0006E4, "Member 'UGAT_OutlanderActiveAbility_C::OutlanderPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_OutlanderActiveAbility_C, Event_Data) == 0x0006E8, "Member 'UGAT_OutlanderActiveAbility_C::Event_Data' has a wrong offset!");

}

#pragma pack(pop)
