#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_OutlanderTriggeredAbility

#include "Basic.hpp"

#include "GAT_TriggeredAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAT_OutlanderTriggeredAbility.GAT_OutlanderTriggeredAbility_C
// 0x0060 (0x0740 - 0x06E0)
class UGAT_OutlanderTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_OutlanderTriggeredAbility_C;    // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     EventData;                                         // 0x06E4(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerPawn_Outlander_C*                OutlanderPlayerPawn;                               // 0x073C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_OutlanderTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_OutlanderTriggeredAbility_C">();
	}
	static class UGAT_OutlanderTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_OutlanderTriggeredAbility_C>();
	}
};
static_assert(alignof(UGAT_OutlanderTriggeredAbility_C) == 0x000004, "Wrong alignment on UGAT_OutlanderTriggeredAbility_C");
static_assert(sizeof(UGAT_OutlanderTriggeredAbility_C) == 0x000740, "Wrong size on UGAT_OutlanderTriggeredAbility_C");
static_assert(offsetof(UGAT_OutlanderTriggeredAbility_C, UberGraphFrame_GAT_OutlanderTriggeredAbility_C) == 0x0006E0, "Member 'UGAT_OutlanderTriggeredAbility_C::UberGraphFrame_GAT_OutlanderTriggeredAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_OutlanderTriggeredAbility_C, EventData) == 0x0006E4, "Member 'UGAT_OutlanderTriggeredAbility_C::EventData' has a wrong offset!");
static_assert(offsetof(UGAT_OutlanderTriggeredAbility_C, OutlanderPlayerPawn) == 0x00073C, "Member 'UGAT_OutlanderTriggeredAbility_C::OutlanderPlayerPawn' has a wrong offset!");

}

#pragma pack(pop)
