#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_ConstructorTriggeredAbility

#include "Basic.hpp"

#include "GAT_TriggeredAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAT_ConstructorTriggeredAbility.GAT_ConstructorTriggeredAbility_C
// 0x0060 (0x0740 - 0x06E0)
class UGAT_ConstructorTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_ConstructorTriggeredAbility_C;  // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     Event_Data;                                        // 0x06E4(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerPawn_Constructor_C*              ConstructorPlayerPawn;                             // 0x073C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_ConstructorTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_ConstructorTriggeredAbility_C">();
	}
	static class UGAT_ConstructorTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_ConstructorTriggeredAbility_C>();
	}
};
static_assert(alignof(UGAT_ConstructorTriggeredAbility_C) == 0x000004, "Wrong alignment on UGAT_ConstructorTriggeredAbility_C");
static_assert(sizeof(UGAT_ConstructorTriggeredAbility_C) == 0x000740, "Wrong size on UGAT_ConstructorTriggeredAbility_C");
static_assert(offsetof(UGAT_ConstructorTriggeredAbility_C, UberGraphFrame_GAT_ConstructorTriggeredAbility_C) == 0x0006E0, "Member 'UGAT_ConstructorTriggeredAbility_C::UberGraphFrame_GAT_ConstructorTriggeredAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_ConstructorTriggeredAbility_C, Event_Data) == 0x0006E4, "Member 'UGAT_ConstructorTriggeredAbility_C::Event_Data' has a wrong offset!");
static_assert(offsetof(UGAT_ConstructorTriggeredAbility_C, ConstructorPlayerPawn) == 0x00073C, "Member 'UGAT_ConstructorTriggeredAbility_C::ConstructorPlayerPawn' has a wrong offset!");

}

#pragma pack(pop)
