#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_NinjaTriggeredAbility

#include "Basic.hpp"

#include "GAT_TriggeredAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GAT_NinjaTriggeredAbility.GAT_NinjaTriggeredAbility_C
// 0x0060 (0x0740 - 0x06E0)
class UGAT_NinjaTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_NinjaTriggeredAbility_C;        // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Ninja_C*                    NinjaPlayerPawn;                                   // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     Event_Data;                                        // 0x06E8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAT_NinjaTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_NinjaTriggeredAbility_C">();
	}
	static class UGAT_NinjaTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_NinjaTriggeredAbility_C>();
	}
};
static_assert(alignof(UGAT_NinjaTriggeredAbility_C) == 0x000004, "Wrong alignment on UGAT_NinjaTriggeredAbility_C");
static_assert(sizeof(UGAT_NinjaTriggeredAbility_C) == 0x000740, "Wrong size on UGAT_NinjaTriggeredAbility_C");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, UberGraphFrame_GAT_NinjaTriggeredAbility_C) == 0x0006E0, "Member 'UGAT_NinjaTriggeredAbility_C::UberGraphFrame_GAT_NinjaTriggeredAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, NinjaPlayerPawn) == 0x0006E4, "Member 'UGAT_NinjaTriggeredAbility_C::NinjaPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, Event_Data) == 0x0006E8, "Member 'UGAT_NinjaTriggeredAbility_C::Event_Data' has a wrong offset!");

}

#pragma pack(pop)
