#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HB_CommandCenter_Main

#include "Basic.hpp"

#include "MyTown_Building_Master_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HB_CommandCenter_Main.HB_CommandCenter_Main_C
// 0x000C (0x051C - 0x0510)
class AHB_CommandCenter_Main_C final : public AMyTown_Building_Master_C
{
public:
	class UAudioComponent*                        Building_Ambience_Sound;                           // 0x0510(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USkeletalMeshComponent*                 HomebaseAtlas;                                     // 0x0514(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USkeletalMesh*                          HomebaseAtlasMesh;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HB_CommandCenter_Main_C">();
	}
	static class AHB_CommandCenter_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHB_CommandCenter_Main_C>();
	}
};
static_assert(alignof(AHB_CommandCenter_Main_C) == 0x000004, "Wrong alignment on AHB_CommandCenter_Main_C");
static_assert(sizeof(AHB_CommandCenter_Main_C) == 0x00051C, "Wrong size on AHB_CommandCenter_Main_C");
static_assert(offsetof(AHB_CommandCenter_Main_C, Building_Ambience_Sound) == 0x000510, "Member 'AHB_CommandCenter_Main_C::Building_Ambience_Sound' has a wrong offset!");
static_assert(offsetof(AHB_CommandCenter_Main_C, HomebaseAtlas) == 0x000514, "Member 'AHB_CommandCenter_Main_C::HomebaseAtlas' has a wrong offset!");
static_assert(offsetof(AHB_CommandCenter_Main_C, HomebaseAtlasMesh) == 0x000518, "Member 'AHB_CommandCenter_Main_C::HomebaseAtlasMesh' has a wrong offset!");

}

#pragma pack(pop)
