#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HB_CommandCenter_Main

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HB_CommandCenter_Main.HB_CommandCenter_Main_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct HB_CommandCenter_Main_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0054(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(HB_CommandCenter_Main_C_UserConstructionScript) == 0x000010, "Wrong alignment on HB_CommandCenter_Main_C_UserConstructionScript");
static_assert(sizeof(HB_CommandCenter_Main_C_UserConstructionScript) == 0x0000E0, "Wrong size on HB_CommandCenter_Main_C_UserConstructionScript");
static_assert(offsetof(HB_CommandCenter_Main_C_UserConstructionScript, CallFunc_GetSocketTransform_ReturnValue) == 0x000000, "Member 'HB_CommandCenter_Main_C_UserConstructionScript::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HB_CommandCenter_Main_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000030, "Member 'HB_CommandCenter_Main_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(HB_CommandCenter_Main_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'HB_CommandCenter_Main_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(HB_CommandCenter_Main_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'HB_CommandCenter_Main_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(HB_CommandCenter_Main_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000054, "Member 'HB_CommandCenter_Main_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

#pragma pack(pop)
