#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HB_Placement

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HB_Placement.HB_Placement_C.UserConstructionScript
// 0x001C (0x001C - 0x0000)
struct HB_Placement_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x000C)()
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor)
};
static_assert(alignof(HB_Placement_C_UserConstructionScript) == 0x000004, "Wrong alignment on HB_Placement_C_UserConstructionScript");
static_assert(sizeof(HB_Placement_C_UserConstructionScript) == 0x00001C, "Wrong size on HB_Placement_C_UserConstructionScript");
static_assert(offsetof(HB_Placement_C_UserConstructionScript, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'HB_Placement_C_UserConstructionScript::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HB_Placement_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x00000C, "Member 'HB_Placement_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(HB_Placement_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'HB_Placement_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
