#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HB_RoadManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Path_structs.hpp"
#include "RoadPathConnections_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HB_RoadManager.HB_RoadManager_C
// 0x0050 (0x0290 - 0x0240)
class AHB_RoadManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard1;                                        // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         UpgradeTimeline_Value_5B44A914459EF36B289CBE91AAD4022E; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            UpgradeTimeline__Direction_5B44A914459EF36B289CBE91AAD4022E; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     UpgradeTimeline;                                   // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FPath>                          UpgradePaths;                                      // 0x0254(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                 UpgradePathProgression;                            // 0x0260(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          DisplayAllRoads;                                   // 0x026C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GlobalRoadDebug;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<int32>                                 UpgradeBuildingID;                                 // 0x0274(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         TempProgressionValue;                              // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<int32>                                 CurrentPathIndices;                                // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HB_RoadManager(int32 EntryPoint);
	void SetPathProgression(int32 ID, float ProgressionValue);
	void StartPathUpgradeAnimation(int32 ID, float ProgressValue);
	void UpgradeTimeline__UpdateFunc();
	void UpgradeTimeline__FinishedFunc();
	void UserConstructionScript();
	void UpgradePath(int32 INDEX);
	void DebugAllRoads();
	void Set_Path(float ProgressValue, int32 INDEX);
	void ResetAllPaths();
	void FindAllPaths(int32 ID, TArray<int32>* IndexArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HB_RoadManager_C">();
	}
	static class AHB_RoadManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHB_RoadManager_C>();
	}
};
static_assert(alignof(AHB_RoadManager_C) == 0x000004, "Wrong alignment on AHB_RoadManager_C");
static_assert(sizeof(AHB_RoadManager_C) == 0x000290, "Wrong size on AHB_RoadManager_C");
static_assert(offsetof(AHB_RoadManager_C, UberGraphFrame) == 0x000240, "Member 'AHB_RoadManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, Billboard1) == 0x000244, "Member 'AHB_RoadManager_C::Billboard1' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradeTimeline_Value_5B44A914459EF36B289CBE91AAD4022E) == 0x000248, "Member 'AHB_RoadManager_C::UpgradeTimeline_Value_5B44A914459EF36B289CBE91AAD4022E' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradeTimeline__Direction_5B44A914459EF36B289CBE91AAD4022E) == 0x00024C, "Member 'AHB_RoadManager_C::UpgradeTimeline__Direction_5B44A914459EF36B289CBE91AAD4022E' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradeTimeline) == 0x000250, "Member 'AHB_RoadManager_C::UpgradeTimeline' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradePaths) == 0x000254, "Member 'AHB_RoadManager_C::UpgradePaths' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradePathProgression) == 0x000260, "Member 'AHB_RoadManager_C::UpgradePathProgression' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, DisplayAllRoads) == 0x00026C, "Member 'AHB_RoadManager_C::DisplayAllRoads' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, GlobalRoadDebug) == 0x000270, "Member 'AHB_RoadManager_C::GlobalRoadDebug' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, UpgradeBuildingID) == 0x000274, "Member 'AHB_RoadManager_C::UpgradeBuildingID' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, TempProgressionValue) == 0x000280, "Member 'AHB_RoadManager_C::TempProgressionValue' has a wrong offset!");
static_assert(offsetof(AHB_RoadManager_C, CurrentPathIndices) == 0x000284, "Member 'AHB_RoadManager_C::CurrentPathIndices' has a wrong offset!");

}

#pragma pack(pop)
