#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboarding_RecruitHero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HBOnboarding_RecruitHero.HBOnboarding_RecruitHero_C
// 0x0040 (0x061C - 0x05DC)
class AHBOnboarding_RecruitHero_C final : public AFortTutorialNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Ray_ONB_OutpostNew_440_Cue;                        // 0x05E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_OutpostNew_430_Cue;                        // 0x05E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_09_Cue;                       // 0x05E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_08_Cue;                       // 0x05EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_07_Cue;                       // 0x05F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class FText                                   Recruit_Hero_1;                                    // 0x05F8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Recruit_Hero_2;                                    // 0x0604(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Recruit_Hero_3;                                    // 0x0610(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HBOnboarding_RecruitHero(int32 EntryPoint);
	void HandleClientEvent_HeroesTabSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_QuestJournalSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_HomebaseRecruitedHero(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_RecruitHeroExpanded(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void OnNotificationStart();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HBOnboarding_RecruitHero_C">();
	}
	static class AHBOnboarding_RecruitHero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHBOnboarding_RecruitHero_C>();
	}
};
static_assert(alignof(AHBOnboarding_RecruitHero_C) == 0x000004, "Wrong alignment on AHBOnboarding_RecruitHero_C");
static_assert(sizeof(AHBOnboarding_RecruitHero_C) == 0x00061C, "Wrong size on AHBOnboarding_RecruitHero_C");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, UberGraphFrame) == 0x0005DC, "Member 'AHBOnboarding_RecruitHero_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Ray_ONB_OutpostNew_440_Cue) == 0x0005E0, "Member 'AHBOnboarding_RecruitHero_C::Ray_ONB_OutpostNew_440_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Ray_ONB_OutpostNew_430_Cue) == 0x0005E4, "Member 'AHBOnboarding_RecruitHero_C::Ray_ONB_OutpostNew_430_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Ray_ONB_HomeBaseFlow_09_Cue) == 0x0005E8, "Member 'AHBOnboarding_RecruitHero_C::Ray_ONB_HomeBaseFlow_09_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Ray_ONB_HomeBaseFlow_08_Cue) == 0x0005EC, "Member 'AHBOnboarding_RecruitHero_C::Ray_ONB_HomeBaseFlow_08_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Ray_ONB_HomeBaseFlow_07_Cue) == 0x0005F0, "Member 'AHBOnboarding_RecruitHero_C::Ray_ONB_HomeBaseFlow_07_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, DefaultSceneRoot) == 0x0005F4, "Member 'AHBOnboarding_RecruitHero_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Recruit_Hero_1) == 0x0005F8, "Member 'AHBOnboarding_RecruitHero_C::Recruit_Hero_1' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Recruit_Hero_2) == 0x000604, "Member 'AHBOnboarding_RecruitHero_C::Recruit_Hero_2' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_RecruitHero_C, Recruit_Hero_3) == 0x000610, "Member 'AHBOnboarding_RecruitHero_C::Recruit_Hero_3' has a wrong offset!");

}

#pragma pack(pop)
