#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboarding_NameHomebase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HBOnboarding_NameHomebase.HBOnboarding_NameHomebase_C
// 0x0038 (0x0614 - 0x05DC)
class AHBOnboarding_NameHomebase_C final : public AFortTutorialNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_03_Cue;                       // 0x05E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_02_Cue;                       // 0x05E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_01_Cue;                       // 0x05E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class FText                                   Name_Home_Base_1;                                  // 0x05F0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Name_Home_Base_2;                                  // 0x05FC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Name_Home_Base_3;                                  // 0x0608(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HBOnboarding_NameHomebase(int32 EntryPoint);
	void OnNotificationStart();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HBOnboarding_NameHomebase_C">();
	}
	static class AHBOnboarding_NameHomebase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHBOnboarding_NameHomebase_C>();
	}
};
static_assert(alignof(AHBOnboarding_NameHomebase_C) == 0x000004, "Wrong alignment on AHBOnboarding_NameHomebase_C");
static_assert(sizeof(AHBOnboarding_NameHomebase_C) == 0x000614, "Wrong size on AHBOnboarding_NameHomebase_C");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, UberGraphFrame) == 0x0005DC, "Member 'AHBOnboarding_NameHomebase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Ray_ONB_HomeBaseFlow_03_Cue) == 0x0005E0, "Member 'AHBOnboarding_NameHomebase_C::Ray_ONB_HomeBaseFlow_03_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Ray_ONB_HomeBaseFlow_02_Cue) == 0x0005E4, "Member 'AHBOnboarding_NameHomebase_C::Ray_ONB_HomeBaseFlow_02_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Ray_ONB_HomeBaseFlow_01_Cue) == 0x0005E8, "Member 'AHBOnboarding_NameHomebase_C::Ray_ONB_HomeBaseFlow_01_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, DefaultSceneRoot) == 0x0005EC, "Member 'AHBOnboarding_NameHomebase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Name_Home_Base_1) == 0x0005F0, "Member 'AHBOnboarding_NameHomebase_C::Name_Home_Base_1' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Name_Home_Base_2) == 0x0005FC, "Member 'AHBOnboarding_NameHomebase_C::Name_Home_Base_2' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_NameHomebase_C, Name_Home_Base_3) == 0x000608, "Member 'AHBOnboarding_NameHomebase_C::Name_Home_Base_3' has a wrong offset!");

}

#pragma pack(pop)
