#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboarding_PlaySatelliteCine

#include "Basic.hpp"

#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C.ExecuteUbergraph_HBOnboarding_PlaySatelliteCine
// 0x0074 (0x0074 - 0x0000)
struct HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0004(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x002C(0x0004)()
	TArray<class AMatineeActor*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x000C)(ZeroConstructor, ReferenceParm)
	class AMatineeActor*                          CallFunc_Array_Get_Item2;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue2; // 0x0048(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item3;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate2;        // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine) == 0x000004, "Wrong alignment on HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine");
static_assert(sizeof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine) == 0x000074, "Wrong size on HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, EntryPoint) == 0x000000, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::EntryPoint' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000004, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, Temp_int_Array_Index_Variable) == 0x000010, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Array_Get_Item) == 0x000014, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, UniqueObjectNameForCooking_OutputDelegate) == 0x00001C, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x00002C, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Array_Get_Item2) == 0x00003C, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_ActorHasTag_ReturnValue) == 0x000044, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_GetLocalFortPlayerControllers_ReturnValue2) == 0x000048, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_GetLocalFortPlayerControllers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Array_Get_Item3) == 0x000054, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, UniqueObjectNameForCooking_OutputDelegate2) == 0x000058, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::UniqueObjectNameForCooking_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Less_IntInt_ReturnValue) == 0x00006D, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'HBOnboarding_PlaySatelliteCine_C_ExecuteUbergraph_HBOnboarding_PlaySatelliteCine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
