#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboarding_BuildHeroBuilding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C
// 0x0040 (0x061C - 0x05DC)
class AHBOnboarding_BuildHeroBuilding_C final : public AFortTutorialNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        onboarding_pulse_Cue;                              // 0x05E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_OutpostNew_420_Cue;                        // 0x05E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_05_Cue;                       // 0x05E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_06_Cue;                       // 0x05EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ray_ONB_HomeBaseFlow_04_Cue;                       // 0x05F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          WaitingForBuilding;                                // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyTownBuildingDefinitionData*          SoldierBuilding;                                   // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMyTownBuildingDefinitionData*          ConstructorBuilding;                               // 0x0600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   Recruit;                                           // 0x0604(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Home_Base_Intro;                                   // 0x0610(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();
	void OnNotificationStart();
	void HandleClientEvent_OnboardingBuildingsStage2(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_BuildingSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_HomebaseBuiltBuilding(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void finished();
	void ExecuteUbergraph_HBOnboarding_BuildHeroBuilding(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HBOnboarding_BuildHeroBuilding_C">();
	}
	static class AHBOnboarding_BuildHeroBuilding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHBOnboarding_BuildHeroBuilding_C>();
	}
};
static_assert(alignof(AHBOnboarding_BuildHeroBuilding_C) == 0x000004, "Wrong alignment on AHBOnboarding_BuildHeroBuilding_C");
static_assert(sizeof(AHBOnboarding_BuildHeroBuilding_C) == 0x00061C, "Wrong size on AHBOnboarding_BuildHeroBuilding_C");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, UberGraphFrame) == 0x0005DC, "Member 'AHBOnboarding_BuildHeroBuilding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, onboarding_pulse_Cue) == 0x0005E0, "Member 'AHBOnboarding_BuildHeroBuilding_C::onboarding_pulse_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Ray_ONB_OutpostNew_420_Cue) == 0x0005E4, "Member 'AHBOnboarding_BuildHeroBuilding_C::Ray_ONB_OutpostNew_420_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Ray_ONB_HomeBaseFlow_05_Cue) == 0x0005E8, "Member 'AHBOnboarding_BuildHeroBuilding_C::Ray_ONB_HomeBaseFlow_05_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Ray_ONB_HomeBaseFlow_06_Cue) == 0x0005EC, "Member 'AHBOnboarding_BuildHeroBuilding_C::Ray_ONB_HomeBaseFlow_06_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Ray_ONB_HomeBaseFlow_04_Cue) == 0x0005F0, "Member 'AHBOnboarding_BuildHeroBuilding_C::Ray_ONB_HomeBaseFlow_04_Cue' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, DefaultSceneRoot) == 0x0005F4, "Member 'AHBOnboarding_BuildHeroBuilding_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, WaitingForBuilding) == 0x0005F8, "Member 'AHBOnboarding_BuildHeroBuilding_C::WaitingForBuilding' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, SoldierBuilding) == 0x0005FC, "Member 'AHBOnboarding_BuildHeroBuilding_C::SoldierBuilding' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, ConstructorBuilding) == 0x000600, "Member 'AHBOnboarding_BuildHeroBuilding_C::ConstructorBuilding' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Recruit) == 0x000604, "Member 'AHBOnboarding_BuildHeroBuilding_C::Recruit' has a wrong offset!");
static_assert(offsetof(AHBOnboarding_BuildHeroBuilding_C, Home_Base_Intro) == 0x000610, "Member 'AHBOnboarding_BuildHeroBuilding_C::Home_Base_Intro' has a wrong offset!");

}

#pragma pack(pop)
