#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass HeroListWidget.HeroListWidget_C
// 0x001C (0x01D4 - 0x01B8)
class UHeroListWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           _VerticalBox__Hero_List;                           // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UHeroListItemWidget_C*>          Hero_Item_Widgets;                                 // 0x01C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   TabGroupName;                                      // 0x01CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeroListWidget(int32 EntryPoint);
	void Construct();
	void On_Hero_Selected(class UFortBaseButton* Hero_List_Item, bool SELECTED);
	void Update_Hero_List();
	void Refresh_Hero_List();
	void Set_Tab_Group_Name();
	void On_Hero_Created(bool Success);
	void On_Hero_Deleted(bool Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroListWidget_C">();
	}
	static class UHeroListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroListWidget_C>();
	}
};
static_assert(alignof(UHeroListWidget_C) == 0x000004, "Wrong alignment on UHeroListWidget_C");
static_assert(sizeof(UHeroListWidget_C) == 0x0001D4, "Wrong size on UHeroListWidget_C");
static_assert(offsetof(UHeroListWidget_C, UberGraphFrame) == 0x0001B8, "Member 'UHeroListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroListWidget_C, _VerticalBox__Hero_List) == 0x0001BC, "Member 'UHeroListWidget_C::_VerticalBox__Hero_List' has a wrong offset!");
static_assert(offsetof(UHeroListWidget_C, Hero_Item_Widgets) == 0x0001C0, "Member 'UHeroListWidget_C::Hero_Item_Widgets' has a wrong offset!");
static_assert(offsetof(UHeroListWidget_C, TabGroupName) == 0x0001CC, "Member 'UHeroListWidget_C::TabGroupName' has a wrong offset!");

}

#pragma pack(pop)
