#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroCoreStat

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// UserDefinedStruct HeroCoreStat.HeroCoreStat
// 0x02D4 (0x02D4 - 0x0000)
struct FHeroCoreStat final
{
public:
	struct FGameplayAttribute                     Attribute_2_859C1FB14ABE4A72207022AB0F1427C4;      // 0x0000(0x0004)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    Icon_10_9D04FBD74360020AB7F4218AE9EBD958;          // 0x0004(0x02B8)(Edit, BlueprintVisible)
	class FText                                   Name_5_252242B144B4F7E24E2AE1A24ECF0B7B;           // 0x02BC(0x000C)(Edit, BlueprintVisible)
	class FText                                   Description_7_9356C1674E7568A4B47D958509333360;    // 0x02C8(0x000C)(Edit, BlueprintVisible)
};
static_assert(alignof(FHeroCoreStat) == 0x000004, "Wrong alignment on FHeroCoreStat");
static_assert(sizeof(FHeroCoreStat) == 0x0002D4, "Wrong size on FHeroCoreStat");
static_assert(offsetof(FHeroCoreStat, Attribute_2_859C1FB14ABE4A72207022AB0F1427C4) == 0x000000, "Member 'FHeroCoreStat::Attribute_2_859C1FB14ABE4A72207022AB0F1427C4' has a wrong offset!");
static_assert(offsetof(FHeroCoreStat, Icon_10_9D04FBD74360020AB7F4218AE9EBD958) == 0x000004, "Member 'FHeroCoreStat::Icon_10_9D04FBD74360020AB7F4218AE9EBD958' has a wrong offset!");
static_assert(offsetof(FHeroCoreStat, Name_5_252242B144B4F7E24E2AE1A24ECF0B7B) == 0x0002BC, "Member 'FHeroCoreStat::Name_5_252242B144B4F7E24E2AE1A24ECF0B7B' has a wrong offset!");
static_assert(offsetof(FHeroCoreStat, Description_7_9356C1674E7568A4B47D958509333360) == 0x0002C8, "Member 'FHeroCoreStat::Description_7_9356C1674E7568A4B47D958509333360' has a wrong offset!");

}

#pragma pack(pop)
