#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroTrait_Widget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HeroTrait_Widget.HeroTrait_Widget_C.ExecuteUbergraph_HeroTrait_Widget
// 0x0038 (0x0038 - 0x0000)
struct HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 INDEX, bool SELECTED)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHeroAbility_Widget_C*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHeroAbility_Widget_C*>          K2Node_MakeArray_Array;                            // 0x002C(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget) == 0x000004, "Wrong alignment on HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget");
static_assert(sizeof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget) == 0x000038, "Wrong size on HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, EntryPoint) == 0x000000, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, Temp_int_Variable) == 0x000004, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, CallFunc_Array_Get_Item) == 0x000020, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget, K2Node_MakeArray_Array) == 0x00002C, "Member 'HeroTrait_Widget_C_ExecuteUbergraph_HeroTrait_Widget::K2Node_MakeArray_Array' has a wrong offset!");

// Function HeroTrait_Widget.HeroTrait_Widget_C.Update
// 0x012C (0x012C - 0x0000)
struct HeroTrait_Widget_C_Update final
{
public:
	class UFortTrait*                             Trait;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         INDEX;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_GetIconBrush_IconBrush;                   // 0x000C(0x0074)()
	TArray<struct FFortAbilityKitSlot>            CallFunc_GetAbilityKitSlots_ReturnValue;           // 0x0080(0x000C)(ZeroConstructor, ReferenceParm)
	struct FFortAbilityKitSlot                    CallFunc_Array_Get_Item;                           // 0x008C(0x000C)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_Array_Get_Item2;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumUnspentAbilityPoints_NumAbilityPoints; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNumUnspentAbilityPoints_ReturnValue;   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityCost_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillTreeUnlocked_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTraitDepth_Depth;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTraitDepth_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHeroAbility_Widget_C*                  CallFunc_Array_Get_Item3;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Cost_Aggregate;                                    // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroTrait_Widget_C_Update) == 0x000004, "Wrong alignment on HeroTrait_Widget_C_Update");
static_assert(sizeof(HeroTrait_Widget_C_Update) == 0x00012C, "Wrong size on HeroTrait_Widget_C_Update");
static_assert(offsetof(HeroTrait_Widget_C_Update, Trait) == 0x000000, "Member 'HeroTrait_Widget_C_Update::Trait' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, INDEX) == 0x000004, "Member 'HeroTrait_Widget_C_Update::INDEX' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_int_Array_Index_Variable) == 0x000008, "Member 'HeroTrait_Widget_C_Update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetIconBrush_IconBrush) == 0x00000C, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetIconBrush_IconBrush' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetAbilityKitSlots_ReturnValue) == 0x000080, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetAbilityKitSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Array_Get_Item) == 0x00008C, "Member 'HeroTrait_Widget_C_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'HeroTrait_Widget_C_Update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'HeroTrait_Widget_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Array_Get_Item2) == 0x0000A0, "Member 'HeroTrait_Widget_C_Update::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_IsValid_ReturnValue2) == 0x0000A4, "Member 'HeroTrait_Widget_C_Update::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'HeroTrait_Widget_C_Update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'HeroTrait_Widget_C_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'HeroTrait_Widget_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_int_Variable) == 0x0000B4, "Member 'HeroTrait_Widget_C_Update::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetContext_ReturnValue) == 0x0000B8, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_struct_Variable) == 0x0000BC, "Member 'HeroTrait_Widget_C_Update::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetNumUnspentAbilityPoints_NumAbilityPoints) == 0x0000CC, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetNumUnspentAbilityPoints_NumAbilityPoints' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetNumUnspentAbilityPoints_ReturnValue) == 0x0000D0, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetNumUnspentAbilityPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetAbilityCost_ReturnValue) == 0x0000D4, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_IsSkillTreeUnlocked_ReturnValue) == 0x0000D8, "Member 'HeroTrait_Widget_C_Update::CallFunc_IsSkillTreeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetTraitDepth_Depth) == 0x0000DC, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetTraitDepth_Depth' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GetTraitDepth_ReturnValue) == 0x0000E0, "Member 'HeroTrait_Widget_C_Update::CallFunc_GetTraitDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_struct_Variable2) == 0x0000E4, "Member 'HeroTrait_Widget_C_Update::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_BooleanAND_ReturnValue) == 0x0000F4, "Member 'HeroTrait_Widget_C_Update::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'HeroTrait_Widget_C_Update::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_bool_Variable) == 0x0000FC, "Member 'HeroTrait_Widget_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000FD, "Member 'HeroTrait_Widget_C_Update::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, K2Node_Select_Default) == 0x000100, "Member 'HeroTrait_Widget_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Array_Get_Item3) == 0x000110, "Member 'HeroTrait_Widget_C_Update::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_bool_Variable2) == 0x000114, "Member 'HeroTrait_Widget_C_Update::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_byte_Variable) == 0x000115, "Member 'HeroTrait_Widget_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, K2Node_Select2_Default) == 0x000118, "Member 'HeroTrait_Widget_C_Update::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_Add_IntInt_ReturnValue2) == 0x00011C, "Member 'HeroTrait_Widget_C_Update::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_byte_Variable2) == 0x000120, "Member 'HeroTrait_Widget_C_Update::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Temp_bool_Variable3) == 0x000121, "Member 'HeroTrait_Widget_C_Update::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, K2Node_Select3_Default) == 0x000122, "Member 'HeroTrait_Widget_C_Update::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000123, "Member 'HeroTrait_Widget_C_Update::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, CallFunc_BooleanOR_ReturnValue) == 0x000124, "Member 'HeroTrait_Widget_C_Update::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Update, Cost_Aggregate) == 0x000128, "Member 'HeroTrait_Widget_C_Update::Cost_Aggregate' has a wrong offset!");

// Function HeroTrait_Widget.HeroTrait_Widget_C.Get Primary Trait Tooltip
// 0x002C (0x002C - 0x0000)
struct HeroTrait_Widget_C_Get_Primary_Trait_Tooltip final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetDescription_ReturnValue;               // 0x0010(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x001C(0x000C)()
	class UUserWidget*                            CallFunc_Create_Basic_Multi_Line_Tooltip_Output;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip) == 0x000004, "Wrong alignment on HeroTrait_Widget_C_Get_Primary_Trait_Tooltip");
static_assert(sizeof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip) == 0x00002C, "Wrong size on HeroTrait_Widget_C_Get_Primary_Trait_Tooltip");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, ReturnValue) == 0x000000, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_GetOwningPlayer_ReturnValue) == 0x000004, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_Create_Basic_Tooltip_Output) == 0x000008, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_GetDescription_ReturnValue) == 0x000010, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_GetDisplayName_ReturnValue) == 0x00001C, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_Get_Primary_Trait_Tooltip, CallFunc_Create_Basic_Multi_Line_Tooltip_Output) == 0x000028, "Member 'HeroTrait_Widget_C_Get_Primary_Trait_Tooltip::CallFunc_Create_Basic_Multi_Line_Tooltip_Output' has a wrong offset!");

// Function HeroTrait_Widget.HeroTrait_Widget_C.On Ability Selected
// 0x001C (0x001C - 0x0000)
struct HeroTrait_Widget_C_On_Ability_Selected final
{
public:
	int32                                         INDEX;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanModifyTraitDepth_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestSetTraitDepth_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroTrait_Widget_C_On_Ability_Selected) == 0x000004, "Wrong alignment on HeroTrait_Widget_C_On_Ability_Selected");
static_assert(sizeof(HeroTrait_Widget_C_On_Ability_Selected) == 0x00001C, "Wrong size on HeroTrait_Widget_C_On_Ability_Selected");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, INDEX) == 0x000000, "Member 'HeroTrait_Widget_C_On_Ability_Selected::INDEX' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, SELECTED) == 0x000004, "Member 'HeroTrait_Widget_C_On_Ability_Selected::SELECTED' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'HeroTrait_Widget_C_On_Ability_Selected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, CallFunc_GetContext_ReturnValue) == 0x00000C, "Member 'HeroTrait_Widget_C_On_Ability_Selected::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, Temp_bool_Variable) == 0x000010, "Member 'HeroTrait_Widget_C_On_Ability_Selected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, CallFunc_CanModifyTraitDepth_ReturnValue) == 0x000011, "Member 'HeroTrait_Widget_C_On_Ability_Selected::CallFunc_CanModifyTraitDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, K2Node_Select_Default) == 0x000014, "Member 'HeroTrait_Widget_C_On_Ability_Selected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroTrait_Widget_C_On_Ability_Selected, CallFunc_RequestSetTraitDepth_ReturnValue) == 0x000018, "Member 'HeroTrait_Widget_C_On_Ability_Selected::CallFunc_RequestSetTraitDepth_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
