#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroInfoLibrary

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "HeroCoreStatSet_structs.hpp"
#include "HeroCoreStat_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HeroInfoLibrary.HeroInfoLibrary_C.Get Core Stats By Hero ID
// 0x0BDC (0x0BDC - 0x0000)
struct HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID final
{
public:
	class FString                                 Hero_ID;                                           // 0x0000(0x000C)(Parm, ZeroConstructor)
	struct FHeroCoreStatSet                       UI_Data;                                           // 0x000C(0x0B50)(Parm)
	class UObject*                                __WorldContext;                                    // 0x0B5C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FHeroCoreStat>                  Data;                                              // 0x0B60(0x000C)(Parm, OutParm, ZeroConstructor)
	TArray<float>                                 Values;                                            // 0x0B6C(0x000C)(Parm, OutParm, ZeroConstructor)
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue;                   // 0x0B78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FHeroCoreStat>                  K2Node_MakeArray_Array;                            // 0x0B7C(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 K2Node_MakeArray_Array2;                           // 0x0B88(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<struct FGameplayAttribute>             K2Node_MakeArray_Array3;                           // 0x0B94(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetAttributeValuesArrayFromID_Values;     // 0x0BA0(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetAttributeValuesArrayFromID_ReturnValue; // 0x0BAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BAD[0x3];                                      // 0x0BAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHeroCoreStat>                  K2Node_MakeArray_Array4;                           // 0x0BB0(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0BC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC2[0x2];                                      // 0x0BC2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHeroCoreStat>                  StatArray;                                         // 0x0BC4(0x000C)(Edit, ZeroConstructor)
	TArray<float>                                 ValueArray;                                        // 0x0BD0(0x000C)(Edit, ZeroConstructor)
};
static_assert(alignof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID) == 0x000004, "Wrong alignment on HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID");
static_assert(sizeof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID) == 0x000BDC, "Wrong size on HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, Hero_ID) == 0x000000, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::Hero_ID' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, UI_Data) == 0x00000C, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::UI_Data' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, __WorldContext) == 0x000B5C, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::__WorldContext' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, Data) == 0x000B60, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::Data' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, Values) == 0x000B6C, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::Values' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_GetContext_ReturnValue) == 0x000B78, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, K2Node_MakeArray_Array) == 0x000B7C, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, K2Node_MakeArray_Array2) == 0x000B88, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, K2Node_MakeArray_Array3) == 0x000B94, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_GetAttributeValuesArrayFromID_Values) == 0x000BA0, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_GetAttributeValuesArrayFromID_Values' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_GetAttributeValuesArrayFromID_ReturnValue) == 0x000BAC, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_GetAttributeValuesArrayFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, K2Node_MakeArray_Array4) == 0x000BB0, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_Array_Length_ReturnValue) == 0x000BBC, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000BC0, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, CallFunc_BooleanAND_ReturnValue) == 0x000BC1, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, StatArray) == 0x000BC4, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::StatArray' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID, ValueArray) == 0x000BD0, "Member 'HeroInfoLibrary_C_Get_Core_Stats_By_Hero_ID::ValueArray' has a wrong offset!");

// Function HeroInfoLibrary.HeroInfoLibrary_C.Get Current Hero Core Stats
// 0x0048 (0x0048 - 0x0000)
struct HeroInfoLibrary_C_Get_Current_Hero_Core_Stats final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FHeroCoreStat>                  Data;                                              // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor)
	TArray<float>                                 Values;                                            // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor)
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCurrentHeroID_HeroID;                  // 0x0020(0x000C)(ZeroConstructor)
	bool                                          CallFunc_GetCurrentHeroID_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHeroCoreStat>                  CallFunc_Get_Core_Stats_By_Hero_ID_Data;           // 0x0030(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_Get_Core_Stats_By_Hero_ID_Values;         // 0x003C(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats) == 0x000004, "Wrong alignment on HeroInfoLibrary_C_Get_Current_Hero_Core_Stats");
static_assert(sizeof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats) == 0x000048, "Wrong size on HeroInfoLibrary_C_Get_Current_Hero_Core_Stats");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, __WorldContext) == 0x000000, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::__WorldContext' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, Data) == 0x000004, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::Data' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, Values) == 0x000010, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::Values' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, CallFunc_GetContext_ReturnValue) == 0x00001C, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, CallFunc_GetCurrentHeroID_HeroID) == 0x000020, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::CallFunc_GetCurrentHeroID_HeroID' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, CallFunc_GetCurrentHeroID_ReturnValue) == 0x00002C, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::CallFunc_GetCurrentHeroID_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, CallFunc_Get_Core_Stats_By_Hero_ID_Data) == 0x000030, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::CallFunc_Get_Core_Stats_By_Hero_ID_Data' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Current_Hero_Core_Stats, CallFunc_Get_Core_Stats_By_Hero_ID_Values) == 0x00003C, "Member 'HeroInfoLibrary_C_Get_Current_Hero_Core_Stats::CallFunc_Get_Core_Stats_By_Hero_ID_Values' has a wrong offset!");

// Function HeroInfoLibrary.HeroInfoLibrary_C.Get Core Stat By Hero ID
// 0x1418 (0x1418 - 0x0000)
struct HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID final
{
public:
	class FString                                 Hero_ID;                                           // 0x0000(0x000C)(Parm, ZeroConstructor)
	struct FGameplayAttribute                     Attribute;                                         // 0x000C(0x0004)(Parm)
	struct FHeroCoreStatSet                       UI_Data;                                           // 0x0010(0x0B50)(Parm)
	class UObject*                                __WorldContext;                                    // 0x0B60(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHeroCoreStat                          Stat;                                              // 0x0B64(0x02D4)(Parm, OutParm)
	float                                         Value;                                             // 0x0E38(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0E3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3D[0x3];                                      // 0x0E3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue;                   // 0x0E40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAttributeValueFromID_ReturnValue;      // 0x0E44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0E48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E49[0x3];                                      // 0x0E49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0E4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FHeroCoreStat>                  K2Node_MakeArray_Array;                            // 0x0E50(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0E5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHeroCoreStat                          CallFunc_Array_Get_Item;                           // 0x0E60(0x02D4)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayAttributeGameplayAttribute_ReturnValue; // 0x1138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113A[0x2];                                     // 0x113A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x113C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x1140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1141[0x3];                                     // 0x1141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHeroCoreStat                          Stat_Data;                                         // 0x1144(0x02D4)(Edit)
};
static_assert(alignof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID) == 0x000004, "Wrong alignment on HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID");
static_assert(sizeof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID) == 0x001418, "Wrong size on HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Hero_ID) == 0x000000, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Hero_ID' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Attribute) == 0x00000C, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Attribute' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, UI_Data) == 0x000010, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::UI_Data' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, __WorldContext) == 0x000B60, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::__WorldContext' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Stat) == 0x000B64, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Stat' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Value) == 0x000E38, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Value' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Temp_bool_True_if_break_was_hit_Variable) == 0x000E3C, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_GetContext_ReturnValue) == 0x000E40, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_GetAttributeValueFromID_ReturnValue) == 0x000E44, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_GetAttributeValueFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_Not_PreBool_ReturnValue) == 0x000E48, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Temp_int_Array_Index_Variable) == 0x000E4C, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, K2Node_MakeArray_Array) == 0x000E50, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_Array_Length_ReturnValue) == 0x000E5C, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_Array_Get_Item) == 0x000E60, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Temp_int_Loop_Counter_Variable) == 0x001134, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_EqualEqual_GameplayAttributeGameplayAttribute_ReturnValue) == 0x001138, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_EqualEqual_GameplayAttributeGameplayAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_Less_IntInt_ReturnValue) == 0x001139, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_Add_IntInt_ReturnValue) == 0x00113C, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, CallFunc_BooleanAND_ReturnValue) == 0x001140, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID, Stat_Data) == 0x001144, "Member 'HeroInfoLibrary_C_Get_Core_Stat_By_Hero_ID::Stat_Data' has a wrong offset!");

}

#pragma pack(pop)
