#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeBaseCamera_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.ExecuteUbergraph_HomeBaseCamera_Blueprint
// 0x0288 (0x0288 - 0x0000)
struct HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCameraComponent*                       K2Node_Event_BuildingCameraComponent;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x005C(0x000C)(ZeroConstructor, ReferenceParm)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LimitTo_ReturnValue;                      // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0098(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBusy_IsBusy;                            // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBusy_IsBusy2;                           // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBusy_IsBusy3;                           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBusy_IsBusy4;                           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue2;                       // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0154(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue2;                       // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult2; // 0x01E4(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue2; // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   UniqueObjectNameForCooking_Key;                    // 0x0268(0x0010)()
	struct FKey                                   UniqueObjectNameForCooking_Key2;                   // 0x0278(0x0010)()
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint) == 0x000288, "Wrong size on HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, EntryPoint) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000004, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaX) == 0x000008, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaY) == 0x00000C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaY' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000014, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_FClamp_ReturnValue) == 0x00002C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_FClamp_ReturnValue2) == 0x000034, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, K2Node_Event_BuildingCameraComponent) == 0x00003C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::K2Node_Event_BuildingCameraComponent' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00004C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue2) == 0x000058, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x00005C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000068, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x00007C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_LimitTo_ReturnValue) == 0x00008C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_LimitTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000098, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000118, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue2) == 0x00011A, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_IsBusy_IsBusy) == 0x00011B, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_IsBusy_IsBusy' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_IsBusy_IsBusy2) == 0x00011C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_IsBusy_IsBusy2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue3) == 0x00011D, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue4) == 0x00011E, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_BooleanAND_ReturnValue2) == 0x00011F, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_BooleanAND_ReturnValue3) == 0x000120, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_IsBusy_IsBusy3) == 0x000121, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_IsBusy_IsBusy3' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_IsBusy_IsBusy4) == 0x000122, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_IsBusy_IsBusy4' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue5) == 0x000123, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Not_PreBool_ReturnValue6) == 0x000124, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_BooleanAND_ReturnValue4) == 0x000125, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_BooleanAND_ReturnValue5) == 0x000126, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Lerp_ReturnValue2) == 0x000128, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_Lerp_ReturnValue3) == 0x00012C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_RLerp_ReturnValue) == 0x000130, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_VLerp_ReturnValue) == 0x00013C, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_VLerp_ReturnValue2) == 0x000148, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_VLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000154, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001D4, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_RLerp_ReturnValue2) == 0x0001D8, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_RLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult2) == 0x0001E4, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_ReturnValue2) == 0x000264, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, UniqueObjectNameForCooking_Key) == 0x000268, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::UniqueObjectNameForCooking_Key' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint, UniqueObjectNameForCooking_Key2) == 0x000278, "Member 'HomeBaseCamera_Blueprint_C_ExecuteUbergraph_HomeBaseCamera_Blueprint::UniqueObjectNameForCooking_Key2' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.SetBuildingFocus
// 0x0004 (0x0004 - 0x0000)
struct HomeBaseCamera_Blueprint_C_SetBuildingFocus final
{
public:
	class UCameraComponent*                       BuildingCameraComponent;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_SetBuildingFocus) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_SetBuildingFocus");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_SetBuildingFocus) == 0x000004, "Wrong size on HomeBaseCamera_Blueprint_C_SetBuildingFocus");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_SetBuildingFocus, BuildingCameraComponent) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_SetBuildingFocus::BuildingCameraComponent' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct HomeBaseCamera_Blueprint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_ReceiveTick");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong size on HomeBaseCamera_Blueprint_C_ReceiveTick");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30
// 0x0010 (0x0010 - 0x0000)
struct HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30) == 0x000010, "Wrong size on HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30, Key) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30::Key' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31
// 0x0010 (0x0010 - 0x0000)
struct HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31) == 0x000010, "Wrong size on HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31, Key) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31::Key' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.StoreLerpFrom
// 0x0018 (0x0018 - 0x0000)
struct HomeBaseCamera_Blueprint_C_StoreLerpFrom final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_StoreLerpFrom) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_StoreLerpFrom");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_StoreLerpFrom) == 0x000018, "Wrong size on HomeBaseCamera_Blueprint_C_StoreLerpFrom");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_StoreLerpFrom, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_StoreLerpFrom::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_StoreLerpFrom, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'HomeBaseCamera_Blueprint_C_StoreLerpFrom::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.StorePrevious
// 0x0018 (0x0018 - 0x0000)
struct HomeBaseCamera_Blueprint_C_StorePrevious final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_StorePrevious) == 0x000004, "Wrong alignment on HomeBaseCamera_Blueprint_C_StorePrevious");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_StorePrevious) == 0x000018, "Wrong size on HomeBaseCamera_Blueprint_C_StorePrevious");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_StorePrevious, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_StorePrevious::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_StorePrevious, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'HomeBaseCamera_Blueprint_C_StorePrevious::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C.IsBusy
// 0x0004 (0x0004 - 0x0000)
struct HomeBaseCamera_Blueprint_C_IsBusy final
{
public:
	bool                                          IsBusy_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue2;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeBaseCamera_Blueprint_C_IsBusy) == 0x000001, "Wrong alignment on HomeBaseCamera_Blueprint_C_IsBusy");
static_assert(sizeof(HomeBaseCamera_Blueprint_C_IsBusy) == 0x000004, "Wrong size on HomeBaseCamera_Blueprint_C_IsBusy");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_IsBusy, IsBusy_0) == 0x000000, "Member 'HomeBaseCamera_Blueprint_C_IsBusy::IsBusy_0' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_IsBusy, CallFunc_IsPlaying_ReturnValue) == 0x000001, "Member 'HomeBaseCamera_Blueprint_C_IsBusy::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBaseCamera_Blueprint_C_IsBusy, CallFunc_IsPlaying_ReturnValue2) == 0x000002, "Member 'HomeBaseCamera_Blueprint_C_IsBusy::CallFunc_IsPlaying_ReturnValue2' has a wrong offset!");
