#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuntingGeneratorLocationContext

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HuntingGeneratorLocationContext.HuntingGeneratorLocationContext_C.ProvideSingleLocation
// 0x010C (0x010C - 0x0000)
struct HuntingGeneratorLocationContext_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 QuerierActor;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ResultingLocation;                                 // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLocalWildcardAsFloat_ReturnValue;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLocalWildcardAsFloat_ReturnValue2;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLocalWildcardAsFloat_ReturnValue3;     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetClosestFortPlayerPawn_ReturnValue;     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            Querier;                                           // 0x00DC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	struct FVector                                FinalHuntingRadiusLocationToUse;                   // 0x00E0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FinalHuntingRadiusToUse;                           // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DistanceBetweenQuerierAndGoal;                     // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                GoalActorLocation;                                 // 0x00F4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                QuerierLocation;                                   // 0x0100(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuntingGeneratorLocationContext_C_ProvideSingleLocation) == 0x000004, "Wrong alignment on HuntingGeneratorLocationContext_C_ProvideSingleLocation");
static_assert(sizeof(HuntingGeneratorLocationContext_C_ProvideSingleLocation) == 0x00010C, "Wrong size on HuntingGeneratorLocationContext_C_ProvideSingleLocation");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, QuerierActor) == 0x000004, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, ResultingLocation) == 0x000008, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, K2Node_DynamicCast_AsFort_AIPawn) == 0x000014, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Normal_ReturnValue) == 0x00002C, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x000038, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetBlackboard_ReturnValue) == 0x000064, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetLocalWildcardAsFloat_ReturnValue) == 0x000068, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetLocalWildcardAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetLocalWildcardAsFloat_ReturnValue2) == 0x00006C, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetLocalWildcardAsFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetLocalWildcardAsFloat_ReturnValue3) == 0x000070, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetLocalWildcardAsFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Abs_ReturnValue) == 0x000074, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00007C, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Less_FloatFloat_ReturnValue) == 0x000080, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_SelectVector_ReturnValue) == 0x000084, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000090, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetClosestFortPlayerPawn_ReturnValue) == 0x0000A8, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetClosestFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000B0, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x0000BC, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_GetValueAsObject_ReturnValue) == 0x0000C4, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, K2Node_DynamicCast_AsActor) == 0x0000C8, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess2) == 0x0000CC, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0000D0, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, Querier) == 0x0000DC, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::Querier' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, FinalHuntingRadiusLocationToUse) == 0x0000E0, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::FinalHuntingRadiusLocationToUse' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, FinalHuntingRadiusToUse) == 0x0000EC, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::FinalHuntingRadiusToUse' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, DistanceBetweenQuerierAndGoal) == 0x0000F0, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::DistanceBetweenQuerierAndGoal' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, GoalActorLocation) == 0x0000F4, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::GoalActorLocation' has a wrong offset!");
static_assert(offsetof(HuntingGeneratorLocationContext_C_ProvideSingleLocation, QuerierLocation) == 0x000100, "Member 'HuntingGeneratorLocationContext_C_ProvideSingleLocation::QuerierLocation' has a wrong offset!");

}

#pragma pack(pop)
