#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskVimBlueprint

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HuskVimBlueprint_HuskType_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HuskVimBlueprint.HuskVimBlueprint_C.ExecuteUbergraph_HuskVimBlueprint
// 0x02E0 (0x02E0 - 0x0000)
struct HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable;                              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable2;                             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue3;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue4;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable3;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable4;                             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue5;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue6;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable5;                             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable6;                             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable7;                             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable8;                             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable9;                             // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable10;                            // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable11;                            // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable12;                            // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable13;                            // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable14;                            // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable3;                               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue9;                   // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue10;                  // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable15;                            // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable16;                            // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable17;                            // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable18;                            // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable19;                            // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable20;                            // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable4;                               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable21;                            // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable22;                            // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable23;                            // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable24;                            // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable25;                            // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable26;                            // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable5;                               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable27;                            // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMovementStyle                            CallFunc_MakeMovementStyle_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable28;                            // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable29;                            // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable30;                            // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable31;                            // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable32;                            // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable6;                               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable33;                            // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable34;                            // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable35;                            // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable36;                            // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable37;                            // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable38;                            // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable39;                            // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHuskVimBlueprint_HuskType                    Temp_byte_Variable7;                               // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select2_Default;                            // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select3_Default;                            // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select4_Default;                            // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select5_Default;                            // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select6_Default;                            // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable40;                            // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable41;                            // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue11;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable42;                            // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select7_Default;                            // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn2;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue3;             // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn3;                 // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            CallFunc_TryGetFortAIPawn_ReturnValue;             // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint) == 0x000004, "Wrong alignment on HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint");
static_assert(sizeof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint) == 0x0002E0, "Wrong size on HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, EntryPoint) == 0x000000, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable) == 0x000004, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable2) == 0x000010, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable) == 0x00001C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00001D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x00001E, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue) == 0x00001F, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue3) == 0x000020, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue2) == 0x000021, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue4) == 0x000022, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue3) == 0x000024, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue4) == 0x000025, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue) == 0x000028, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue5) == 0x00002C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable3) == 0x000030, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable4) == 0x00003C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue5) == 0x000048, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue6) == 0x000049, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue6) == 0x00004A, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue7) == 0x00004B, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00004C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue8) == 0x00004D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x00004E, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable5) == 0x000050, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Not_PreBool_ReturnValue2) == 0x00005D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanAND_ReturnValue2) == 0x00005E, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable6) == 0x000060, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Less_FloatFloat_ReturnValue) == 0x00006C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Not_PreBool_ReturnValue3) == 0x00006D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanAND_ReturnValue3) == 0x00006E, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2) == 0x000070, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000074, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable7) == 0x000078, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable8) == 0x000084, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable2) == 0x000090, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable9) == 0x000094, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable10) == 0x0000A0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable11) == 0x0000AC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable12) == 0x0000B8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable13) == 0x0000C4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable14) == 0x0000D0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable3) == 0x0000DC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3) == 0x0000E0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x0000E4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue9) == 0x0000E5, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue10) == 0x0000E6, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable15) == 0x0000E8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x0000F4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable16) == 0x0000F8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable17) == 0x000104, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable17' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable18) == 0x000110, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable18' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable19) == 0x00011C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable19' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable20) == 0x000128, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable20' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable4) == 0x000134, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable21) == 0x000138, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable21' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable22) == 0x000144, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable22' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable23) == 0x000150, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable23' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable24) == 0x00015C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable24' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable25) == 0x000168, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable25' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable26) == 0x000174, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable26' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable5) == 0x000180, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable27) == 0x000184, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable27' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_MakeMovementStyle_ReturnValue) == 0x000190, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_MakeMovementStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable28) == 0x000194, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable28' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable29) == 0x0001A0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable29' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable30) == 0x0001AC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable30' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable31) == 0x0001B8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable31' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable32) == 0x0001C4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable32' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable6) == 0x0001D0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable33) == 0x0001D4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable33' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable34) == 0x0001E0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable34' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable35) == 0x0001EC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable35' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable36) == 0x0001F8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable36' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable37) == 0x000204, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable37' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable38) == 0x000210, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable38' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable39) == 0x00021C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable39' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x000228, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_byte_Variable7) == 0x000229, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x00022A, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00022B, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanAND_ReturnValue4) == 0x00022C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Not_PreBool_ReturnValue4) == 0x00022D, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select_Default) == 0x000230, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select2_Default) == 0x00023C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select3_Default) == 0x000248, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select4_Default) == 0x000254, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select5_Default) == 0x000260, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select6_Default) == 0x00026C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable40) == 0x000278, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable40' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable41) == 0x000284, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable41' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000290, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_SelectInt_ReturnValue) == 0x000294, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000298, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_BooleanOR_ReturnValue11) == 0x00029C, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_BooleanOR_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, Temp_struct_Variable42) == 0x0002A0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::Temp_struct_Variable42' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0002AC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_Select7_Default) == 0x0002B0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn) == 0x0002BC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x0002C4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn2) == 0x0002C8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_bSuccess2) == 0x0002CC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue3) == 0x0002D0, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn3) == 0x0002D4, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, K2Node_DynamicCast_bSuccess3) == 0x0002D8, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint, CallFunc_TryGetFortAIPawn_ReturnValue) == 0x0002DC, "Member 'HuskVimBlueprint_C_ExecuteUbergraph_HuskVimBlueprint::CallFunc_TryGetFortAIPawn_ReturnValue' has a wrong offset!");

// Function HuskVimBlueprint.HuskVimBlueprint_C.InitializeHuskType
// 0x002C (0x002C - 0x0000)
struct HuskVimBlueprint_C_InitializeHuskType final
{
public:
	class AFortAIPawn*                            InputPin;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self3_CastInput;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue3;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskVimBlueprint_C_InitializeHuskType) == 0x000004, "Wrong alignment on HuskVimBlueprint_C_InitializeHuskType");
static_assert(sizeof(HuskVimBlueprint_C_InitializeHuskType) == 0x00002C, "Wrong size on HuskVimBlueprint_C_InitializeHuskType");
static_assert(offsetof(HuskVimBlueprint_C_InitializeHuskType, InputPin) == 0x000000, "Member 'HuskVimBlueprint_C_InitializeHuskType::InputPin' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_InitializeHuskType, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HuskVimBlueprint_C_InitializeHuskType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskVimBlueprint_C_InitializeHuskType, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000005, "Member 'HuskVimBlueprint_C_InitializeHuskType::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
