#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskPawn_Bombshell_Poison

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HuskPawn_Bombshell_Poison.HuskPawn_Bombshell_Poison_C.ExecuteUbergraph_HuskPawn_Bombshell_Poison
// 0x00C4 (0x00C4 - 0x0000)
struct HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x002C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00B4(0x000C)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison) == 0x000004, "Wrong alignment on HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison");
static_assert(sizeof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison) == 0x0000C4, "Wrong size on HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, EntryPoint) == 0x000000, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::EntryPoint' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_Damage) == 0x000004, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_DamageTags) == 0x000008, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_Momentum) == 0x000020, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_HitInfo) == 0x00002C, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_InstigatedBy) == 0x0000AC, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_DamageCauser) == 0x0000B0, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, K2Node_Event_EffectContext) == 0x0000B4, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000C0, "Member 'HuskPawn_Bombshell_Poison_C_ExecuteUbergraph_HuskPawn_Bombshell_Poison::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function HuskPawn_Bombshell_Poison.HuskPawn_Bombshell_Poison_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects");
static_assert(sizeof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'HuskPawn_Bombshell_Poison_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
