#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconLibrary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ItemTierIconSet_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function IconLibrary.IconLibrary_C.Get Item Tier Icon
// 0x03C0 (0x03C0 - 0x0000)
struct IconLibrary_C_Get_Item_Tier_Icon final
{
public:
	struct FItemTierIconSet                       TierIconSet;                                       // 0x0000(0x000C)(Parm)
	EFortItemTier                                 Tier;                                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Size;                                              // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            Tier_Brush;                                        // 0x0014(0x0074)(Parm, OutParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortMultiSizeBrush                    CallFunc_Array_Get_Item;                           // 0x0094(0x02B8)()
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x034C(0x0074)(ConstParm)
};
static_assert(alignof(IconLibrary_C_Get_Item_Tier_Icon) == 0x000004, "Wrong alignment on IconLibrary_C_Get_Item_Tier_Icon");
static_assert(sizeof(IconLibrary_C_Get_Item_Tier_Icon) == 0x0003C0, "Wrong size on IconLibrary_C_Get_Item_Tier_Icon");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, TierIconSet) == 0x000000, "Member 'IconLibrary_C_Get_Item_Tier_Icon::TierIconSet' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, Tier) == 0x00000C, "Member 'IconLibrary_C_Get_Item_Tier_Icon::Tier' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, Size) == 0x00000D, "Member 'IconLibrary_C_Get_Item_Tier_Icon::Size' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, __WorldContext) == 0x000010, "Member 'IconLibrary_C_Get_Item_Tier_Icon::__WorldContext' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, Tier_Brush) == 0x000014, "Member 'IconLibrary_C_Get_Item_Tier_Icon::Tier_Brush' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000088, "Member 'IconLibrary_C_Get_Item_Tier_Icon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, CallFunc_Array_LastIndex_ReturnValue) == 0x00008C, "Member 'IconLibrary_C_Get_Item_Tier_Icon::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, CallFunc_Clamp_ReturnValue) == 0x000090, "Member 'IconLibrary_C_Get_Item_Tier_Icon::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, CallFunc_Array_Get_Item) == 0x000094, "Member 'IconLibrary_C_Get_Item_Tier_Icon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IconLibrary_C_Get_Item_Tier_Icon, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x00034C, "Member 'IconLibrary_C_Get_Item_Tier_Icon::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
