#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImpactNumbers

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function ImpactNumbers.ImpactNumbers_C.ExecuteUbergraph_ImpactNumbers
// 0x00A0 (0x00A0 - 0x0000)
struct ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortDamageNumberInfo                  K2Node_Event_NewDamageNumberInfo;                  // 0x0004(0x0058)(ConstParm, ContainsInstancedReference)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_init_a_new_number_set_OutCameraTransform; // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_init_a_new_number_set_OutNumberLocation;  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers) == 0x000010, "Wrong alignment on ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers");
static_assert(sizeof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers) == 0x0000A0, "Wrong size on ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers");
static_assert(offsetof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers, EntryPoint) == 0x000000, "Member 'ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers::EntryPoint' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers, K2Node_Event_NewDamageNumberInfo) == 0x000004, "Member 'ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers::K2Node_Event_NewDamageNumberInfo' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers, CallFunc_init_a_new_number_set_OutCameraTransform) == 0x000060, "Member 'ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers::CallFunc_init_a_new_number_set_OutCameraTransform' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers, CallFunc_init_a_new_number_set_OutNumberLocation) == 0x000090, "Member 'ImpactNumbers_C_ExecuteUbergraph_ImpactNumbers::CallFunc_init_a_new_number_set_OutNumberLocation' has a wrong offset!");

// Function ImpactNumbers.ImpactNumbers_C.OnNewDamageNumber
// 0x0058 (0x0058 - 0x0000)
struct ImpactNumbers_C_OnNewDamageNumber final
{
public:
	struct FFortDamageNumberInfo                  NewDamageNumberInfo;                               // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ImpactNumbers_C_OnNewDamageNumber) == 0x000004, "Wrong alignment on ImpactNumbers_C_OnNewDamageNumber");
static_assert(sizeof(ImpactNumbers_C_OnNewDamageNumber) == 0x000058, "Wrong size on ImpactNumbers_C_OnNewDamageNumber");
static_assert(offsetof(ImpactNumbers_C_OnNewDamageNumber, NewDamageNumberInfo) == 0x000000, "Member 'ImpactNumbers_C_OnNewDamageNumber::NewDamageNumberInfo' has a wrong offset!");

// Function ImpactNumbers.ImpactNumbers_C.init a new number set
// 0x0230 (0x0230 - 0x0000)
struct ImpactNumbers_C_init_a_new_number_set final
{
public:
	struct FFortDamageNumberInfo                  NewDamageHitInfoStruct;                            // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutCameraTransform;                                // 0x0060(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FVector                                OutNumberLocation;                                 // 0x0090(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x00CC(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NumberLocation;                                    // 0x01DC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                LocationOffset;                                    // 0x01E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransform;                                   // 0x0200(0x0030)(Edit, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpactNumbers_C_init_a_new_number_set) == 0x000010, "Wrong alignment on ImpactNumbers_C_init_a_new_number_set");
static_assert(sizeof(ImpactNumbers_C_init_a_new_number_set) == 0x000230, "Wrong size on ImpactNumbers_C_init_a_new_number_set");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, NewDamageHitInfoStruct) == 0x000000, "Member 'ImpactNumbers_C_init_a_new_number_set::NewDamageHitInfoStruct' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, OutCameraTransform) == 0x000060, "Member 'ImpactNumbers_C_init_a_new_number_set::OutCameraTransform' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, OutNumberLocation) == 0x000090, "Member 'ImpactNumbers_C_init_a_new_number_set::OutNumberLocation' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_BreakTransform_Rotation) == 0x0000B4, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0000CC, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_RandomFloatInRange_ReturnValue) == 0x00014C, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000150, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_GetCameraRotation_ReturnValue) == 0x000154, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_GetActorRightVector_ReturnValue) == 0x000164, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000170, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_GetActorUpVector_ReturnValue) == 0x00017C, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_GetCameraLocation_ReturnValue) == 0x000188, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000194, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CallFunc_Add_VectorVector_ReturnValue2) == 0x0001D0, "Member 'ImpactNumbers_C_init_a_new_number_set::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, NumberLocation) == 0x0001DC, "Member 'ImpactNumbers_C_init_a_new_number_set::NumberLocation' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, LocationOffset) == 0x0001E8, "Member 'ImpactNumbers_C_init_a_new_number_set::LocationOffset' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_init_a_new_number_set, CameraTransform) == 0x000200, "Member 'ImpactNumbers_C_init_a_new_number_set::CameraTransform' has a wrong offset!");

// Function ImpactNumbers.ImpactNumbers_C.Set Material Pararmeters
// 0x02A0 (0x02A0 - 0x0000)
struct ImpactNumbers_C_Set_Material_Pararmeters final
{
public:
	struct FFortDamageNumberInfo                  NewDamageHitInfoStruct;                            // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransform;                                   // 0x0060(0x0030)(Parm, IsPlainOldData, NoDestructor)
	struct FVector                                NumberLocation;                                    // 0x0090(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue3;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue4;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue2;                 // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue3;                 // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item2;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue2;                       // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue3;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item3;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item4;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue3;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue3;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue10;        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0238(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item5;                          // 0x0244(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue11;        // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor3;                    // 0x0254(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FName>                           K2Node_MakeArray_Array2;                           // 0x026C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array3;                           // 0x0278(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item6;                          // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item7;                          // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         OffsetAccumulatedValue;                            // 0x0294(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         RealGameTime;                                      // 0x0298(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpactNumbers_C_Set_Material_Pararmeters) == 0x000010, "Wrong alignment on ImpactNumbers_C_Set_Material_Pararmeters");
static_assert(sizeof(ImpactNumbers_C_Set_Material_Pararmeters) == 0x0002A0, "Wrong size on ImpactNumbers_C_Set_Material_Pararmeters");
static_assert(offsetof(ImpactNumbers_C_Set_Material_Pararmeters, NewDamageHitInfoStruct) == 0x000000, "Member 'ImpactNumbers_C_Set_Material_Pararmeters::NewDamageHitInfoStruct' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_Set_Material_Pararmeters, CameraTransform) == 0x000060, "Member 'ImpactNumbers_C_Set_Material_Pararmeters::CameraTransform' has a wrong offset!");
static_assert(offsetof(ImpactNumbers_C_Set_Material_Pararmeters, NumberLocation) == 0x000090, "Member 'ImpactNumbers_C_Set_Material_Pararmeters::NumberLocation' has a wrong offset!");
