#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InlineHeroCoreStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "HeroCoreStat_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass InlineHeroCoreStat.InlineHeroCoreStat_C
// 0x03DC (0x0594 - 0x01B8)
class UInlineHeroCoreStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageStatIcon;                                     // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 ImageStatShadow;                                   // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextStatValue;                                     // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FHeroCoreStat                          Data;                                              // 0x01C8(0x02D4)(Edit, BlueprintVisible, ExposeOnSpawn)
	EFortBrushSize                                Brush_Size;                                        // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FFortMultiSizeFont                     Font;                                              // 0x04A4(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_InlineHeroCoreStat(int32 EntryPoint);
	void Construct();
	void Update(const struct FHeroCoreStat& Data_0, float Value_0, EFortBrushSize Brush_Size_0);
	class UWidget* Get_Tooltip_Widget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InlineHeroCoreStat_C">();
	}
	static class UInlineHeroCoreStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInlineHeroCoreStat_C>();
	}
};
static_assert(alignof(UInlineHeroCoreStat_C) == 0x000004, "Wrong alignment on UInlineHeroCoreStat_C");
static_assert(sizeof(UInlineHeroCoreStat_C) == 0x000594, "Wrong size on UInlineHeroCoreStat_C");
static_assert(offsetof(UInlineHeroCoreStat_C, UberGraphFrame) == 0x0001B8, "Member 'UInlineHeroCoreStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, ImageStatIcon) == 0x0001BC, "Member 'UInlineHeroCoreStat_C::ImageStatIcon' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, ImageStatShadow) == 0x0001C0, "Member 'UInlineHeroCoreStat_C::ImageStatShadow' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, TextStatValue) == 0x0001C4, "Member 'UInlineHeroCoreStat_C::TextStatValue' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, Data) == 0x0001C8, "Member 'UInlineHeroCoreStat_C::Data' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, Brush_Size) == 0x00049C, "Member 'UInlineHeroCoreStat_C::Brush_Size' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, Value) == 0x0004A0, "Member 'UInlineHeroCoreStat_C::Value' has a wrong offset!");
static_assert(offsetof(UInlineHeroCoreStat_C, Font) == 0x0004A4, "Member 'UInlineHeroCoreStat_C::Font' has a wrong offset!");

}

#pragma pack(pop)
