#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ItemDisplayMode_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ItemTextureSet_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Item.Item_C.ExecuteUbergraph_Item
// 0x0048 (0x0048 - 0x0000)
struct Item_C_ExecuteUbergraph_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_Get_Item_Tooltip_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortUIManagerWidget*                   CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortUIManagerWidget*                   CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue2;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCursorMode_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_NewItem;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCursorModeEnabled;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_CursorModeContentWidget;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_Get_Item_Tooltip_ReturnValue2;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_ExecuteUbergraph_Item) == 0x000004, "Wrong alignment on Item_C_ExecuteUbergraph_Item");
static_assert(sizeof(Item_C_ExecuteUbergraph_Item) == 0x000048, "Wrong size on Item_C_ExecuteUbergraph_Item");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, EntryPoint) == 0x000000, "Member 'Item_C_ExecuteUbergraph_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Get_Item_Tooltip_ReturnValue) == 0x000004, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Get_Item_Tooltip_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x00000C, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x000010, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc__BPGetCurrentUIState_ReturnValue2) == 0x000011, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc__BPGetCurrentUIState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetContext_ReturnValue) == 0x000014, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_IsInCursorMode_ReturnValue) == 0x000018, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_IsInCursorMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_Event_IsDesignTime) == 0x000019, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_Event_NewItem) == 0x00001C, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_Event_NewItem' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000020, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CustomEvent_bCursorModeEnabled) == 0x000024, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CustomEvent_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CustomEvent_ActionName) == 0x000028, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CustomEvent_CursorModeContentWidget) == 0x000030, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CustomEvent_CursorModeContentWidget' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Get_Item_Tooltip_ReturnValue2) == 0x000044, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Get_Item_Tooltip_ReturnValue2' has a wrong offset!");

// Function Item.Item_C.OnCursorModeChanged
// 0x0010 (0x0010 - 0x0000)
struct Item_C_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CursorModeContentWidget;                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_OnCursorModeChanged) == 0x000004, "Wrong alignment on Item_C_OnCursorModeChanged");
static_assert(sizeof(Item_C_OnCursorModeChanged) == 0x000010, "Wrong size on Item_C_OnCursorModeChanged");
static_assert(offsetof(Item_C_OnCursorModeChanged, bCursorModeEnabled) == 0x000000, "Member 'Item_C_OnCursorModeChanged::bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(Item_C_OnCursorModeChanged, ActionName) == 0x000004, "Member 'Item_C_OnCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(Item_C_OnCursorModeChanged, CursorModeContentWidget) == 0x00000C, "Member 'Item_C_OnCursorModeChanged::CursorModeContentWidget' has a wrong offset!");

// Function Item.Item_C.BPOnItemSet
// 0x0004 (0x0004 - 0x0000)
struct Item_C_BPOnItemSet final
{
public:
	class UFortItem*                              NewItem;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_BPOnItemSet) == 0x000004, "Wrong alignment on Item_C_BPOnItemSet");
static_assert(sizeof(Item_C_BPOnItemSet) == 0x000004, "Wrong size on Item_C_BPOnItemSet");
static_assert(offsetof(Item_C_BPOnItemSet, NewItem) == 0x000000, "Member 'Item_C_BPOnItemSet::NewItem' has a wrong offset!");

// Function Item.Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_PreConstruct) == 0x000001, "Wrong alignment on Item_C_PreConstruct");
static_assert(sizeof(Item_C_PreConstruct) == 0x000001, "Wrong size on Item_C_PreConstruct");
static_assert(offsetof(Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Item.Item_C.Update Base
// 0x01D0 (0x01D0 - 0x0000)
struct Item_C_Update_Base final
{
public:
	struct FSlateBrush                            Accent_Brush;                                      // 0x0000(0x0074)(Edit)
	struct FSlateBrush                            Bevel_Top_Brush;                                   // 0x0074(0x0074)(Edit)
	struct FSlateBrush                            Bevel_Side_Brush;                                  // 0x00E8(0x0074)(Edit)
	struct FSlateBrush                            Bevel_Bottom_Brush;                                // 0x015C(0x0074)(Edit)
};
static_assert(alignof(Item_C_Update_Base) == 0x000004, "Wrong alignment on Item_C_Update_Base");
static_assert(sizeof(Item_C_Update_Base) == 0x0001D0, "Wrong size on Item_C_Update_Base");
static_assert(offsetof(Item_C_Update_Base, Accent_Brush) == 0x000000, "Member 'Item_C_Update_Base::Accent_Brush' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Base, Bevel_Top_Brush) == 0x000074, "Member 'Item_C_Update_Base::Bevel_Top_Brush' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Base, Bevel_Side_Brush) == 0x0000E8, "Member 'Item_C_Update_Base::Bevel_Side_Brush' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Base, Bevel_Bottom_Brush) == 0x00015C, "Member 'Item_C_Update_Base::Bevel_Bottom_Brush' has a wrong offset!");

// Function Item.Item_C.Set Item Data
// 0x007C (0x007C - 0x0000)
struct Item_C_Set_Item_Data final
{
public:
	class UFortItem*                              Item_Data;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0008(0x0070)()
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             CallFunc_Get_Display_Style_Style;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Set_Item_Data) == 0x000004, "Wrong alignment on Item_C_Set_Item_Data");
static_assert(sizeof(Item_C_Set_Item_Data) == 0x00007C, "Wrong size on Item_C_Set_Item_Data");
static_assert(offsetof(Item_C_Set_Item_Data, Item_Data) == 0x000000, "Member 'Item_C_Set_Item_Data::Item_Data' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Item_Data, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Item_C_Set_Item_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Item_Data, CallFunc_GetRarity_ReturnValue) == 0x000005, "Member 'Item_C_Set_Item_Data::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Item_Data, CallFunc_BPGetRarityData_ReturnValue) == 0x000008, "Member 'Item_C_Set_Item_Data::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Item_Data, CallFunc_GetType_ReturnValue) == 0x000078, "Member 'Item_C_Set_Item_Data::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Item_Data, CallFunc_Get_Display_Style_Style) == 0x000079, "Member 'Item_C_Set_Item_Data::CallFunc_Get_Display_Style_Style' has a wrong offset!");

// Function Item.Item_C.Update Stack Counter
// 0x0004 (0x0004 - 0x0000)
struct Item_C_Update_Stack_Counter final
{
public:
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Update_Stack_Counter) == 0x000004, "Wrong alignment on Item_C_Update_Stack_Counter");
static_assert(sizeof(Item_C_Update_Stack_Counter) == 0x000004, "Wrong size on Item_C_Update_Stack_Counter");
static_assert(offsetof(Item_C_Update_Stack_Counter, CallFunc_GetNumInStack_ReturnValue) == 0x000000, "Member 'Item_C_Update_Stack_Counter::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");

// Function Item.Item_C.Update All
// 0x0DA0 (0x0DA0 - 0x0000)
struct Item_C_Update_All final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        CallFunc_Get_Item_Texture_Set_Texture_Set;         // 0x0004(0x0D9C)()
};
static_assert(alignof(Item_C_Update_All) == 0x000004, "Wrong alignment on Item_C_Update_All");
static_assert(sizeof(Item_C_Update_All) == 0x000DA0, "Wrong size on Item_C_Update_All");
static_assert(offsetof(Item_C_Update_All, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Item_C_Update_All::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Update_All, CallFunc_Get_Item_Texture_Set_Texture_Set) == 0x000004, "Member 'Item_C_Update_All::CallFunc_Get_Item_Texture_Set_Texture_Set' has a wrong offset!");

// Function Item.Item_C.OnMouseButtonDown
// 0x0214 (0x0214 - 0x0000)
struct Item_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0034(0x0060)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0094(0x0060)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x00F4(0x0060)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0154(0x0060)()
	struct FEventReply                            Result;                                            // 0x01B4(0x0060)(Edit)
};
static_assert(alignof(Item_C_OnMouseButtonDown) == 0x000004, "Wrong alignment on Item_C_OnMouseButtonDown");
static_assert(sizeof(Item_C_OnMouseButtonDown) == 0x000214, "Wrong size on Item_C_OnMouseButtonDown");
static_assert(offsetof(Item_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'Item_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Item_C_OnMouseButtonDown, MouseEvent) == 0x000034, "Member 'Item_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(Item_C_OnMouseButtonDown, ReturnValue) == 0x000094, "Member 'Item_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x0000F4, "Member 'Item_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000154, "Member 'Item_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnMouseButtonDown, Result) == 0x0001B4, "Member 'Item_C_OnMouseButtonDown::Result' has a wrong offset!");

// Function Item.Item_C.OnDragDetected
// 0x0128 (0x0128 - 0x0000)
struct Item_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0034(0x0060)(ConstParm, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0094(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIconBrush_IconBrush;                   // 0x00A0(0x0074)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UItemDragIcon_C*                        CallFunc_Create_ReturnValue;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Drag_Icon_Texture;                                 // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_OnDragDetected) == 0x000004, "Wrong alignment on Item_C_OnDragDetected");
static_assert(sizeof(Item_C_OnDragDetected) == 0x000128, "Wrong size on Item_C_OnDragDetected");
static_assert(offsetof(Item_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'Item_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, PointerEvent) == 0x000034, "Member 'Item_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, Operation) == 0x000094, "Member 'Item_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x000098, "Member 'Item_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'Item_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, CallFunc_GetIconBrush_IconBrush) == 0x0000A0, "Member 'Item_C_OnDragDetected::CallFunc_GetIconBrush_IconBrush' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, CallFunc_GetOwningPlayer_ReturnValue) == 0x000114, "Member 'Item_C_OnDragDetected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x000118, "Member 'Item_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, K2Node_DynamicCast_AsTexture_2D) == 0x00011C, "Member 'Item_C_OnDragDetected::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'Item_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Item_C_OnDragDetected, Drag_Icon_Texture) == 0x000124, "Member 'Item_C_OnDragDetected::Drag_Icon_Texture' has a wrong offset!");

// Function Item.Item_C.Update Size Box
// 0x0354 (0x0354 - 0x0000)
struct Item_C_Update_Size_Box final
{
public:
	struct FFortStateStyle                        CallFunc_GetCurrentStateStyle_ReturnValue;         // 0x0000(0x02D8)(ConstParm)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x02D8(0x0074)(ConstParm)
	float                                         CallFunc_BreakVector2D_X;                          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Update_Size_Box) == 0x000004, "Wrong alignment on Item_C_Update_Size_Box");
static_assert(sizeof(Item_C_Update_Size_Box) == 0x000354, "Wrong size on Item_C_Update_Size_Box");
static_assert(offsetof(Item_C_Update_Size_Box, CallFunc_GetCurrentStateStyle_ReturnValue) == 0x000000, "Member 'Item_C_Update_Size_Box::CallFunc_GetCurrentStateStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Size_Box, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x0002D8, "Member 'Item_C_Update_Size_Box::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Size_Box, CallFunc_BreakVector2D_X) == 0x00034C, "Member 'Item_C_Update_Size_Box::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Size_Box, CallFunc_BreakVector2D_Y) == 0x000350, "Member 'Item_C_Update_Size_Box::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function Item.Item_C.Update Background
// 0x00C8 (0x00C8 - 0x0000)
struct Item_C_Update_Background final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable2;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable3;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayMode                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable4;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable5;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable6;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x001C(0x0074)(ConstParm)
	float                                         K2Node_Select_Default;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayMode                              Temp_byte_Variable2;                               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     Background_Material;                               // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Update_Background) == 0x000004, "Wrong alignment on Item_C_Update_Background");
static_assert(sizeof(Item_C_Update_Background) == 0x0000C8, "Wrong size on Item_C_Update_Background");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable) == 0x000000, "Member 'Item_C_Update_Background::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable2) == 0x000004, "Member 'Item_C_Update_Background::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable3) == 0x000008, "Member 'Item_C_Update_Background::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_byte_Variable) == 0x00000C, "Member 'Item_C_Update_Background::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable4) == 0x000010, "Member 'Item_C_Update_Background::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable5) == 0x000014, "Member 'Item_C_Update_Background::Temp_float_Variable5' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_float_Variable6) == 0x000018, "Member 'Item_C_Update_Background::Temp_float_Variable6' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x00001C, "Member 'Item_C_Update_Background::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_Select_Default) == 0x000090, "Member 'Item_C_Update_Background::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Temp_byte_Variable2) == 0x000094, "Member 'Item_C_Update_Background::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_DynamicCast_AsTexture_2D) == 0x000098, "Member 'Item_C_Update_Background::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_DynamicCast_bSuccess) == 0x00009C, "Member 'Item_C_Update_Background::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_Select2_Default) == 0x0000A0, "Member 'Item_C_Update_Background::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_MakeStruct_LinearColor) == 0x0000A4, "Member 'Item_C_Update_Background::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, K2Node_MakeStruct_LinearColor2) == 0x0000B4, "Member 'Item_C_Update_Background::K2Node_MakeStruct_LinearColor2' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Background, Background_Material) == 0x0000C4, "Member 'Item_C_Update_Background::Background_Material' has a wrong offset!");

// Function Item.Item_C.Get Item Texture Set
// 0x28FC (0x28FC - 0x0000)
struct Item_C_Get_Item_Texture_Set final
{
public:
	EItemDisplayStyle                             Display_Style;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        Texture_Set;                                       // 0x0004(0x0D9C)(Parm, OutParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0DA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA1[0x3];                                      // 0x0DA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0DA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA9[0x3];                                      // 0x0DA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0DAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0DB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0DB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB5[0x3];                                      // 0x0DB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0DBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DBD[0x3];                                      // 0x0DBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        CallFunc_Array_Get_Item;                           // 0x0DC0(0x0D9C)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x1B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5D[0x3];                                     // 0x1B5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        Item_Texture_Set;                                  // 0x1B60(0x0D9C)(Edit)
};
static_assert(alignof(Item_C_Get_Item_Texture_Set) == 0x000004, "Wrong alignment on Item_C_Get_Item_Texture_Set");
static_assert(sizeof(Item_C_Get_Item_Texture_Set) == 0x0028FC, "Wrong size on Item_C_Get_Item_Texture_Set");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Display_Style) == 0x000000, "Member 'Item_C_Get_Item_Texture_Set::Display_Style' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Texture_Set) == 0x000004, "Member 'Item_C_Get_Item_Texture_Set::Texture_Set' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Temp_bool_True_if_break_was_hit_Variable) == 0x000DA0, "Member 'Item_C_Get_Item_Texture_Set::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Temp_int_Array_Index_Variable) == 0x000DA4, "Member 'Item_C_Get_Item_Texture_Set::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_Not_PreBool_ReturnValue) == 0x000DA8, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Temp_int_Loop_Counter_Variable) == 0x000DAC, "Member 'Item_C_Get_Item_Texture_Set::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_Array_Length_ReturnValue) == 0x000DB0, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_Less_IntInt_ReturnValue) == 0x000DB4, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_Add_IntInt_ReturnValue) == 0x000DB8, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_BooleanAND_ReturnValue) == 0x000DBC, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_Array_Get_Item) == 0x000DC0, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x001B5C, "Member 'Item_C_Get_Item_Texture_Set::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Item_Texture_Set, Item_Texture_Set) == 0x001B60, "Member 'Item_C_Get_Item_Texture_Set::Item_Texture_Set' has a wrong offset!");

// Function Item.Item_C.Update Item Icon
// 0x00FC (0x00FC - 0x0000)
struct Item_C_Update_Item_Icon final
{
public:
	EFortBrushSize                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable3;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable4;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable5;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Item_Icon_Size_Icon_Size;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable6;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable7;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_GetIconBrush_IconBrush;                   // 0x0014(0x0074)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0074)()
};
static_assert(alignof(Item_C_Update_Item_Icon) == 0x000004, "Wrong alignment on Item_C_Update_Item_Icon");
static_assert(sizeof(Item_C_Update_Item_Icon) == 0x0000FC, "Wrong size on Item_C_Update_Item_Icon");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable) == 0x000000, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable2) == 0x000001, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable3) == 0x000002, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable4) == 0x000003, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable5) == 0x000004, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, CallFunc_Get_Item_Icon_Size_Icon_Size) == 0x000008, "Member 'Item_C_Update_Item_Icon::CallFunc_Get_Item_Icon_Size_Icon_Size' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable6) == 0x000010, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, Temp_byte_Variable7) == 0x000011, "Member 'Item_C_Update_Item_Icon::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, K2Node_Select_Default) == 0x000012, "Member 'Item_C_Update_Item_Icon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, CallFunc_GetVisibility_ReturnValue) == 0x000013, "Member 'Item_C_Update_Item_Icon::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, CallFunc_GetIconBrush_IconBrush) == 0x000014, "Member 'Item_C_Update_Item_Icon::CallFunc_GetIconBrush_IconBrush' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Item_Icon, K2Node_MakeStruct_SlateBrush) == 0x000088, "Member 'Item_C_Update_Item_Icon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function Item.Item_C.Level Badge
// 0x0007 (0x0007 - 0x0000)
struct Item_C_Level_Badge final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Level_Badge) == 0x000001, "Wrong alignment on Item_C_Level_Badge");
static_assert(sizeof(Item_C_Level_Badge) == 0x000007, "Wrong size on Item_C_Level_Badge");
static_assert(offsetof(Item_C_Level_Badge, Temp_byte_Variable) == 0x000000, "Member 'Item_C_Level_Badge::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, Temp_byte_Variable2) == 0x000001, "Member 'Item_C_Level_Badge::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, Temp_bool_Variable) == 0x000002, "Member 'Item_C_Level_Badge::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'Item_C_Level_Badge::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x000004, "Member 'Item_C_Level_Badge::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'Item_C_Level_Badge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Level_Badge, K2Node_Select_Default) == 0x000006, "Member 'Item_C_Level_Badge::K2Node_Select_Default' has a wrong offset!");

// Function Item.Item_C.Get Display Style
// 0x002B (0x002B - 0x0000)
struct Item_C_Get_Display_Style final
{
public:
	EFortItemType                                 Item_Type;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Style_0;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable5;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable6;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable7;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable8;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable9;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable10;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable11;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable12;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable13;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable14;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable15;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable16;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable17;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable18;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable19;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable20;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable21;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable22;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable23;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable24;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable25;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable26;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable27;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable28;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable29;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable30;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable31;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable32;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable33;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable34;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable35;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable36;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable37;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable38;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable39;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             Temp_byte_Variable40;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Get_Display_Style) == 0x000001, "Wrong alignment on Item_C_Get_Display_Style");
static_assert(sizeof(Item_C_Get_Display_Style) == 0x00002B, "Wrong size on Item_C_Get_Display_Style");
static_assert(offsetof(Item_C_Get_Display_Style, Item_Type) == 0x000000, "Member 'Item_C_Get_Display_Style::Item_Type' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Style_0) == 0x000001, "Member 'Item_C_Get_Display_Style::Style_0' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable) == 0x000002, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable2) == 0x000003, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable3) == 0x000004, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable4) == 0x000005, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable5) == 0x000006, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable6) == 0x000007, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable7) == 0x000008, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable8) == 0x000009, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable9) == 0x00000A, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable10) == 0x00000B, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable11) == 0x00000C, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable12) == 0x00000D, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable13) == 0x00000E, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable14) == 0x00000F, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable15) == 0x000010, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable16) == 0x000011, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable17) == 0x000012, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable18) == 0x000013, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable19) == 0x000014, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable20) == 0x000015, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable21) == 0x000016, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable21' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable22) == 0x000017, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable22' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable23) == 0x000018, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable23' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable24) == 0x000019, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable24' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable25) == 0x00001A, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable25' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable26) == 0x00001B, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable26' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable27) == 0x00001C, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable27' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable28) == 0x00001D, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable28' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable29) == 0x00001E, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable29' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable30) == 0x00001F, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable30' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable31) == 0x000020, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable31' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable32) == 0x000021, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable32' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable33) == 0x000022, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable33' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable34) == 0x000023, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable34' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable35) == 0x000024, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable35' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable36) == 0x000025, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable36' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable37) == 0x000026, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable37' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable38) == 0x000027, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable38' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable39) == 0x000028, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable39' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, Temp_byte_Variable40) == 0x000029, "Member 'Item_C_Get_Display_Style::Temp_byte_Variable40' has a wrong offset!");
static_assert(offsetof(Item_C_Get_Display_Style, K2Node_Select_Default) == 0x00002A, "Member 'Item_C_Get_Display_Style::K2Node_Select_Default' has a wrong offset!");

// Function Item.Item_C.Update Masked Gradient
// 0x002C (0x002C - 0x0000)
struct Item_C_Update_Masked_Gradient final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture*                               Texture_Mask;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Color_A;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Color_B;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Update_Masked_Gradient) == 0x000004, "Wrong alignment on Item_C_Update_Masked_Gradient");
static_assert(sizeof(Item_C_Update_Masked_Gradient) == 0x00002C, "Wrong size on Item_C_Update_Masked_Gradient");
static_assert(offsetof(Item_C_Update_Masked_Gradient, Image) == 0x000000, "Member 'Item_C_Update_Masked_Gradient::Image' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Masked_Gradient, Texture_Mask) == 0x000004, "Member 'Item_C_Update_Masked_Gradient::Texture_Mask' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Masked_Gradient, Color_A) == 0x000008, "Member 'Item_C_Update_Masked_Gradient::Color_A' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Masked_Gradient, Color_B) == 0x000018, "Member 'Item_C_Update_Masked_Gradient::Color_B' has a wrong offset!");
static_assert(offsetof(Item_C_Update_Masked_Gradient, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'Item_C_Update_Masked_Gradient::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function Item.Item_C.Update Bottom Bevel
// 0x0074 (0x0074 - 0x0000)
struct Item_C_Update_Bottom_Bevel final
{
public:
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0000(0x0074)(ConstParm)
};
static_assert(alignof(Item_C_Update_Bottom_Bevel) == 0x000004, "Wrong alignment on Item_C_Update_Bottom_Bevel");
static_assert(sizeof(Item_C_Update_Bottom_Bevel) == 0x000074, "Wrong size on Item_C_Update_Bottom_Bevel");
static_assert(offsetof(Item_C_Update_Bottom_Bevel, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x000000, "Member 'Item_C_Update_Bottom_Bevel::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");

// Function Item.Item_C.Update Top Bevel
// 0x007C (0x007C - 0x0000)
struct Item_C_Update_Top_Bevel final
{
public:
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0000(0x0074)(ConstParm)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
