#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalCategoryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass JournalCategoryWidget.JournalCategoryWidget_C
// 0x001C (0x0260 - 0x0244)
class UJournalCategoryWidget_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortListView*                          EntryList;                                         // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ExpanderButton;                                    // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UFortQuestCategory*                     QuestCategory;                                     // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	UMulticastDelegateProperty_                   OnItemSelected;                                    // 0x0254(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_JournalCategoryWidget(int32 EntryPoint);
	void BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature(class UObject* Item);
	void Construct();
	class UWidget* On_EntryList_GenerateRow(class UObject* Item);
	void ClearSelection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalCategoryWidget_C">();
	}
	static class UJournalCategoryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalCategoryWidget_C>();
	}
};
static_assert(alignof(UJournalCategoryWidget_C) == 0x000004, "Wrong alignment on UJournalCategoryWidget_C");
static_assert(sizeof(UJournalCategoryWidget_C) == 0x000260, "Wrong size on UJournalCategoryWidget_C");
static_assert(offsetof(UJournalCategoryWidget_C, UberGraphFrame) == 0x000244, "Member 'UJournalCategoryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJournalCategoryWidget_C, EntryList) == 0x000248, "Member 'UJournalCategoryWidget_C::EntryList' has a wrong offset!");
static_assert(offsetof(UJournalCategoryWidget_C, ExpanderButton) == 0x00024C, "Member 'UJournalCategoryWidget_C::ExpanderButton' has a wrong offset!");
static_assert(offsetof(UJournalCategoryWidget_C, QuestCategory) == 0x000250, "Member 'UJournalCategoryWidget_C::QuestCategory' has a wrong offset!");
static_assert(offsetof(UJournalCategoryWidget_C, OnItemSelected) == 0x000254, "Member 'UJournalCategoryWidget_C::OnItemSelected' has a wrong offset!");

}

#pragma pack(pop)
