#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalCategoryWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function JournalCategoryWidget.JournalCategoryWidget_C.ExecuteUbergraph_JournalCategoryWidget
// 0x0074 (0x0074 - 0x0000)
struct JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x000C(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0024(0x000C)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0030(0x0018)()
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x004C(0x000C)(ZeroConstructor, ReferenceParm)
	class UFortQuestItem*                         K2Node_DynamicCast_AsFort_Quest_Item;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x000C)()
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnseenQuests_ReturnValue;              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget) == 0x000004, "Wrong alignment on JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget");
static_assert(sizeof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget) == 0x000074, "Wrong size on JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, EntryPoint) == 0x000000, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, Temp_bool_Variable) == 0x000004, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, Temp_byte_Variable) == 0x000005, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, Temp_byte_Variable2) == 0x000006, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_MakeStruct_FormatArgumentData) == 0x00000C, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000024, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_MakeStruct_FormatArgumentData2) == 0x000030, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_ComponentBoundEvent_Item) == 0x000048, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_MakeArray_Array) == 0x00004C, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_DynamicCast_AsFort_Quest_Item) == 0x000058, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_DynamicCast_AsFort_Quest_Item' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_DynamicCast_bSuccess) == 0x00005C, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, CallFunc_Format_ReturnValue) == 0x000060, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_ComponentBoundEvent_Button) == 0x00006C, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_ComponentBoundEvent_Selected) == 0x000070, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, K2Node_Select_Default) == 0x000071, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget, CallFunc_HasUnseenQuests_ReturnValue) == 0x000072, "Member 'JournalCategoryWidget_C_ExecuteUbergraph_JournalCategoryWidget::CallFunc_HasUnseenQuests_ReturnValue' has a wrong offset!");

// Function JournalCategoryWidget.JournalCategoryWidget_C.BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'JournalCategoryWidget_C_BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function JournalCategoryWidget.JournalCategoryWidget_C.BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature) == 0x000004, "Wrong alignment on JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature");
static_assert(sizeof(JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature) == 0x000004, "Wrong size on JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature");
static_assert(offsetof(JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature, Item) == 0x000000, "Member 'JournalCategoryWidget_C_BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature::Item' has a wrong offset!");

// Function JournalCategoryWidget.JournalCategoryWidget_C.On_EntryList_GenerateRow
// 0x0018 (0x0018 - 0x0000)
struct JournalCategoryWidget_C_On_EntryList_GenerateRow final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestItem*                         K2Node_DynamicCast_AsFort_Quest_Item;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJournalEntryListItem_C*                CallFunc_Create_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalCategoryWidget_C_On_EntryList_GenerateRow) == 0x000004, "Wrong alignment on JournalCategoryWidget_C_On_EntryList_GenerateRow");
static_assert(sizeof(JournalCategoryWidget_C_On_EntryList_GenerateRow) == 0x000018, "Wrong size on JournalCategoryWidget_C_On_EntryList_GenerateRow");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, Item) == 0x000000, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::Item' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, ReturnValue) == 0x000004, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, K2Node_DynamicCast_AsFort_Quest_Item) == 0x00000C, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::K2Node_DynamicCast_AsFort_Quest_Item' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JournalCategoryWidget_C_On_EntryList_GenerateRow, CallFunc_Create_ReturnValue) == 0x000014, "Member 'JournalCategoryWidget_C_On_EntryList_GenerateRow::CallFunc_Create_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
