#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass JournalWidget.JournalWidget_C
// 0x0044 (0x0288 - 0x0244)
class UJournalWidget_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             _Text__Primary_Header;                             // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UJournalDetails_C*                      _Widget__Journal_Details;                          // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVerticalBox*                           CategoryBox;                                       // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UCommanderRewardsShell_C*               CommanderRewardsShell;                             // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_16;                                          // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_28;                                          // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_140;                                         // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_314;                                         // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_1682;                                        // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_2091;                                        // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_2318;                                        // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UScrollBox*                             ScrollBox;                                         // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UJournalCategoryWidget_C*>       QuestCategories;                                   // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortQuestItem*                         SelectedQuest;                                     // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_JournalWidget(int32 EntryPoint);
	void HandleQuestsUpdates();
	void Construct();
	void Update(class UFortQuestManager* QuestManager);
	void QuestSelected(class UJournalCategoryWidget_C* CategoryWidget, class UFortQuestItem* SelectedQuest_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalWidget_C">();
	}
	static class UJournalWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalWidget_C>();
	}
};
static_assert(alignof(UJournalWidget_C) == 0x000004, "Wrong alignment on UJournalWidget_C");
static_assert(sizeof(UJournalWidget_C) == 0x000288, "Wrong size on UJournalWidget_C");
static_assert(offsetof(UJournalWidget_C, UberGraphFrame) == 0x000244, "Member 'UJournalWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, _Text__Primary_Header) == 0x000248, "Member 'UJournalWidget_C::_Text__Primary_Header' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, _Widget__Journal_Details) == 0x00024C, "Member 'UJournalWidget_C::_Widget__Journal_Details' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, CategoryBox) == 0x000250, "Member 'UJournalWidget_C::CategoryBox' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, CommanderRewardsShell) == 0x000254, "Member 'UJournalWidget_C::CommanderRewardsShell' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_16) == 0x000258, "Member 'UJournalWidget_C::Image_16' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_28) == 0x00025C, "Member 'UJournalWidget_C::Image_28' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_140) == 0x000260, "Member 'UJournalWidget_C::Image_140' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_314) == 0x000264, "Member 'UJournalWidget_C::Image_314' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_1682) == 0x000268, "Member 'UJournalWidget_C::Image_1682' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_2091) == 0x00026C, "Member 'UJournalWidget_C::Image_2091' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, Image_2318) == 0x000270, "Member 'UJournalWidget_C::Image_2318' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, ScrollBox) == 0x000274, "Member 'UJournalWidget_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, QuestCategories) == 0x000278, "Member 'UJournalWidget_C::QuestCategories' has a wrong offset!");
static_assert(offsetof(UJournalWidget_C, SelectedQuest) == 0x000284, "Member 'UJournalWidget_C::SelectedQuest' has a wrong offset!");

}

#pragma pack(pop)
