#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function JournalEntry.JournalEntry_C.ExecuteUbergraph_JournalEntry
// 0x0038 (0x0038 - 0x0000)
struct JournalEntry_C_ExecuteUbergraph_JournalEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortBaseButton* Button, bool SELECTED)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable2;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_CustomEvent_Button;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalEntry_C_ExecuteUbergraph_JournalEntry) == 0x000004, "Wrong alignment on JournalEntry_C_ExecuteUbergraph_JournalEntry");
static_assert(sizeof(JournalEntry_C_ExecuteUbergraph_JournalEntry) == 0x000038, "Wrong size on JournalEntry_C_ExecuteUbergraph_JournalEntry");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, EntryPoint) == 0x000000, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, Temp_bool_Variable) == 0x000004, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, Temp_float_Variable) == 0x000018, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, Temp_float_Variable2) == 0x00001C, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, K2Node_CustomEvent_Button) == 0x000024, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, K2Node_CustomEvent_Selected) == 0x000028, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, CallFunc_GetQuestManager_ReturnValue) == 0x00002C, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, CallFunc_GetSelected_ReturnValue) == 0x000030, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_ExecuteUbergraph_JournalEntry, K2Node_Select_Default) == 0x000034, "Member 'JournalEntry_C_ExecuteUbergraph_JournalEntry::K2Node_Select_Default' has a wrong offset!");

// Function JournalEntry.JournalEntry_C.HandleSelectedChanged
// 0x0008 (0x0008 - 0x0000)
struct JournalEntry_C_HandleSelectedChanged final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalEntry_C_HandleSelectedChanged) == 0x000004, "Wrong alignment on JournalEntry_C_HandleSelectedChanged");
static_assert(sizeof(JournalEntry_C_HandleSelectedChanged) == 0x000008, "Wrong size on JournalEntry_C_HandleSelectedChanged");
static_assert(offsetof(JournalEntry_C_HandleSelectedChanged, Button) == 0x000000, "Member 'JournalEntry_C_HandleSelectedChanged::Button' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_HandleSelectedChanged, SELECTED) == 0x000004, "Member 'JournalEntry_C_HandleSelectedChanged::SELECTED' has a wrong offset!");

// Function JournalEntry.JournalEntry_C.UpdateProgress
// 0x0030 (0x0030 - 0x0000)
struct JournalEntry_C_UpdateProgress final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestObjectiveInfo*                CallFunc_Array_Get_Item;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         TotalAchieved;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         TotalRequired;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalEntry_C_UpdateProgress) == 0x000004, "Wrong alignment on JournalEntry_C_UpdateProgress");
static_assert(sizeof(JournalEntry_C_UpdateProgress) == 0x000030, "Wrong size on JournalEntry_C_UpdateProgress");
static_assert(offsetof(JournalEntry_C_UpdateProgress, Temp_bool_Variable) == 0x000000, "Member 'JournalEntry_C_UpdateProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, Temp_byte_Variable) == 0x000001, "Member 'JournalEntry_C_UpdateProgress::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'JournalEntry_C_UpdateProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'JournalEntry_C_UpdateProgress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, Temp_byte_Variable2) == 0x000010, "Member 'JournalEntry_C_UpdateProgress::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, K2Node_Select_Default) == 0x000013, "Member 'JournalEntry_C_UpdateProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Array_Get_Item) == 0x000018, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, CallFunc_Add_IntInt_ReturnValue3) == 0x000024, "Member 'JournalEntry_C_UpdateProgress::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, TotalAchieved) == 0x000028, "Member 'JournalEntry_C_UpdateProgress::TotalAchieved' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_UpdateProgress, TotalRequired) == 0x00002C, "Member 'JournalEntry_C_UpdateProgress::TotalRequired' has a wrong offset!");

// Function JournalEntry.JournalEntry_C.Setup
// 0x0098 (0x0098 - 0x0000)
struct JournalEntry_C_Setup final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIconBrush_IconBrush;                   // 0x0008(0x0074)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x000C)()
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalEntry_C_Setup) == 0x000004, "Wrong alignment on JournalEntry_C_Setup");
static_assert(sizeof(JournalEntry_C_Setup) == 0x000098, "Wrong size on JournalEntry_C_Setup");
static_assert(offsetof(JournalEntry_C_Setup, Quest) == 0x000000, "Member 'JournalEntry_C_Setup::Quest' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, Temp_byte_Variable) == 0x000004, "Member 'JournalEntry_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000005, "Member 'JournalEntry_C_Setup::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, CallFunc_GetIconBrush_IconBrush) == 0x000008, "Member 'JournalEntry_C_Setup::CallFunc_GetIconBrush_IconBrush' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x00007C, "Member 'JournalEntry_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000080, "Member 'JournalEntry_C_Setup::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, Temp_byte_Variable2) == 0x000084, "Member 'JournalEntry_C_Setup::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'JournalEntry_C_Setup::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, Temp_bool_Variable) == 0x000094, "Member 'JournalEntry_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalEntry_C_Setup, K2Node_Select_Default) == 0x000095, "Member 'JournalEntry_C_Setup::K2Node_Select_Default' has a wrong offset!");

}

#pragma pack(pop)
