#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalObjectiveEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass JournalObjectiveEntry.JournalObjectiveEntry_C
// 0x0010 (0x0254 - 0x0244)
class UJournalObjectiveEntry_C final : public UFortListItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UJournalProgressWidget_C*               JournalProgressWidget;                             // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TaskName;                                          // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_JournalObjectiveEntry(int32 EntryPoint);
	void SetData(class UObject* InData);
	void UpdateProgress(class UFortQuestObjectiveInfo* Objective);
	void Update(class UFortQuestObjectiveInfo* Objective);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalObjectiveEntry_C">();
	}
	static class UJournalObjectiveEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalObjectiveEntry_C>();
	}
};
static_assert(alignof(UJournalObjectiveEntry_C) == 0x000004, "Wrong alignment on UJournalObjectiveEntry_C");
static_assert(sizeof(UJournalObjectiveEntry_C) == 0x000254, "Wrong size on UJournalObjectiveEntry_C");
static_assert(offsetof(UJournalObjectiveEntry_C, UberGraphFrame) == 0x000244, "Member 'UJournalObjectiveEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJournalObjectiveEntry_C, Background) == 0x000248, "Member 'UJournalObjectiveEntry_C::Background' has a wrong offset!");
static_assert(offsetof(UJournalObjectiveEntry_C, JournalProgressWidget) == 0x00024C, "Member 'UJournalObjectiveEntry_C::JournalProgressWidget' has a wrong offset!");
static_assert(offsetof(UJournalObjectiveEntry_C, TaskName) == 0x000250, "Member 'UJournalObjectiveEntry_C::TaskName' has a wrong offset!");

}

#pragma pack(pop)
