#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass JournalDetails.JournalDetails_C
// 0x0038 (0x027C - 0x0244)
class UJournalDetails_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonIconText_C*                      AbandonButton;                                     // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             DescriptionTextBlock;                              // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVerticalBox*                           DescriptionVerticalBox;                            // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_572;                                         // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                ProgressBorder;                                    // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 QuestIcon_Fill;                                    // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 QuestIcon_Shadow;                                  // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             QuestName;                                         // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        QuestSelectedWidgetSwitcher;                       // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                RewardsBorder;                                     // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class URewardsListWidget_C*                   RewardsListWidget;                                 // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UFortListView*                          TaskList;                                          // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UFortQuestItem*                         QuestItem;                                         // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_JournalDetails(int32 EntryPoint);
	void BndEvt__AbandonButton_K2Node_ComponentBoundEvent_71_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void Construct();
	void Setup(class UFortQuestItem* QuestItem_0, bool ShowObjectives, bool ShowRewards);
	void Update();
	void SetupAbandonBtn();
	class UWidget* GenerateAbandonButtonToolTipWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalDetails_C">();
	}
	static class UJournalDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalDetails_C>();
	}
};
static_assert(alignof(UJournalDetails_C) == 0x000004, "Wrong alignment on UJournalDetails_C");
static_assert(sizeof(UJournalDetails_C) == 0x00027C, "Wrong size on UJournalDetails_C");
static_assert(offsetof(UJournalDetails_C, UberGraphFrame) == 0x000244, "Member 'UJournalDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, AbandonButton) == 0x000248, "Member 'UJournalDetails_C::AbandonButton' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, DescriptionTextBlock) == 0x00024C, "Member 'UJournalDetails_C::DescriptionTextBlock' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, DescriptionVerticalBox) == 0x000250, "Member 'UJournalDetails_C::DescriptionVerticalBox' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, Image_572) == 0x000254, "Member 'UJournalDetails_C::Image_572' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, ProgressBorder) == 0x000258, "Member 'UJournalDetails_C::ProgressBorder' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, QuestIcon_Fill) == 0x00025C, "Member 'UJournalDetails_C::QuestIcon_Fill' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, QuestIcon_Shadow) == 0x000260, "Member 'UJournalDetails_C::QuestIcon_Shadow' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, QuestName) == 0x000264, "Member 'UJournalDetails_C::QuestName' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, QuestSelectedWidgetSwitcher) == 0x000268, "Member 'UJournalDetails_C::QuestSelectedWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, RewardsBorder) == 0x00026C, "Member 'UJournalDetails_C::RewardsBorder' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, RewardsListWidget) == 0x000270, "Member 'UJournalDetails_C::RewardsListWidget' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, TaskList) == 0x000274, "Member 'UJournalDetails_C::TaskList' has a wrong offset!");
static_assert(offsetof(UJournalDetails_C, QuestItem) == 0x000278, "Member 'UJournalDetails_C::QuestItem' has a wrong offset!");

}

#pragma pack(pop)
