#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalProgressWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass JournalProgressWidget.JournalProgressWidget_C
// 0x0014 (0x0258 - 0x0244)
class UJournalProgressWidget_C final : public UFortUserWidget
{
public:
	class UImage*                                 _Image__Checkbox;                                  // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UProgressBar*                           _ProgressBar__Quest_Progress;                      // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        _Switcher__Display_Mode;                           // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Progress_Value;                             // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextBlock_10431;                                   // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void Update(int32 Required, int32 Achieved);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalProgressWidget_C">();
	}
	static class UJournalProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalProgressWidget_C>();
	}
};
static_assert(alignof(UJournalProgressWidget_C) == 0x000004, "Wrong alignment on UJournalProgressWidget_C");
static_assert(sizeof(UJournalProgressWidget_C) == 0x000258, "Wrong size on UJournalProgressWidget_C");
static_assert(offsetof(UJournalProgressWidget_C, _Image__Checkbox) == 0x000244, "Member 'UJournalProgressWidget_C::_Image__Checkbox' has a wrong offset!");
static_assert(offsetof(UJournalProgressWidget_C, _ProgressBar__Quest_Progress) == 0x000248, "Member 'UJournalProgressWidget_C::_ProgressBar__Quest_Progress' has a wrong offset!");
static_assert(offsetof(UJournalProgressWidget_C, _Switcher__Display_Mode) == 0x00024C, "Member 'UJournalProgressWidget_C::_Switcher__Display_Mode' has a wrong offset!");
static_assert(offsetof(UJournalProgressWidget_C, _Text__Progress_Value) == 0x000250, "Member 'UJournalProgressWidget_C::_Text__Progress_Value' has a wrong offset!");
static_assert(offsetof(UJournalProgressWidget_C, TextBlock_10431) == 0x000254, "Member 'UJournalProgressWidget_C::TextBlock_10431' has a wrong offset!");

}

#pragma pack(pop)
