#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function LeaveButton.LeaveButton_C.ExecuteUbergraph_LeaveButton
// 0x0390 (0x0390 - 0x0000)
struct LeaveButton_C_ExecuteUbergraph_LeaveButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x000C)()
	class FText                                   Temp_text_Variable2;                               // 0x001C(0x000C)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0030(0x000C)()
	class FText                                   Temp_text_Variable4;                               // 0x003C(0x000C)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue2;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x005C(0x000C)()
	class FText                                   K2Node_Select2_Default;                            // 0x0068(0x000C)()
	class UFortOutpostContext*                    CallFunc_GetContext_ReturnValue6;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable5;                               // 0x007C(0x000C)()
	class FText                                   Temp_text_Variable6;                               // 0x0088(0x000C)()
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue7;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue2;   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x00B0(0x000C)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowConfirmation*      CallFunc_ShowConfirmationDialog_ReturnValue;       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_NewTeamMemberInfo;              // 0x00E4(0x01E8)()
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable7;                               // 0x02D4(0x000C)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x02F0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   Temp_text_Variable8;                               // 0x0300(0x000C)()
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate6;             // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate7;             // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x0330(0x000C)()
	class FText                                   K2Node_Select5_Default;                            // 0x033C(0x000C)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAsyncAction_ShowConfirmation*      CallFunc_ShowConfirmationDialog_ReturnValue2;      // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0357(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x036C(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue8;                  // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x000004, "Wrong alignment on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(sizeof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x000390, "Wrong size on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, EntryPoint) == 0x000000, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue) == 0x000004, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable) == 0x000008, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x00000C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable) == 0x000010, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable2) == 0x00001C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable2) == 0x00002C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsInOutpostZone_ReturnValue) == 0x00002D, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable3) == 0x00002E, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable3) == 0x000030, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable4) == 0x00003C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue4) == 0x00004C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000050, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue5) == 0x000054, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsInOutpostZone_ReturnValue2) == 0x000059, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsInOutpostZone_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select_Default) == 0x00005C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select2_Default) == 0x000068, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue6) == 0x000074, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable4) == 0x000078, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable5) == 0x00007C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable6) == 0x000088, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue7) == 0x000094, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue2) == 0x000098, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Greater_IntInt_ReturnValue2) == 0x0000AC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select3_Default) == 0x0000B0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate2) == 0x0000BC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowConfirmationDialog_ReturnValue) == 0x0000CC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowConfirmationDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D4, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_NewTeamMemberInfo) == 0x0000E4, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_NewTeamMemberInfo' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_PlayerIndex) == 0x0002CC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_ComponentBoundEvent_Button) == 0x0002D0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable7) == 0x0002D4, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate4) == 0x0002E0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate5) == 0x0002F0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable8) == 0x000300, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate6) == 0x00030C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate7) == 0x00031C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable5) == 0x00032C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select4_Default) == 0x000330, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select5_Default) == 0x00033C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000348, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowConfirmationDialog_ReturnValue2) == 0x00034C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowConfirmationDialog_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_AsBP_Player_Controller_Outpost) == 0x000350, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_AsBP_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_bSuccess) == 0x000354, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsOutpostOwner_ReturnValue) == 0x000355, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue2) == 0x000356, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsConsideredInGame_InGame) == 0x000357, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate8) == 0x000358, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Event_IsDesignTime) == 0x000368, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate9) == 0x00036C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue8) == 0x00037C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate10) == 0x000380, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LeaveButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong alignment on LeaveButton_C_PreConstruct");
static_assert(sizeof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong size on LeaveButton_C_PreConstruct");
static_assert(offsetof(LeaveButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LeaveButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.BndEvt__[Button] Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LeaveButton_C_BndEvt___Button__Leave_K2Node_ComponentBoundEvent_84_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberRemoved
// 0x0004 (0x0004 - 0x0000)
struct LeaveButton_C_HandleTeamMemberRemoved final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong alignment on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong size on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberRemoved, PlayerIndex) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberRemoved::PlayerIndex' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberAdded
// 0x01E8 (0x01E8 - 0x0000)
struct LeaveButton_C_HandleTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    NewTeamMemberInfo;                                 // 0x0000(0x01E8)(Parm)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberAdded) == 0x000004, "Wrong alignment on LeaveButton_C_HandleTeamMemberAdded");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberAdded) == 0x0001E8, "Wrong size on LeaveButton_C_HandleTeamMemberAdded");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberAdded, NewTeamMemberInfo) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberAdded::NewTeamMemberInfo' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.GetLeaveActionText
// 0x0068 (0x0068 - 0x0000)
struct LeaveButton_C_GetLeaveActionText final
{
public:
	class FText                                   TEXT;                                              // 0x0000(0x000C)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x000C(0x000C)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x001C(0x000C)()
	class FText                                   Temp_text_Variable3;                               // 0x0028(0x000C)()
	bool                                          Temp_bool_Variable2;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x000C)()
	class FText                                   K2Node_Select2_Default;                            // 0x005C(0x000C)()
};
static_assert(alignof(LeaveButton_C_GetLeaveActionText) == 0x000004, "Wrong alignment on LeaveButton_C_GetLeaveActionText");
static_assert(sizeof(LeaveButton_C_GetLeaveActionText) == 0x000068, "Wrong size on LeaveButton_C_GetLeaveActionText");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, TEXT) == 0x000000, "Member 'LeaveButton_C_GetLeaveActionText::TEXT' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable) == 0x00000C, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable) == 0x000018, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable2) == 0x00001C, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable3) == 0x000028, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable2) == 0x000034, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame) == 0x00003C, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_AsBP_Player_Controller_Outpost) == 0x000040, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_AsBP_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_bSuccess) == 0x000044, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsOutpostOwner_ReturnValue) == 0x000045, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsInOutpostZone_ReturnValue) == 0x00004C, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default) == 0x000050, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select2_Default) == 0x00005C, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select2_Default' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.IsConsideredInGame
// 0x0010 (0x0010 - 0x0000)
struct LeaveButton_C_IsConsideredInGame final
{
public:
	bool                                          InGame;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_IsConsideredInGame) == 0x000004, "Wrong alignment on LeaveButton_C_IsConsideredInGame");
static_assert(sizeof(LeaveButton_C_IsConsideredInGame) == 0x000010, "Wrong size on LeaveButton_C_IsConsideredInGame");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, InGame) == 0x000000, "Member 'LeaveButton_C_IsConsideredInGame::InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue) == 0x000004, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue2) == 0x000008, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_IsInLobby_ReturnValue) == 0x00000C, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_IsInZone_ReturnValue) == 0x00000D, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.UpdateState
// 0x001C (0x001C - 0x0000)
struct LeaveButton_C_UpdateState final
{
public:
	class FText                                   CallFunc_GetLeaveActionText_Text;                  // 0x0000(0x000C)()
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_UpdateState) == 0x000004, "Wrong alignment on LeaveButton_C_UpdateState");
static_assert(sizeof(LeaveButton_C_UpdateState) == 0x00001C, "Wrong size on LeaveButton_C_UpdateState");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetLeaveActionText_Text) == 0x000000, "Member 'LeaveButton_C_UpdateState::CallFunc_GetLeaveActionText_Text' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_IsConsideredInGame_InGame) == 0x00000C, "Member 'LeaveButton_C_UpdateState::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'LeaveButton_C_UpdateState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000014, "Member 'LeaveButton_C_UpdateState::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'LeaveButton_C_UpdateState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'LeaveButton_C_UpdateState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.LeaveParty
// 0x000C (0x000C - 0x0000)
struct LeaveButton_C_LeaveParty final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               CallFunc_GetFrontEndCamera_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_LeaveParty) == 0x000004, "Wrong alignment on LeaveButton_C_LeaveParty");
static_assert(sizeof(LeaveButton_C_LeaveParty) == 0x00000C, "Wrong size on LeaveButton_C_LeaveParty");
static_assert(offsetof(LeaveButton_C_LeaveParty, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'LeaveButton_C_LeaveParty::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_LeaveParty, CallFunc_GetContext_ReturnValue2) == 0x000004, "Member 'LeaveButton_C_LeaveParty::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_LeaveParty, CallFunc_GetFrontEndCamera_ReturnValue) == 0x000008, "Member 'LeaveButton_C_LeaveParty::CallFunc_GetFrontEndCamera_ReturnValue' has a wrong offset!");
