#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass LightBox.LightBox_C
// 0x0024 (0x0268 - 0x0244)
class ULightBox_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade_Out;                                          // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Fade_In;                                           // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UNamedSlot*                             _Slot_CenterContent;                               // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	bool                                          DestroyContentPostFadeOut;                         // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActionHandlerPanel*                ContainedActionHandlerPanel;                       // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	UMulticastDelegateProperty_                   CenterContentCleared;                              // 0x025C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_LightBox(int32 EntryPoint);
	void OnFadeOutComplete();
	void Destruct();
	void Construct();
	void OnPanelDeactivated();
	void AddActivePanelContent(class UFortActionHandlerPanel* ActionHandlerPanel, EHorizontalAlignment InHorizontal_Alignment, EVerticalAlignment InVertical_Alignment);
	void EstablishContainedPanel(class UFortActionHandlerPanel* New_Panel);
	void OnPanelActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LightBox_C">();
	}
	static class ULightBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightBox_C>();
	}
};
static_assert(alignof(ULightBox_C) == 0x000004, "Wrong alignment on ULightBox_C");
static_assert(sizeof(ULightBox_C) == 0x000268, "Wrong size on ULightBox_C");
static_assert(offsetof(ULightBox_C, UberGraphFrame) == 0x000244, "Member 'ULightBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULightBox_C, Fade_Out) == 0x000248, "Member 'ULightBox_C::Fade_Out' has a wrong offset!");
static_assert(offsetof(ULightBox_C, Fade_In) == 0x00024C, "Member 'ULightBox_C::Fade_In' has a wrong offset!");
static_assert(offsetof(ULightBox_C, _Slot_CenterContent) == 0x000250, "Member 'ULightBox_C::_Slot_CenterContent' has a wrong offset!");
static_assert(offsetof(ULightBox_C, DestroyContentPostFadeOut) == 0x000254, "Member 'ULightBox_C::DestroyContentPostFadeOut' has a wrong offset!");
static_assert(offsetof(ULightBox_C, ContainedActionHandlerPanel) == 0x000258, "Member 'ULightBox_C::ContainedActionHandlerPanel' has a wrong offset!");
static_assert(offsetof(ULightBox_C, CenterContentCleared) == 0x00025C, "Member 'ULightBox_C::CenterContentCleared' has a wrong offset!");

}

#pragma pack(pop)
