#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function LightBox.LightBox_C.ExecuteUbergraph_LightBox
// 0x0030 (0x0030 - 0x0000)
struct LightBox_C_ExecuteUbergraph_LightBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortActionHandlerPanel*                K2Node_DynamicCast_AsFort_Action_Handler_Panel;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LightBox_C_ExecuteUbergraph_LightBox) == 0x000004, "Wrong alignment on LightBox_C_ExecuteUbergraph_LightBox");
static_assert(sizeof(LightBox_C_ExecuteUbergraph_LightBox) == 0x000030, "Wrong size on LightBox_C_ExecuteUbergraph_LightBox");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, EntryPoint) == 0x000000, "Member 'LightBox_C_ExecuteUbergraph_LightBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, Temp_bool_Variable) == 0x000004, "Member 'LightBox_C_ExecuteUbergraph_LightBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, Temp_int_Variable) == 0x000008, "Member 'LightBox_C_ExecuteUbergraph_LightBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'LightBox_C_ExecuteUbergraph_LightBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'LightBox_C_ExecuteUbergraph_LightBox::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'LightBox_C_ExecuteUbergraph_LightBox::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, K2Node_DynamicCast_AsFort_Action_Handler_Panel) == 0x000024, "Member 'LightBox_C_ExecuteUbergraph_LightBox::K2Node_DynamicCast_AsFort_Action_Handler_Panel' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'LightBox_C_ExecuteUbergraph_LightBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, Temp_bool_Variable2) == 0x000029, "Member 'LightBox_C_ExecuteUbergraph_LightBox::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, K2Node_Select_Default) == 0x00002A, "Member 'LightBox_C_ExecuteUbergraph_LightBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, CallFunc_IsValid_ReturnValue) == 0x00002B, "Member 'LightBox_C_ExecuteUbergraph_LightBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_ExecuteUbergraph_LightBox, CallFunc_PauseAnimation_ReturnValue) == 0x00002C, "Member 'LightBox_C_ExecuteUbergraph_LightBox::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");

// Function LightBox.LightBox_C.AddActivePanelContent
// 0x001C (0x001C - 0x0000)
struct LightBox_C_AddActivePanelContent final
{
public:
	class UFortActionHandlerPanel*                ActionHandlerPanel;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          InHorizontal_Alignment;                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            InVertical_Alignment;                              // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActionHandlerPanel*                NewActionHandlerPanel;                             // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LightBox_C_AddActivePanelContent) == 0x000004, "Wrong alignment on LightBox_C_AddActivePanelContent");
static_assert(sizeof(LightBox_C_AddActivePanelContent) == 0x00001C, "Wrong size on LightBox_C_AddActivePanelContent");
static_assert(offsetof(LightBox_C_AddActivePanelContent, ActionHandlerPanel) == 0x000000, "Member 'LightBox_C_AddActivePanelContent::ActionHandlerPanel' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, InHorizontal_Alignment) == 0x000004, "Member 'LightBox_C_AddActivePanelContent::InHorizontal_Alignment' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, InVertical_Alignment) == 0x000005, "Member 'LightBox_C_AddActivePanelContent::InVertical_Alignment' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000008, "Member 'LightBox_C_AddActivePanelContent::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, CallFunc_AddChild_ReturnValue) == 0x00000C, "Member 'LightBox_C_AddActivePanelContent::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'LightBox_C_AddActivePanelContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, NewActionHandlerPanel) == 0x000014, "Member 'LightBox_C_AddActivePanelContent::NewActionHandlerPanel' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, VerticalAlignment) == 0x000018, "Member 'LightBox_C_AddActivePanelContent::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(LightBox_C_AddActivePanelContent, HorizontalAlignment) == 0x000019, "Member 'LightBox_C_AddActivePanelContent::HorizontalAlignment' has a wrong offset!");

// Function LightBox.LightBox_C.EstablishContainedPanel
// 0x0024 (0x0024 - 0x0000)
struct LightBox_C_EstablishContainedPanel final
{
public:
	class UFortActionHandlerPanel*                New_Panel;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LightBox_C_EstablishContainedPanel) == 0x000004, "Wrong alignment on LightBox_C_EstablishContainedPanel");
static_assert(sizeof(LightBox_C_EstablishContainedPanel) == 0x000024, "Wrong size on LightBox_C_EstablishContainedPanel");
static_assert(offsetof(LightBox_C_EstablishContainedPanel, New_Panel) == 0x000000, "Member 'LightBox_C_EstablishContainedPanel::New_Panel' has a wrong offset!");
static_assert(offsetof(LightBox_C_EstablishContainedPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LightBox_C_EstablishContainedPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LightBox_C_EstablishContainedPanel, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'LightBox_C_EstablishContainedPanel::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

}

#pragma pack(pop)
