#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LlamaAnim_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass LlamaAnim_BP.LlamaAnim_BP_C
// 0x00DC (0x03EC - 0x0310)
class ULlamaAnim_BP_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8ADDC02643B32A1F7CC89BB11903C1F2; // 0x0314(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C6CBF2C14D7E2661FA836083EBC21EC6; // 0x0340(0x0044)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E380EEC3438D7B982F70B1B965A9BC1B; // 0x0384(0x0058)()
	bool                                          readyToPop;                                        // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_Explorer_OutlanderFragment_Llama_C* Owning_Llama_Fragment;                             // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimMontage*                           LlamaMontage;                                      // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimMontage*                           LlamaMontage1;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LlamaAnim_BP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_LlamasHeadIsReadyToBurst();
	void TheHeadProjectileHasSpawned();
	void Play_First_Explosion_Animation();
	void AnimNotify_LlamaDeathAnimationCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LlamaAnim_BP_C">();
	}
	static class ULlamaAnim_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULlamaAnim_BP_C>();
	}
};
static_assert(alignof(ULlamaAnim_BP_C) == 0x000004, "Wrong alignment on ULlamaAnim_BP_C");
static_assert(sizeof(ULlamaAnim_BP_C) == 0x0003EC, "Wrong size on ULlamaAnim_BP_C");
static_assert(offsetof(ULlamaAnim_BP_C, UberGraphFrame) == 0x000310, "Member 'ULlamaAnim_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, AnimGraphNode_Root_8ADDC02643B32A1F7CC89BB11903C1F2) == 0x000314, "Member 'ULlamaAnim_BP_C::AnimGraphNode_Root_8ADDC02643B32A1F7CC89BB11903C1F2' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, AnimGraphNode_Slot_C6CBF2C14D7E2661FA836083EBC21EC6) == 0x000340, "Member 'ULlamaAnim_BP_C::AnimGraphNode_Slot_C6CBF2C14D7E2661FA836083EBC21EC6' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, AnimGraphNode_SequencePlayer_E380EEC3438D7B982F70B1B965A9BC1B) == 0x000384, "Member 'ULlamaAnim_BP_C::AnimGraphNode_SequencePlayer_E380EEC3438D7B982F70B1B965A9BC1B' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, readyToPop) == 0x0003DC, "Member 'ULlamaAnim_BP_C::readyToPop' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, Owning_Llama_Fragment) == 0x0003E0, "Member 'ULlamaAnim_BP_C::Owning_Llama_Fragment' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, LlamaMontage) == 0x0003E4, "Member 'ULlamaAnim_BP_C::LlamaMontage' has a wrong offset!");
static_assert(offsetof(ULlamaAnim_BP_C, LlamaMontage1) == 0x0003E8, "Member 'ULlamaAnim_BP_C::LlamaMontage1' has a wrong offset!");

}

#pragma pack(pop)
