#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// ScriptStruct Lobby.LobbyPlayerStateActorInfo
// 0x0004 (0x0010 - 0x000C)
struct FLobbyPlayerStateActorInfo final : public FFastArraySerializerItem
{
public:
	class ALobbyBeaconPlayerState*                LobbyPlayerState;                                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLobbyPlayerStateActorInfo) == 0x000004, "Wrong alignment on FLobbyPlayerStateActorInfo");
static_assert(sizeof(FLobbyPlayerStateActorInfo) == 0x000010, "Wrong size on FLobbyPlayerStateActorInfo");
static_assert(offsetof(FLobbyPlayerStateActorInfo, LobbyPlayerState) == 0x00000C, "Member 'FLobbyPlayerStateActorInfo::LobbyPlayerState' has a wrong offset!");

// ScriptStruct Lobby.LobbyPlayerStateInfoArray
// 0x0010 (0x0090 - 0x0080)
struct FLobbyPlayerStateInfoArray final : public FFastArraySerializer
{
public:
	TArray<struct FLobbyPlayerStateActorInfo>     Players;                                           // 0x0080(0x000C)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class ALobbyBeaconState*                      ParentState;                                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FLobbyPlayerStateInfoArray) == 0x000004, "Wrong alignment on FLobbyPlayerStateInfoArray");
static_assert(sizeof(FLobbyPlayerStateInfoArray) == 0x000090, "Wrong size on FLobbyPlayerStateInfoArray");
static_assert(offsetof(FLobbyPlayerStateInfoArray, Players) == 0x000080, "Member 'FLobbyPlayerStateInfoArray::Players' has a wrong offset!");
static_assert(offsetof(FLobbyPlayerStateInfoArray, ParentState) == 0x00008C, "Member 'FLobbyPlayerStateInfoArray::ParentState' has a wrong offset!");

}

#pragma pack(pop)
