#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: McpProfileSys

#include "Basic.hpp"

#include "McpProfileSys_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function McpProfileSys.McpProfile.DeleteAllProfiles
// 0x0018 (0x0018 - 0x0000)
struct McpProfile_DeleteAllProfiles final
{
public:
	struct FClientUrlContext                      Context;                                           // 0x0000(0x0018)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
static_assert(alignof(McpProfile_DeleteAllProfiles) == 0x000004, "Wrong alignment on McpProfile_DeleteAllProfiles");
static_assert(sizeof(McpProfile_DeleteAllProfiles) == 0x000018, "Wrong size on McpProfile_DeleteAllProfiles");
static_assert(offsetof(McpProfile_DeleteAllProfiles, Context) == 0x000000, "Member 'McpProfile_DeleteAllProfiles::Context' has a wrong offset!");

// Function McpProfileSys.McpProfile.DeleteProfile
// 0x0018 (0x0018 - 0x0000)
struct McpProfile_DeleteProfile final
{
public:
	struct FClientUrlContext                      Context;                                           // 0x0000(0x0018)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
static_assert(alignof(McpProfile_DeleteProfile) == 0x000004, "Wrong alignment on McpProfile_DeleteProfile");
static_assert(sizeof(McpProfile_DeleteProfile) == 0x000018, "Wrong size on McpProfile_DeleteProfile");
static_assert(offsetof(McpProfile_DeleteProfile, Context) == 0x000000, "Member 'McpProfile_DeleteProfile::Context' has a wrong offset!");

// Function McpProfileSys.McpProfile.QueryProfile
// 0x0018 (0x0018 - 0x0000)
struct McpProfile_QueryProfile final
{
public:
	struct FBaseUrlContext                        Context;                                           // 0x0000(0x0018)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
static_assert(alignof(McpProfile_QueryProfile) == 0x000004, "Wrong alignment on McpProfile_QueryProfile");
static_assert(sizeof(McpProfile_QueryProfile) == 0x000018, "Wrong size on McpProfile_QueryProfile");
static_assert(offsetof(McpProfile_QueryProfile, Context) == 0x000000, "Member 'McpProfile_QueryProfile::Context' has a wrong offset!");

}

#pragma pack(pop)
