#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessagingRpc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// ScriptStruct MessagingRpc.RpcMessage
// 0x0010 (0x0010 - 0x0000)
struct FRpcMessage final
{
public:
	struct FGuid                                  CallId;                                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRpcMessage) == 0x000004, "Wrong alignment on FRpcMessage");
static_assert(sizeof(FRpcMessage) == 0x000010, "Wrong size on FRpcMessage");
static_assert(offsetof(FRpcMessage, CallId) == 0x000000, "Member 'FRpcMessage::CallId' has a wrong offset!");

// ScriptStruct MessagingRpc.MessageRpcUnhandled
// 0x0010 (0x0010 - 0x0000)
struct FMessageRpcUnhandled final
{
public:
	struct FGuid                                  CallId;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMessageRpcUnhandled) == 0x000004, "Wrong alignment on FMessageRpcUnhandled");
static_assert(sizeof(FMessageRpcUnhandled) == 0x000010, "Wrong size on FMessageRpcUnhandled");
static_assert(offsetof(FMessageRpcUnhandled, CallId) == 0x000000, "Member 'FMessageRpcUnhandled::CallId' has a wrong offset!");

// ScriptStruct MessagingRpc.MessageRpcProgress
// 0x0020 (0x0020 - 0x0000)
struct FMessageRpcProgress final
{
public:
	float                                         Completion;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  CallId;                                            // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StatusText;                                        // 0x0014(0x000C)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMessageRpcProgress) == 0x000004, "Wrong alignment on FMessageRpcProgress");
static_assert(sizeof(FMessageRpcProgress) == 0x000020, "Wrong size on FMessageRpcProgress");
static_assert(offsetof(FMessageRpcProgress, Completion) == 0x000000, "Member 'FMessageRpcProgress::Completion' has a wrong offset!");
static_assert(offsetof(FMessageRpcProgress, CallId) == 0x000004, "Member 'FMessageRpcProgress::CallId' has a wrong offset!");
static_assert(offsetof(FMessageRpcProgress, StatusText) == 0x000014, "Member 'FMessageRpcProgress::StatusText' has a wrong offset!");

// ScriptStruct MessagingRpc.MessageRpcCancel
// 0x0010 (0x0010 - 0x0000)
struct FMessageRpcCancel final
{
public:
	struct FGuid                                  CallId;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMessageRpcCancel) == 0x000004, "Wrong alignment on FMessageRpcCancel");
static_assert(sizeof(FMessageRpcCancel) == 0x000010, "Wrong size on FMessageRpcCancel");
static_assert(offsetof(FMessageRpcCancel, CallId) == 0x000000, "Member 'FMessageRpcCancel::CallId' has a wrong offset!");

}

#pragma pack(pop)
