#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieWidget

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function MovieWidget.MovieWidget_C.ExecuteUbergraph_MovieWidget
// 0x0004 (0x0004 - 0x0000)
struct MovieWidget_C_ExecuteUbergraph_MovieWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieWidget_C_ExecuteUbergraph_MovieWidget) == 0x000004, "Wrong alignment on MovieWidget_C_ExecuteUbergraph_MovieWidget");
static_assert(sizeof(MovieWidget_C_ExecuteUbergraph_MovieWidget) == 0x000004, "Wrong size on MovieWidget_C_ExecuteUbergraph_MovieWidget");
static_assert(offsetof(MovieWidget_C_ExecuteUbergraph_MovieWidget, EntryPoint) == 0x000000, "Member 'MovieWidget_C_ExecuteUbergraph_MovieWidget::EntryPoint' has a wrong offset!");

// Function MovieWidget.MovieWidget_C.Init
// 0x000C (0x000C - 0x0000)
struct MovieWidget_C_Init final
{
public:
	class UMediaTexture*                          inMediaTexture;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieWidget_C_Init) == 0x000004, "Wrong alignment on MovieWidget_C_Init");
static_assert(sizeof(MovieWidget_C_Init) == 0x00000C, "Wrong size on MovieWidget_C_Init");
static_assert(offsetof(MovieWidget_C_Init, inMediaTexture) == 0x000000, "Member 'MovieWidget_C_Init::inMediaTexture' has a wrong offset!");
static_assert(offsetof(MovieWidget_C_Init, CallFunc_SetLooping_ReturnValue) == 0x000004, "Member 'MovieWidget_C_Init::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieWidget_C_Init, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'MovieWidget_C_Init::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
