#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass MovieWidget.MovieWidget_C
// 0x000C (0x0254 - 0x0248)
class UMovieWidget_C final : public UFortMovieWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Video_Border;                                      // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class USizeBox*                               Video_SizeBox;                                     // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_MovieWidget(int32 EntryPoint);
	void Destruct();
	void Init(class UMediaTexture* inMediaTexture);
	void StopPlaying();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MovieWidget_C">();
	}
	static class UMovieWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieWidget_C>();
	}
};
static_assert(alignof(UMovieWidget_C) == 0x000004, "Wrong alignment on UMovieWidget_C");
static_assert(sizeof(UMovieWidget_C) == 0x000254, "Wrong size on UMovieWidget_C");
static_assert(offsetof(UMovieWidget_C, UberGraphFrame) == 0x000248, "Member 'UMovieWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, Video_Border) == 0x00024C, "Member 'UMovieWidget_C::Video_Border' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, Video_SizeBox) == 0x000250, "Member 'UMovieWidget_C::Video_SizeBox' has a wrong offset!");

}

#pragma pack(pop)
