#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyTown_BuildingGroups

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// UserDefinedStruct MyTown_BuildingGroups.MyTown_BuildingGroups
// 0x001C (0x001C - 0x0000)
struct FMyTown_BuildingGroups final
{
public:
	TArray<class AMyTownBuildingActor*>           BuildingGroupsArray_39_DD52A83B4AA3691ABC472E8B70290210; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UMaterialInstanceDynamic*>       BuildingMaterialArray_44_3A0C66FD4A70D5026F5E12A2C304DACE; // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	class UTexture2D*                             UIIconTexture_49_586D92D746767BA2F99FDBB51B2B59DA; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FMyTown_BuildingGroups) == 0x000004, "Wrong alignment on FMyTown_BuildingGroups");
static_assert(sizeof(FMyTown_BuildingGroups) == 0x00001C, "Wrong size on FMyTown_BuildingGroups");
static_assert(offsetof(FMyTown_BuildingGroups, BuildingGroupsArray_39_DD52A83B4AA3691ABC472E8B70290210) == 0x000000, "Member 'FMyTown_BuildingGroups::BuildingGroupsArray_39_DD52A83B4AA3691ABC472E8B70290210' has a wrong offset!");
static_assert(offsetof(FMyTown_BuildingGroups, BuildingMaterialArray_44_3A0C66FD4A70D5026F5E12A2C304DACE) == 0x00000C, "Member 'FMyTown_BuildingGroups::BuildingMaterialArray_44_3A0C66FD4A70D5026F5E12A2C304DACE' has a wrong offset!");
static_assert(offsetof(FMyTown_BuildingGroups, UIIconTexture_49_586D92D746767BA2F99FDBB51B2B59DA) == 0x000018, "Member 'FMyTown_BuildingGroups::UIIconTexture_49_586D92D746767BA2F99FDBB51B2B59DA' has a wrong offset!");

}

#pragma pack(pop)
