#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyTown_Building_Master

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MyTown_BuildingGroups_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function MyTown_Building_Master.MyTown_Building_Master_C.ExecuteUbergraph_MyTown_Building_Master
// 0x0BC0 (0x0BC0 - 0x0000)
struct MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable8;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_MID2;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_Parameter2;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Parameter_Collection2;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_MID;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_Parameter;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Parameter_Collection;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_MID_Array;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_SquashIntensity;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable8;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& BuildingTemplateId, bool bSuccess)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& BuildingTemplateId)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue4;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue5;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue6;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0114(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x0194(0x0080)(ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult3;      // 0x0220(0x0080)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& BuildingTemplateId)> K2Node_CreateDelegate_OutputDelegate5;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x02C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult4;      // 0x02E0(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult5;      // 0x0360(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult6;      // 0x03E0(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult7;      // 0x0460(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMyTownBuildingState NewState, EMyTownBuildingState OldState)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0500(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_Time;                           // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0514(0x0080)(ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0594(0x0004)()
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x05E4(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult8;      // 0x0670(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult9;      // 0x06F0(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult10;     // 0x0770(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult11;     // 0x07F0(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D[0x3];                                      // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item;                           // 0x0880(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item2;                          // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A5[0x3];                                      // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item3;                          // 0x08A8(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item4;                          // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x08CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CD[0x3];                                      // 0x08CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item5;                          // 0x08D0(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item6;                          // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item7;                          // 0x08F0(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item8;                          // 0x090C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_915[0x3];                                      // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x091C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91D[0x3];                                      // 0x091D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item9;                          // 0x0920(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item10;                         // 0x093C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945[0x3];                                      // 0x0945(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyTown_BuildingGroups                 CallFunc_Array_Get_Item11;                         // 0x0948(0x001C)()
	class AMyTownBuildingActor*                   CallFunc_Array_Get_Item12;                         // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x096C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingFriendsHomeBase_ReturnValue;     // 0x096D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingFriendsHomeBase_ReturnValue2;    // 0x096E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingFriendsHomeBase_ReturnValue3;    // 0x096F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingFriendsHomeBase_ReturnValue4;    // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingActorDisplayState              CallFunc_GetCustomDisplayState_ReturnValue;        // 0x0971(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0972(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_973[0x1];                                      // 0x0973(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x097A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x097B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue5;                        // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0984(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0985(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0986(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_987[0x1];                                      // 0x0987(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHB_RoadManager_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0988(0x000C)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Lerp_ReturnValue6;                        // 0x0994(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHB_RoadManager_C*                      CallFunc_Array_Get_Item13;                         // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_CustomEvent_Building_Template_ID;           // 0x099C(0x000C)(ZeroConstructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue;             // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AA[0x2];                                      // 0x09AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue7;                        // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          K2Node_CustomEvent_NewState;                       // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          K2Node_CustomEvent_OldState;                       // 0x09B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B2[0x2];                                      // 0x09B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x09B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue2;            // 0x09BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x09BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue3;            // 0x09BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x09BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue4;            // 0x09BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x09BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_CustomEvent_BuildingTemplateId3;            // 0x09C0(0x000C)(ZeroConstructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue5;            // 0x09CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x09CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x09CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue6;            // 0x09CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMyTownBuildingState                          CallFunc_GetBuildingState_ReturnValue7;            // 0x09D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x09D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D3[0x1];                                      // 0x09D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMyTownRoadData3D>              CallFunc_GetRoadsInfo_ReturnValue;                 // 0x09D4(0x000C)(ZeroConstructor, ReferenceParm)
	struct FMyTownRoadData3D                      CallFunc_Array_Get_Item14;                         // 0x09E0(0x000C)()
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x09F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenBuilt_Building_is_Built;           // 0x09F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F3[0x1];                                      // 0x09F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_HasBeenBuilt_Building_Level;              // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenBuilt_Building_is_Built2;          // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F9[0x3];                                      // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_HasBeenBuilt_Building_Level2;             // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBuildingLevel_ReturnValue;             // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0A04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A05[0x3];                                      // 0x0A05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_BuildingTemplateId2;            // 0x0A08(0x000C)(ZeroConstructor)
	class FString                                 K2Node_CustomEvent_BuildingTemplateId;             // 0x0A14(0x000C)(ZeroConstructor)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0A21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A22[0x2];                                      // 0x0A22(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBuildingLevel_ReturnValue2;            // 0x0A24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue3;           // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0A29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0A2A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2B[0x1];                                      // 0x0A2B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMyFort_Manager_C*>              CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0A2C(0x000C)(ZeroConstructor, ReferenceParm)
	class AMyFort_Manager_C*                      CallFunc_Array_Get_Item15;                         // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0A3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0A3D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3E[0x2];                                      // 0x0A3E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyTownData*                            CallFunc_GetMyTownData_ReturnValue;                // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMyTownBuildingData                    CallFunc_Array_Get_Item16;                         // 0x0A44(0x0008)()
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0A4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0A51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0A52(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A53[0x1];                                      // 0x0A53(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0A54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0A59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5A[0x2];                                      // 0x0A5A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBannerPattern_ReturnValue;             // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0A60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A61[0x3];                                      // 0x0A61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0A64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMyTownData*                            CallFunc_GetMyTownData_ReturnValue2;               // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0A6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMyTownBannerData                      CallFunc_Array_Get_Item17;                         // 0x0A70(0x00E8)()
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5D[0x3];                                      // 0x0B5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource3;             // 0x0B60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus3;              // 0x0B64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent3;             // 0x0B68(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x0B80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x0B84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x0B88(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0BA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0BA8(0x0018)(ConstParm)
};
static_assert(alignof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master) == 0x000004, "Wrong alignment on MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master");
static_assert(sizeof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master) == 0x000BC0, "Wrong size on MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, EntryPoint) == 0x000000, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable2) == 0x000010, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue2) == 0x000014, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable2) == 0x000018, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable3) == 0x00001C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable3) == 0x000020, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue3) == 0x000024, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable4) == 0x000028, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable4) == 0x00002C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable5) == 0x000030, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue4) == 0x000034, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue5) == 0x000038, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable5) == 0x00003C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable6) == 0x000040, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable6) == 0x000044, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue6) == 0x000048, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable7) == 0x00004C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable7' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable7) == 0x000050, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable7' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue7) == 0x000054, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Array_Index_Variable8) == 0x000058, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Array_Index_Variable8' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_MID2) == 0x00005C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_MID2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_Parameter2) == 0x000060, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_Parameter2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_Parameter_Collection2) == 0x000068, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_Parameter_Collection2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_MID) == 0x00006C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_MID' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_Parameter) == 0x000070, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_Parameter' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_Parameter_Collection) == 0x000078, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_Parameter_Collection' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_MID_Array) == 0x00007C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_MID_Array' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_SquashIntensity) == 0x000080, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_SquashIntensity' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000084, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000090, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_VectorVector_ReturnValue2) == 0x0000A8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000B4, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x0000B8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, Temp_int_Loop_Counter_Variable8) == 0x0000BC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::Temp_int_Loop_Counter_Variable8' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Add_IntInt_ReturnValue8) == 0x0000C0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_GetContext_ReturnValue) == 0x0000C4, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000F8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x0000FC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x000100, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue4) == 0x000104, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue5) == 0x000108, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SpawnSoundAttached_ReturnValue6) == 0x00010C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SpawnSoundAttached_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000114, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x000194, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_MakeRotator_ReturnValue) == 0x000214, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult3) == 0x000220, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate4) == 0x0002A0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate5) == 0x0002B0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate6) == 0x0002C0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate7) == 0x0002D0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult4) == 0x0002E0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult4' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult5) == 0x000360, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult5' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult6) == 0x0003E0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult6' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult7) == 0x000460, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult7' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_GetComponentBounds_Origin) == 0x0004E0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_GetComponentBounds_BoxExtent) == 0x0004EC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_GetComponentBounds_SphereRadius) == 0x0004F8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_SetStaticMesh_ReturnValue) == 0x0004FC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CreateDelegate_OutputDelegate8) == 0x000500, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, K2Node_CustomEvent_Time) == 0x000510, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000514, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetTimer_ReturnValue) == 0x000594, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Lerp_ReturnValue) == 0x000598, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x00059C, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0005A8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0005B4, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0005C0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0005CC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_BreakVector_X) == 0x0005D8, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_BreakVector_Y) == 0x0005DC, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_BreakVector_Z) == 0x0005E0, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0005E4, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_MakeVector_ReturnValue) == 0x000664, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master, CallFunc_K2_SetWorldRotation_SweepHitResult8) == 0x000670, "Member 'MyTown_Building_Master_C_ExecuteUbergraph_MyTown_Building_Master::CallFunc_K2_SetWorldRotation_SweepHitResult8' has a wrong offset!");
