#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestPlayerContext

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass NearestPlayerContext.NearestPlayerContext_C
// 0x0034 (0x0054 - 0x0020)
class UNearestPlayerContext_C final : public UEnvQueryContext_BlueprintBase
{
public:
	struct FVector                                QuerierLocation;                                   // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                GoalActorLocation;                                 // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DistanceBetweenQuerierAndGoal;                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FinalHuntingRadiusToUse;                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                FinalHuntingRadiusLocationToUse;                   // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            Querier;                                           // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ProvideSingleLocation(class UObject* QuerierObject, class AActor* QuerierActor, struct FVector* ResultingLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NearestPlayerContext_C">();
	}
	static class UNearestPlayerContext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestPlayerContext_C>();
	}
};
static_assert(alignof(UNearestPlayerContext_C) == 0x000004, "Wrong alignment on UNearestPlayerContext_C");
static_assert(sizeof(UNearestPlayerContext_C) == 0x000054, "Wrong size on UNearestPlayerContext_C");
static_assert(offsetof(UNearestPlayerContext_C, QuerierLocation) == 0x000020, "Member 'UNearestPlayerContext_C::QuerierLocation' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, GoalActorLocation) == 0x00002C, "Member 'UNearestPlayerContext_C::GoalActorLocation' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, DistanceBetweenQuerierAndGoal) == 0x000038, "Member 'UNearestPlayerContext_C::DistanceBetweenQuerierAndGoal' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, FinalHuntingRadiusToUse) == 0x00003C, "Member 'UNearestPlayerContext_C::FinalHuntingRadiusToUse' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, FinalHuntingRadiusLocationToUse) == 0x000040, "Member 'UNearestPlayerContext_C::FinalHuntingRadiusLocationToUse' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, Querier) == 0x00004C, "Member 'UNearestPlayerContext_C::Querier' has a wrong offset!");
static_assert(offsetof(UNearestPlayerContext_C, Debug) == 0x000050, "Member 'UNearestPlayerContext_C::Debug' has a wrong offset!");

}

#pragma pack(pop)
