#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsEntry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass NewsEntry.NewsEntry_C
// 0x0020 (0x0264 - 0x0244)
class UNewsEntry_C final : public UFortUserWidget
{
public:
	class UTextBlock*                             Content_Text;                                      // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             Header_Text;                                       // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   HeaderText;                                        // 0x024C(0x000C)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BodyText;                                          // 0x0258(0x000C)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	class FText Get_Content_Text();
	class FText Get_Header_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewsEntry_C">();
	}
	static class UNewsEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewsEntry_C>();
	}
};
static_assert(alignof(UNewsEntry_C) == 0x000004, "Wrong alignment on UNewsEntry_C");
static_assert(sizeof(UNewsEntry_C) == 0x000264, "Wrong size on UNewsEntry_C");
static_assert(offsetof(UNewsEntry_C, Content_Text) == 0x000244, "Member 'UNewsEntry_C::Content_Text' has a wrong offset!");
static_assert(offsetof(UNewsEntry_C, Header_Text) == 0x000248, "Member 'UNewsEntry_C::Header_Text' has a wrong offset!");
static_assert(offsetof(UNewsEntry_C, HeaderText) == 0x00024C, "Member 'UNewsEntry_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UNewsEntry_C, BodyText) == 0x000258, "Member 'UNewsEntry_C::BodyText' has a wrong offset!");

}

#pragma pack(pop)
