#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsScreenWidget

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function NewsScreenWidget.NewsScreenWidget_C.ExecuteUbergraph_NewsScreenWidget
// 0x000C (0x000C - 0x0000)
struct NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button2;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget) == 0x000004, "Wrong alignment on NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget");
static_assert(sizeof(NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget) == 0x00000C, "Wrong size on NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget");
static_assert(offsetof(NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget, EntryPoint) == 0x000000, "Member 'NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget, K2Node_ComponentBoundEvent_Button2) == 0x000004, "Member 'NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'NewsScreenWidget_C_ExecuteUbergraph_NewsScreenWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function NewsScreenWidget.NewsScreenWidget_C.BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'NewsScreenWidget_C_BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_580_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function NewsScreenWidget.NewsScreenWidget_C.BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'NewsScreenWidget_C_BndEvt__NewsCloseButton_K2Node_ComponentBoundEvent_44_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

#pragma pack(pop)
