#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsEntry

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function NewsEntry.NewsEntry_C.Get_Content_Text
// 0x000C (0x000C - 0x0000)
struct NewsEntry_C_Get_Content_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(NewsEntry_C_Get_Content_Text) == 0x000004, "Wrong alignment on NewsEntry_C_Get_Content_Text");
static_assert(sizeof(NewsEntry_C_Get_Content_Text) == 0x00000C, "Wrong size on NewsEntry_C_Get_Content_Text");
static_assert(offsetof(NewsEntry_C_Get_Content_Text, ReturnValue) == 0x000000, "Member 'NewsEntry_C_Get_Content_Text::ReturnValue' has a wrong offset!");

// Function NewsEntry.NewsEntry_C.Get_Header_Text
// 0x000C (0x000C - 0x0000)
struct NewsEntry_C_Get_Header_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(NewsEntry_C_Get_Header_Text) == 0x000004, "Wrong alignment on NewsEntry_C_Get_Header_Text");
static_assert(sizeof(NewsEntry_C_Get_Header_Text) == 0x00000C, "Wrong size on NewsEntry_C_Get_Header_Text");
static_assert(offsetof(NewsEntry_C_Get_Header_Text, ReturnValue) == 0x000000, "Member 'NewsEntry_C_Get_Header_Text::ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
