#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Outpost_CanEditPanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.ExecuteUbergraph_Outpost_CanEditPanel
// 0x0220 (0x0220 - 0x0000)
struct Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_NewTeamMemberInfo;              // 0x0024(0x01E8)()
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel");
static_assert(sizeof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel) == 0x000220, "Wrong size on Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, EntryPoint) == 0x000000, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_ComponentBoundEvent_Button) == 0x000014, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_ComponentBoundEvent_Selected) == 0x000018, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, CallFunc_GetContext_ReturnValue) == 0x00001C, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000020, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_CustomEvent_NewTeamMemberInfo) == 0x000024, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_CustomEvent_NewTeamMemberInfo' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_CustomEvent_PlayerIndex) == 0x00020C, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel, K2Node_CreateDelegate_OutputDelegate2) == 0x000210, "Member 'Outpost_CanEditPanel_C_ExecuteUbergraph_Outpost_CanEditPanel::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.HandleRemoved
// 0x0004 (0x0004 - 0x0000)
struct Outpost_CanEditPanel_C_HandleRemoved final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditPanel_C_HandleRemoved) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_HandleRemoved");
static_assert(sizeof(Outpost_CanEditPanel_C_HandleRemoved) == 0x000004, "Wrong size on Outpost_CanEditPanel_C_HandleRemoved");
static_assert(offsetof(Outpost_CanEditPanel_C_HandleRemoved, PlayerIndex) == 0x000000, "Member 'Outpost_CanEditPanel_C_HandleRemoved::PlayerIndex' has a wrong offset!");

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.HandleJoined
// 0x01E8 (0x01E8 - 0x0000)
struct Outpost_CanEditPanel_C_HandleJoined final
{
public:
	struct FFortTeamMemberInfo                    NewTeamMemberInfo;                                 // 0x0000(0x01E8)(Parm)
};
static_assert(alignof(Outpost_CanEditPanel_C_HandleJoined) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_HandleJoined");
static_assert(sizeof(Outpost_CanEditPanel_C_HandleJoined) == 0x0001E8, "Wrong size on Outpost_CanEditPanel_C_HandleJoined");
static_assert(offsetof(Outpost_CanEditPanel_C_HandleJoined, NewTeamMemberInfo) == 0x000000, "Member 'Outpost_CanEditPanel_C_HandleJoined::NewTeamMemberInfo' has a wrong offset!");

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'Outpost_CanEditPanel_C_BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.Init
// 0x005C (0x005C - 0x0000)
struct Outpost_CanEditPanel_C_Init final
{
public:
	class AFortPlayerControllerOutpost*           InOutpostOwner;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerStateOutpost*                K2Node_DynamicCast_AsFort_Player_State_Outpost;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOutpost_CanEditRow_C*                  CallFunc_Create_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWrapBoxSlot*                           CallFunc_AddChildWrapBox_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns; // 0x0038(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateOutpost*                K2Node_DynamicCast_AsFort_Player_State_Outpost2;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditPanel_C_Init) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_Init");
static_assert(sizeof(Outpost_CanEditPanel_C_Init) == 0x00005C, "Wrong size on Outpost_CanEditPanel_C_Init");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, InOutpostOwner) == 0x000000, "Member 'Outpost_CanEditPanel_C_Init::InOutpostOwner' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_IsOutpostOwner_ReturnValue) == 0x000004, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Outpost_CanEditPanel_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, K2Node_DynamicCast_AsFort_Player_State_Outpost) == 0x00000C, "Member 'Outpost_CanEditPanel_C_Init::K2Node_DynamicCast_AsFort_Player_State_Outpost' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Outpost_CanEditPanel_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Outpost_CanEditPanel_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_GetOwningPlayer_ReturnValue) == 0x000024, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, Temp_bool_Variable) == 0x000028, "Member 'Outpost_CanEditPanel_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_Create_ReturnValue) == 0x00002C, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_AddChildWrapBox_ReturnValue) == 0x000030, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_AddChildWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, Temp_byte_Variable) == 0x000034, "Member 'Outpost_CanEditPanel_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns) == 0x000038, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_Array_Get_Item) == 0x000044, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, K2Node_DynamicCast_AsFort_Player_State_Outpost2) == 0x000050, "Member 'Outpost_CanEditPanel_C_Init::K2Node_DynamicCast_AsFort_Player_State_Outpost2' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, K2Node_DynamicCast_bSuccess2) == 0x000054, "Member 'Outpost_CanEditPanel_C_Init::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000055, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, Temp_byte_Variable2) == 0x000056, "Member 'Outpost_CanEditPanel_C_Init::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, CallFunc_BooleanAND_ReturnValue2) == 0x000057, "Member 'Outpost_CanEditPanel_C_Init::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_Init, K2Node_Select_Default) == 0x000058, "Member 'Outpost_CanEditPanel_C_Init::K2Node_Select_Default' has a wrong offset!");

// Function Outpost_CanEditPanel.Outpost_CanEditPanel_C.SetMasterSwitch
// 0x003C (0x003C - 0x0000)
struct Outpost_CanEditPanel_C_SetMasterSwitch final
{
public:
	bool                                          bCanEdit;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns; // 0x0014(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateOutpost*                K2Node_DynamicCast_AsFort_Player_State_Outpost;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateOutpost*                LocalPlayerState;                                  // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	bool                                          LocalCanEdit;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditPanel_C_SetMasterSwitch) == 0x000004, "Wrong alignment on Outpost_CanEditPanel_C_SetMasterSwitch");
static_assert(sizeof(Outpost_CanEditPanel_C_SetMasterSwitch) == 0x00003C, "Wrong size on Outpost_CanEditPanel_C_SetMasterSwitch");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, bCanEdit) == 0x000000, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::bCanEdit' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns) == 0x000014, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_Array_Get_Item) == 0x000020, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, K2Node_DynamicCast_AsFort_Player_State_Outpost) == 0x00002C, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::K2Node_DynamicCast_AsFort_Player_State_Outpost' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, LocalPlayerState) == 0x000034, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::LocalPlayerState' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditPanel_C_SetMasterSwitch, LocalCanEdit) == 0x000038, "Member 'Outpost_CanEditPanel_C_SetMasterSwitch::LocalCanEdit' has a wrong offset!");

}

#pragma pack(pop)
