#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Outpost_CanEditRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass Outpost_CanEditRow.Outpost_CanEditRow_C
// 0x0010 (0x0254 - 0x0244)
class UOutpost_CanEditRow_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonIconText_C*                      CanEditButton;                                     // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class AFortPlayerStateOutpost*                Player;                                            // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortPlayerStateOutpost*                OutpostOwner;                                      // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Outpost_CanEditRow(int32 EntryPoint);
	void BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void Init(class AFortPlayerStateOutpost* InPlayer, class AFortPlayerStateOutpost* InOutpostOwner);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Outpost_CanEditRow_C">();
	}
	static class UOutpost_CanEditRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpost_CanEditRow_C>();
	}
};
static_assert(alignof(UOutpost_CanEditRow_C) == 0x000004, "Wrong alignment on UOutpost_CanEditRow_C");
static_assert(sizeof(UOutpost_CanEditRow_C) == 0x000254, "Wrong size on UOutpost_CanEditRow_C");
static_assert(offsetof(UOutpost_CanEditRow_C, UberGraphFrame) == 0x000244, "Member 'UOutpost_CanEditRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditRow_C, CanEditButton) == 0x000248, "Member 'UOutpost_CanEditRow_C::CanEditButton' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditRow_C, Player) == 0x00024C, "Member 'UOutpost_CanEditRow_C::Player' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditRow_C, OutpostOwner) == 0x000250, "Member 'UOutpost_CanEditRow_C::OutpostOwner' has a wrong offset!");

}

#pragma pack(pop)
