#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Outpost_CanEditRow

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Outpost_CanEditRow.Outpost_CanEditRow_C.ExecuteUbergraph_Outpost_CanEditRow
// 0x000C (0x000C - 0x0000)
struct Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow) == 0x000004, "Wrong alignment on Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow");
static_assert(sizeof(Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow) == 0x00000C, "Wrong size on Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow");
static_assert(offsetof(Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow, EntryPoint) == 0x000000, "Member 'Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow, K2Node_ComponentBoundEvent_Button) == 0x000004, "Member 'Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow, K2Node_ComponentBoundEvent_Selected) == 0x000008, "Member 'Outpost_CanEditRow_C_ExecuteUbergraph_Outpost_CanEditRow::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");

// Function Outpost_CanEditRow.Outpost_CanEditRow_C.BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'Outpost_CanEditRow_C_BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function Outpost_CanEditRow.Outpost_CanEditRow_C.Init
// 0x0018 (0x0018 - 0x0000)
struct Outpost_CanEditRow_C_Init final
{
public:
	class AFortPlayerStateOutpost*                InPlayer;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerStateOutpost*                InOutpostOwner;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanEditOutpost_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x000C(0x000C)()
};
static_assert(alignof(Outpost_CanEditRow_C_Init) == 0x000004, "Wrong alignment on Outpost_CanEditRow_C_Init");
static_assert(sizeof(Outpost_CanEditRow_C_Init) == 0x000018, "Wrong size on Outpost_CanEditRow_C_Init");
static_assert(offsetof(Outpost_CanEditRow_C_Init, InPlayer) == 0x000000, "Member 'Outpost_CanEditRow_C_Init::InPlayer' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_Init, InOutpostOwner) == 0x000004, "Member 'Outpost_CanEditRow_C_Init::InOutpostOwner' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_Init, CallFunc_CanEditOutpost_ReturnValue) == 0x000008, "Member 'Outpost_CanEditRow_C_Init::CallFunc_CanEditOutpost_ReturnValue' has a wrong offset!");
static_assert(offsetof(Outpost_CanEditRow_C_Init, CallFunc_Conv_StringToText_ReturnValue) == 0x00000C, "Member 'Outpost_CanEditRow_C_Init::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
