#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Outpost_CanEditPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass Outpost_CanEditPanel.Outpost_CanEditPanel_C
// 0x0024 (0x0268 - 0x0244)
class UOutpost_CanEditPanel_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonIconText_C*                      ButtonIconText_C_58;                               // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ButtonIconText_C_5943;                             // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ButtonIconText_C_5944;                             // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ButtonIconText_C_5945;                             // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      MasterSwitchButton;                                // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             NoTeammates_TextBlock;                             // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWrapBox*                               playerlistWrapBox;                                 // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class AFortPlayerStateOutpost*                OutpostOwner;                                      // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Outpost_CanEditPanel(int32 EntryPoint);
	void HandleRemoved(int32 PlayerIndex);
	void HandleJoined(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void Init(class AFortPlayerControllerOutpost* InOutpostOwner);
	void SetMasterSwitch(bool bCanEdit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Outpost_CanEditPanel_C">();
	}
	static class UOutpost_CanEditPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpost_CanEditPanel_C>();
	}
};
static_assert(alignof(UOutpost_CanEditPanel_C) == 0x000004, "Wrong alignment on UOutpost_CanEditPanel_C");
static_assert(sizeof(UOutpost_CanEditPanel_C) == 0x000268, "Wrong size on UOutpost_CanEditPanel_C");
static_assert(offsetof(UOutpost_CanEditPanel_C, UberGraphFrame) == 0x000244, "Member 'UOutpost_CanEditPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, ButtonIconText_C_58) == 0x000248, "Member 'UOutpost_CanEditPanel_C::ButtonIconText_C_58' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, ButtonIconText_C_5943) == 0x00024C, "Member 'UOutpost_CanEditPanel_C::ButtonIconText_C_5943' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, ButtonIconText_C_5944) == 0x000250, "Member 'UOutpost_CanEditPanel_C::ButtonIconText_C_5944' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, ButtonIconText_C_5945) == 0x000254, "Member 'UOutpost_CanEditPanel_C::ButtonIconText_C_5945' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, MasterSwitchButton) == 0x000258, "Member 'UOutpost_CanEditPanel_C::MasterSwitchButton' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, NoTeammates_TextBlock) == 0x00025C, "Member 'UOutpost_CanEditPanel_C::NoTeammates_TextBlock' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, playerlistWrapBox) == 0x000260, "Member 'UOutpost_CanEditPanel_C::playerlistWrapBox' has a wrong offset!");
static_assert(offsetof(UOutpost_CanEditPanel_C, OutpostOwner) == 0x000264, "Member 'UOutpost_CanEditPanel_C::OutpostOwner' has a wrong offset!");

}

#pragma pack(pop)
