#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyCharacterPlacementHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C
// 0x0028 (0x0268 - 0x0240)
class APartyCharacterPlacementHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       HeroBasicInfo;                                     // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UWidgetComponent*                       GadgetSelector;                                    // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	int32                                         PlayerID;                                          // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PreviewMesh;                                       // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGadgetDisplayBar_C*                    HeroBasicInfoWidget;                               // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGadgetSelectBar_C*                     GadgetSelectorWidget;                              // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PartyCharacterPlacementHelper(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitHeroBasicInfoWidget();
	void HandleFrontEndCameraChanged(EFrontEndCamera InNewCamera, EFrontEndCamera InOldCamera);
	void InitWidgetComponents();
	void InitGadgetSelectorWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyCharacterPlacementHelper_C">();
	}
	static class APartyCharacterPlacementHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APartyCharacterPlacementHelper_C>();
	}
};
static_assert(alignof(APartyCharacterPlacementHelper_C) == 0x000004, "Wrong alignment on APartyCharacterPlacementHelper_C");
static_assert(sizeof(APartyCharacterPlacementHelper_C) == 0x000268, "Wrong size on APartyCharacterPlacementHelper_C");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UberGraphFrame) == 0x000240, "Member 'APartyCharacterPlacementHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, HeroBasicInfo) == 0x000244, "Member 'APartyCharacterPlacementHelper_C::HeroBasicInfo' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, GadgetSelector) == 0x000248, "Member 'APartyCharacterPlacementHelper_C::GadgetSelector' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, CharacterPlacement) == 0x00024C, "Member 'APartyCharacterPlacementHelper_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Root) == 0x000250, "Member 'APartyCharacterPlacementHelper_C::Root' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PlayerID) == 0x000254, "Member 'APartyCharacterPlacementHelper_C::PlayerID' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PreviewMesh) == 0x000258, "Member 'APartyCharacterPlacementHelper_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Mesh) == 0x00025C, "Member 'APartyCharacterPlacementHelper_C::Mesh' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, HeroBasicInfoWidget) == 0x000260, "Member 'APartyCharacterPlacementHelper_C::HeroBasicInfoWidget' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, GadgetSelectorWidget) == 0x000264, "Member 'APartyCharacterPlacementHelper_C::GadgetSelectorWidget' has a wrong offset!");

}

#pragma pack(pop)
