#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Party

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class Party.PartyGameState
// 0x0214 (0x0230 - 0x001C)
class UPartyGameState : public UObject
{
public:
	class UScriptStruct*                          PartyStateRefDef;                                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x4];                                       // 0x0020(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       OwningUserId;                                      // 0x0024(0x0008)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x88];                                      // 0x002C(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDebugAcceptingMembers;                            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B5[0xC];                                       // 0x00B5(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bStayWithPartyOnDisconnect;                        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPartyMemberState>          PartyMemberStateClass;                             // 0x00C4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0xC0];                                      // 0x00C8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APartyBeaconClient>         ReservationBeaconClientClass;                      // 0x0188(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APartyBeaconClient*                     ReservationBeaconClient;                           // 0x018C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0xA0];                                     // 0x0190(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyGameState">();
	}
	static class UPartyGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyGameState>();
	}
};
static_assert(alignof(UPartyGameState) == 0x000004, "Wrong alignment on UPartyGameState");
static_assert(sizeof(UPartyGameState) == 0x000230, "Wrong size on UPartyGameState");
static_assert(offsetof(UPartyGameState, PartyStateRefDef) == 0x00001C, "Member 'UPartyGameState::PartyStateRefDef' has a wrong offset!");
static_assert(offsetof(UPartyGameState, OwningUserId) == 0x000024, "Member 'UPartyGameState::OwningUserId' has a wrong offset!");
static_assert(offsetof(UPartyGameState, bDebugAcceptingMembers) == 0x0000B4, "Member 'UPartyGameState::bDebugAcceptingMembers' has a wrong offset!");
static_assert(offsetof(UPartyGameState, bStayWithPartyOnDisconnect) == 0x0000C1, "Member 'UPartyGameState::bStayWithPartyOnDisconnect' has a wrong offset!");
static_assert(offsetof(UPartyGameState, PartyMemberStateClass) == 0x0000C4, "Member 'UPartyGameState::PartyMemberStateClass' has a wrong offset!");
static_assert(offsetof(UPartyGameState, ReservationBeaconClientClass) == 0x000188, "Member 'UPartyGameState::ReservationBeaconClientClass' has a wrong offset!");
static_assert(offsetof(UPartyGameState, ReservationBeaconClient) == 0x00018C, "Member 'UPartyGameState::ReservationBeaconClient' has a wrong offset!");

// Class Party.Party
// 0x01B8 (0x01D4 - 0x001C)
class UParty : public UObject
{
public:
	uint8                                         Pad_1C[0x44];                                      // 0x001C(0x0044)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultMaxPartySize;                               // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLeavingPersistentParty;                           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_65[0x16F];                                     // 0x0065(0x016F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Party">();
	}
	static class UParty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParty>();
	}
};
static_assert(alignof(UParty) == 0x000004, "Wrong alignment on UParty");
static_assert(sizeof(UParty) == 0x0001D4, "Wrong size on UParty");
static_assert(offsetof(UParty, DefaultMaxPartySize) == 0x000060, "Member 'UParty::DefaultMaxPartySize' has a wrong offset!");
static_assert(offsetof(UParty, bLeavingPersistentParty) == 0x000064, "Member 'UParty::bLeavingPersistentParty' has a wrong offset!");

// Class Party.PartyMemberState
// 0x0024 (0x0040 - 0x001C)
class UPartyMemberState : public UObject
{
public:
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x001C(0x0008)(Transient, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class UScriptStruct*                          MemberStateRefDef;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x8];                                       // 0x0034(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasAnnouncedJoin;                                 // 0x003C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyMemberState">();
	}
	static class UPartyMemberState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyMemberState>();
	}
};
static_assert(alignof(UPartyMemberState) == 0x000004, "Wrong alignment on UPartyMemberState");
static_assert(sizeof(UPartyMemberState) == 0x000040, "Wrong size on UPartyMemberState");
static_assert(offsetof(UPartyMemberState, UniqueId) == 0x00001C, "Member 'UPartyMemberState::UniqueId' has a wrong offset!");
static_assert(offsetof(UPartyMemberState, DisplayName) == 0x000024, "Member 'UPartyMemberState::DisplayName' has a wrong offset!");
static_assert(offsetof(UPartyMemberState, MemberStateRefDef) == 0x000030, "Member 'UPartyMemberState::MemberStateRefDef' has a wrong offset!");
static_assert(offsetof(UPartyMemberState, bHasAnnouncedJoin) == 0x00003C, "Member 'UPartyMemberState::bHasAnnouncedJoin' has a wrong offset!");

}

#pragma pack(pop)
