#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Placement_Outlander_SpecialFragment_Llama

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Placement_Outlander_SpecialFragment_Llama.Placement_Outlander_SpecialFragment_Llama_C.ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama
// 0x0004 (0x0004 - 0x0000)
struct Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama) == 0x000004, "Wrong alignment on Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama");
static_assert(sizeof(Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama) == 0x000004, "Wrong size on Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama, EntryPoint) == 0x000000, "Member 'Placement_Outlander_SpecialFragment_Llama_C_ExecuteUbergraph_Placement_Outlander_SpecialFragment_Llama::EntryPoint' has a wrong offset!");

// Function Placement_Outlander_SpecialFragment_Llama.Placement_Outlander_SpecialFragment_Llama_C.IsAcceptablePositionForPlacement
// 0x0040 (0x0040 - 0x0000)
struct Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FRotator                               InRotation;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class AFortDecoTool*                          DecoTool;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsCDO;                                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutFailureReason;                                  // 0x0020(0x000C)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IsAcceptablePositionForPlacement_OutFailureReason; // 0x0030(0x000C)()
	bool                                          CallFunc_IsAcceptablePositionForPlacement_ReturnValue; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement) == 0x000004, "Wrong alignment on Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement");
static_assert(sizeof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement) == 0x000040, "Wrong size on Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, InLocation) == 0x000000, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::InLocation' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, InRotation) == 0x00000C, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::InRotation' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, DecoTool) == 0x000018, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::DecoTool' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, bIsCDO) == 0x00001C, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::bIsCDO' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, OutFailureReason) == 0x000020, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::OutFailureReason' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, ReturnValue) == 0x00002C, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::ReturnValue' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, CallFunc_IsAcceptablePositionForPlacement_OutFailureReason) == 0x000030, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::CallFunc_IsAcceptablePositionForPlacement_OutFailureReason' has a wrong offset!");
static_assert(offsetof(Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement, CallFunc_IsAcceptablePositionForPlacement_ReturnValue) == 0x00003C, "Member 'Placement_Outlander_SpecialFragment_Llama_C_IsAcceptablePositionForPlacement::CallFunc_IsAcceptablePositionForPlacement_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
