#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Commando

#include "Basic.hpp"

#include "PlayerPawn_Generic_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass PlayerPawn_Commando.PlayerPawn_Commando_C
// 0x00B0 (0x0FF0 - 0x0F40)
class APlayerPawn_Commando_C final : public APlayerPawn_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerPawn_Commando_C;              // 0x0F40(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 TargetHead;                                        // 0x0F44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 TargetBody;                                        // 0x0F48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInterface*>             PawnHeadMaterials_0;                               // 0x0F4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             PawnBodyMaterials_0;                               // 0x0F58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        P_IncendiaryRound;                                 // 0x0F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        P_MakeItRain;                                      // 0x0F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_FlakVest;                                       // 0x0F6C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayEventData                     Event_Data;                                        // 0x0F84(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventSpawnEffect;                                  // 0x0FDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ShockwaveRefractionRingHeight;                     // 0x0FE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        P_Shockwave;                                       // 0x0FE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlayerPawn_Commando(int32 EntryPoint);
	void GameplayCue_Abilities_Activation_Commando_Shockwave(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ReceivePossessed(class AController* NewController);
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Applied_Commando_MakeItRain(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Applied_Commando_IncendiaryRounds(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPawn_Commando_C">();
	}
	static class APlayerPawn_Commando_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerPawn_Commando_C>();
	}
};
static_assert(alignof(APlayerPawn_Commando_C) == 0x000010, "Wrong alignment on APlayerPawn_Commando_C");
static_assert(sizeof(APlayerPawn_Commando_C) == 0x000FF0, "Wrong size on APlayerPawn_Commando_C");
static_assert(offsetof(APlayerPawn_Commando_C, UberGraphFrame_PlayerPawn_Commando_C) == 0x000F40, "Member 'APlayerPawn_Commando_C::UberGraphFrame_PlayerPawn_Commando_C' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, TargetHead) == 0x000F44, "Member 'APlayerPawn_Commando_C::TargetHead' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, TargetBody) == 0x000F48, "Member 'APlayerPawn_Commando_C::TargetBody' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, PawnHeadMaterials_0) == 0x000F4C, "Member 'APlayerPawn_Commando_C::PawnHeadMaterials_0' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, PawnBodyMaterials_0) == 0x000F58, "Member 'APlayerPawn_Commando_C::PawnBodyMaterials_0' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, P_IncendiaryRound) == 0x000F64, "Member 'APlayerPawn_Commando_C::P_IncendiaryRound' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, P_MakeItRain) == 0x000F68, "Member 'APlayerPawn_Commando_C::P_MakeItRain' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, TC_FlakVest) == 0x000F6C, "Member 'APlayerPawn_Commando_C::TC_FlakVest' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, Event_Data) == 0x000F84, "Member 'APlayerPawn_Commando_C::Event_Data' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, EventSpawnEffect) == 0x000FDC, "Member 'APlayerPawn_Commando_C::EventSpawnEffect' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, ShockwaveRefractionRingHeight) == 0x000FE4, "Member 'APlayerPawn_Commando_C::ShockwaveRefractionRingHeight' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Commando_C, P_Shockwave) == 0x000FE8, "Member 'APlayerPawn_Commando_C::P_Shockwave' has a wrong offset!");

}

#pragma pack(pop)
