#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Generic_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.ExecuteUbergraph_PlayerPawn_Generic_Parent
// 0x0050 (0x0050 - 0x0000)
struct PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0xA];                                        // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent) == 0x000010, "Wrong alignment on PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent");
static_assert(sizeof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent) == 0x000050, "Wrong size on PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, EntryPoint) == 0x000000, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, Temp_struct_Variable) == 0x000010, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
