#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerRequirement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass PowerRequirement.PowerRequirement_C
// 0x0018 (0x01D0 - 0x01B8)
class UPowerRequirement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         PowerRequirementHB;                                // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class URatingWidget_C*                        RatingWidget;                                      // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextBlock;                                         // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	int32                                         RecommendedPower;                                  // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         RequiredPower;                                     // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PowerRequirement(int32 EntryPoint);
	void HandleTeamPowerChanged(int32 TeamPower, int32 PersonalPower);
	void Construct();
	void SetRequirements(int32 RequiredPower_0, int32 RecommendedPower_0);
	void Update(int32 TeamPower);
	void SetUIForRecommended(int32 PartyPower);
	void SetUIForRequired(int32 PartyPower);
	class UWidget* GenerateToolTipWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PowerRequirement_C">();
	}
	static class UPowerRequirement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPowerRequirement_C>();
	}
};
static_assert(alignof(UPowerRequirement_C) == 0x000004, "Wrong alignment on UPowerRequirement_C");
static_assert(sizeof(UPowerRequirement_C) == 0x0001D0, "Wrong size on UPowerRequirement_C");
static_assert(offsetof(UPowerRequirement_C, UberGraphFrame) == 0x0001B8, "Member 'UPowerRequirement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, PowerRequirementHB) == 0x0001BC, "Member 'UPowerRequirement_C::PowerRequirementHB' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RatingWidget) == 0x0001C0, "Member 'UPowerRequirement_C::RatingWidget' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, TextBlock) == 0x0001C4, "Member 'UPowerRequirement_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RecommendedPower) == 0x0001C8, "Member 'UPowerRequirement_C::RecommendedPower' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RequiredPower) == 0x0001CC, "Member 'UPowerRequirement_C::RequiredPower' has a wrong offset!");

}

#pragma pack(pop)
