#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Preview_Outlander_SpecialFragment_Llama

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C
// 0x0044 (0x03A0 - 0x035C)
class APreview_Outlander_SpecialFragment_Llama_C final : public AFortDecoPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x035C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0360(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0364(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_0_NewTrack_0_BF02AA2F47C64B26C854B2989FE34226; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_BF02AA2F47C64B26C854B2989FE34226; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0370(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Line_MID;                                          // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortSpline*                            Fort_Spline;                                       // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UStaticMeshComponent*>           NewVar_0;                                          // 0x037C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        PointArray;                                        // 0x0388(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AFortPlayerPawn*                        Instigating_Pawn;                                  // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 Instigating_Pawn_Mesh_Component;                   // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NewVar_1;                                          // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Preview_Outlander_SpecialFragment_Llama(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Preview_Outlander_SpecialFragment_Llama_C">();
	}
	static class APreview_Outlander_SpecialFragment_Llama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreview_Outlander_SpecialFragment_Llama_C>();
	}
};
static_assert(alignof(APreview_Outlander_SpecialFragment_Llama_C) == 0x000004, "Wrong alignment on APreview_Outlander_SpecialFragment_Llama_C");
static_assert(sizeof(APreview_Outlander_SpecialFragment_Llama_C) == 0x0003A0, "Wrong size on APreview_Outlander_SpecialFragment_Llama_C");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, UberGraphFrame) == 0x00035C, "Member 'APreview_Outlander_SpecialFragment_Llama_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, StaticMesh) == 0x000360, "Member 'APreview_Outlander_SpecialFragment_Llama_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, DefaultSceneRoot) == 0x000364, "Member 'APreview_Outlander_SpecialFragment_Llama_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Timeline_0_NewTrack_0_BF02AA2F47C64B26C854B2989FE34226) == 0x000368, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Timeline_0_NewTrack_0_BF02AA2F47C64B26C854B2989FE34226' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Timeline_0__Direction_BF02AA2F47C64B26C854B2989FE34226) == 0x00036C, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Timeline_0__Direction_BF02AA2F47C64B26C854B2989FE34226' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Timeline_0) == 0x000370, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Line_MID) == 0x000374, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Line_MID' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Fort_Spline) == 0x000378, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Fort_Spline' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, NewVar_0) == 0x00037C, "Member 'APreview_Outlander_SpecialFragment_Llama_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, PointArray) == 0x000388, "Member 'APreview_Outlander_SpecialFragment_Llama_C::PointArray' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Instigating_Pawn) == 0x000394, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Instigating_Pawn' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, Instigating_Pawn_Mesh_Component) == 0x000398, "Member 'APreview_Outlander_SpecialFragment_Llama_C::Instigating_Pawn_Mesh_Component' has a wrong offset!");
static_assert(offsetof(APreview_Outlander_SpecialFragment_Llama_C, NewVar_1) == 0x00039C, "Member 'APreview_Outlander_SpecialFragment_Llama_C::NewVar_1' has a wrong offset!");

}

#pragma pack(pop)
