#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskRanged

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function ProjectileHuskRanged.ProjectileHuskRanged_C.ExecuteUbergraph_ProjectileHuskRanged
// 0x016C (0x016C - 0x0000)
struct ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x004C(0x0080)(ConstParm, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00EC(0x0004)()
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x014C(0x0004)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0154(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0160(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged) == 0x000004, "Wrong alignment on ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged");
static_assert(sizeof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged) == 0x00016C, "Wrong size on ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, EntryPoint) == 0x000000, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_MyComp) == 0x000018, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_Other) == 0x00001C, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_OtherComp) == 0x000020, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_bSelfMoved) == 0x000024, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_HitLocation) == 0x000028, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_HitNormal) == 0x000034, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_NormalImpulse) == 0x000040, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_Hit) == 0x00004C, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_MakeRotFromX_ReturnValue) == 0x0000CC, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetInstigator_ReturnValue) == 0x0000D8, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000DC, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetBlackboard_ReturnValue) == 0x0000E0, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_MakeLiteralName_ReturnValue) == 0x0000E4, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_K2_SetTimer_ReturnValue) == 0x0000EC, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetValueAsObject_ReturnValue) == 0x0000F0, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_AsActor) == 0x0000F4, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000FC, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetVelocity_ReturnValue) == 0x000108, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000114, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetInstigatorController_ReturnValue) == 0x000120, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000124, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_AsFort_AIController) == 0x000130, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_bSuccess2) == 0x000134, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_Dot_VectorVector_ReturnValue) == 0x000138, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetGoalActor_ReturnValue) == 0x00013C, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_Less_FloatFloat_ReturnValue) == 0x000140, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_AsFort_Pawn) == 0x000144, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_DynamicCast_bSuccess3) == 0x000148, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000149, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, CallFunc_K2_SetTimer_ReturnValue2) == 0x00014C, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, Temp_bool_IsClosed_Variable) == 0x000150, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_HitActors) == 0x000154, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged, K2Node_Event_HitResults) == 0x000160, "Member 'ProjectileHuskRanged_C_ExecuteUbergraph_ProjectileHuskRanged::K2Node_Event_HitResults' has a wrong offset!");

// Function ProjectileHuskRanged.ProjectileHuskRanged_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct ProjectileHuskRanged_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ProjectileHuskRanged_C_OnExploded) == 0x000004, "Wrong alignment on ProjectileHuskRanged_C_OnExploded");
static_assert(sizeof(ProjectileHuskRanged_C_OnExploded) == 0x000018, "Wrong size on ProjectileHuskRanged_C_OnExploded");
static_assert(offsetof(ProjectileHuskRanged_C_OnExploded, HitActors) == 0x000000, "Member 'ProjectileHuskRanged_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_OnExploded, HitResults) == 0x00000C, "Member 'ProjectileHuskRanged_C_OnExploded::HitResults' has a wrong offset!");

// Function ProjectileHuskRanged.ProjectileHuskRanged_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct ProjectileHuskRanged_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ProjectileHuskRanged_C_ReceiveHit) == 0x000004, "Wrong alignment on ProjectileHuskRanged_C_ReceiveHit");
static_assert(sizeof(ProjectileHuskRanged_C_ReceiveHit) == 0x0000B4, "Wrong size on ProjectileHuskRanged_C_ReceiveHit");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, MyComp) == 0x000000, "Member 'ProjectileHuskRanged_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, Other) == 0x000004, "Member 'ProjectileHuskRanged_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, OtherComp) == 0x000008, "Member 'ProjectileHuskRanged_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'ProjectileHuskRanged_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, HitLocation) == 0x000010, "Member 'ProjectileHuskRanged_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, HitNormal) == 0x00001C, "Member 'ProjectileHuskRanged_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, NormalImpulse) == 0x000028, "Member 'ProjectileHuskRanged_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ProjectileHuskRanged_C_ReceiveHit, Hit) == 0x000034, "Member 'ProjectileHuskRanged_C_ReceiveHit::Hit' has a wrong offset!");

}

#pragma pack(pop)
