#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskLobber_Poison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C
// 0x00D8 (0x04F0 - 0x0418)
class AProjectileHuskLobber_Poison_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       PoisonArea;                                        // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        LobberProjPoisonLoopingSound;                      // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ProjectileParticleSystem;                          // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        PoisonGasSoundLoop;                                // 0x0428(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               PoisonCloudParticleSystemComponent;                // 0x042C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_0_Fade_2E79945F4D4A804FEBAEF28A5AC06C31;  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_2E79945F4D4A804FEBAEF28A5AC06C31; // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0438(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Trail_Material;                                    // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Effect_Explosion;                                  // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DebugDuration;                                     // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Radius;                                            // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x044C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FHitResult                             ImpactHitResult;                                   // 0x0458(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               TrailGlow;                                         // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           TC_NPCStatusAOEPoison;                             // 0x04DC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_HuskAOE2StandingInPoison;                       // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_HuskAOE3DOTPoison;                              // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_HuskAOE4RemovePoison;                           // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ProjectileHuskLobber_Poison(int32 EntryPoint);
	void BndEvt__PoisonArea_K2Node_ComponentBoundEvent_97_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void EndCloud();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation_0, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void Is_Valid_Damage_Target(class AActor* CollidingActor, bool* Is_Valid_Damage_Target_0, class AFortPawn** Valid_Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProjectileHuskLobber_Poison_C">();
	}
	static class AProjectileHuskLobber_Poison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectileHuskLobber_Poison_C>();
	}
};
static_assert(alignof(AProjectileHuskLobber_Poison_C) == 0x000004, "Wrong alignment on AProjectileHuskLobber_Poison_C");
static_assert(sizeof(AProjectileHuskLobber_Poison_C) == 0x0004F0, "Wrong size on AProjectileHuskLobber_Poison_C");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, UberGraphFrame) == 0x000418, "Member 'AProjectileHuskLobber_Poison_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, PoisonArea) == 0x00041C, "Member 'AProjectileHuskLobber_Poison_C::PoisonArea' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, LobberProjPoisonLoopingSound) == 0x000420, "Member 'AProjectileHuskLobber_Poison_C::LobberProjPoisonLoopingSound' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, ProjectileParticleSystem) == 0x000424, "Member 'AProjectileHuskLobber_Poison_C::ProjectileParticleSystem' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, PoisonGasSoundLoop) == 0x000428, "Member 'AProjectileHuskLobber_Poison_C::PoisonGasSoundLoop' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, PoisonCloudParticleSystemComponent) == 0x00042C, "Member 'AProjectileHuskLobber_Poison_C::PoisonCloudParticleSystemComponent' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Timeline_0_Fade_2E79945F4D4A804FEBAEF28A5AC06C31) == 0x000430, "Member 'AProjectileHuskLobber_Poison_C::Timeline_0_Fade_2E79945F4D4A804FEBAEF28A5AC06C31' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Timeline_0__Direction_2E79945F4D4A804FEBAEF28A5AC06C31) == 0x000434, "Member 'AProjectileHuskLobber_Poison_C::Timeline_0__Direction_2E79945F4D4A804FEBAEF28A5AC06C31' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Timeline_0) == 0x000438, "Member 'AProjectileHuskLobber_Poison_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Trail_Material) == 0x00043C, "Member 'AProjectileHuskLobber_Poison_C::Trail_Material' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Effect_Explosion) == 0x000440, "Member 'AProjectileHuskLobber_Poison_C::Effect_Explosion' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, DebugDuration) == 0x000444, "Member 'AProjectileHuskLobber_Poison_C::DebugDuration' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, Radius) == 0x000448, "Member 'AProjectileHuskLobber_Poison_C::Radius' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, HitLocation) == 0x00044C, "Member 'AProjectileHuskLobber_Poison_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, ImpactHitResult) == 0x000458, "Member 'AProjectileHuskLobber_Poison_C::ImpactHitResult' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, TrailGlow) == 0x0004D8, "Member 'AProjectileHuskLobber_Poison_C::TrailGlow' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, TC_NPCStatusAOEPoison) == 0x0004DC, "Member 'AProjectileHuskLobber_Poison_C::TC_NPCStatusAOEPoison' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, GE_HuskAOE2StandingInPoison) == 0x0004E4, "Member 'AProjectileHuskLobber_Poison_C::GE_HuskAOE2StandingInPoison' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, GE_HuskAOE3DOTPoison) == 0x0004E8, "Member 'AProjectileHuskLobber_Poison_C::GE_HuskAOE3DOTPoison' has a wrong offset!");
static_assert(offsetof(AProjectileHuskLobber_Poison_C, GE_HuskAOE4RemovePoison) == 0x0004EC, "Member 'AProjectileHuskLobber_Poison_C::GE_HuskAOE4RemovePoison' has a wrong offset!");

}

#pragma pack(pop)
