#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskLobber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function ProjectileHuskLobber.ProjectileHuskLobber_C.ExecuteUbergraph_ProjectileHuskLobber
// 0x0138 (0x0138 - 0x0000)
struct ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0060(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber) == 0x000004, "Wrong alignment on ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber");
static_assert(sizeof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber) == 0x000138, "Wrong size on ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, EntryPoint) == 0x000000, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_GetInstigatorController_ReturnValue) == 0x000004, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_DynamicCast_AsFort_AIController) == 0x00000C, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_GetGoalActor_ReturnValue) == 0x000014, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_DynamicCast_AsFort_Pawn) == 0x000018, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_DynamicCast_bSuccess2) == 0x00001C, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_GetTeamAffiliation_ReturnValue) == 0x00001D, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_MyComp) == 0x00002C, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_Other) == 0x000030, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_OtherComp) == 0x000034, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_bSelfMoved) == 0x000038, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_HitLocation) == 0x00003C, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_HitNormal) == 0x000048, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_NormalImpulse) == 0x000054, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, K2Node_Event_Hit) == 0x000060, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_GetVelocity_ReturnValue) == 0x0000EC, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_BreakVector_X) == 0x0000F8, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_BreakVector_Y) == 0x0000FC, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_BreakVector_Z) == 0x000100, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_MakeVector_ReturnValue2) == 0x000104, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_Normal_ReturnValue) == 0x000110, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_Cross_VectorVector_ReturnValue) == 0x00011C, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000128, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000134, "Member 'ProjectileHuskLobber_C_ExecuteUbergraph_ProjectileHuskLobber::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function ProjectileHuskLobber.ProjectileHuskLobber_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct ProjectileHuskLobber_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ProjectileHuskLobber_C_ReceiveHit) == 0x000004, "Wrong alignment on ProjectileHuskLobber_C_ReceiveHit");
static_assert(sizeof(ProjectileHuskLobber_C_ReceiveHit) == 0x0000B4, "Wrong size on ProjectileHuskLobber_C_ReceiveHit");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, MyComp) == 0x000000, "Member 'ProjectileHuskLobber_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, Other) == 0x000004, "Member 'ProjectileHuskLobber_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, OtherComp) == 0x000008, "Member 'ProjectileHuskLobber_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'ProjectileHuskLobber_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, HitLocation) == 0x000010, "Member 'ProjectileHuskLobber_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, HitNormal) == 0x00001C, "Member 'ProjectileHuskLobber_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, NormalImpulse) == 0x000028, "Member 'ProjectileHuskLobber_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_ReceiveHit, Hit) == 0x000034, "Member 'ProjectileHuskLobber_C_ReceiveHit::Hit' has a wrong offset!");

// Function ProjectileHuskLobber.ProjectileHuskLobber_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct ProjectileHuskLobber_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectileHuskLobber_C_UserConstructionScript) == 0x000004, "Wrong alignment on ProjectileHuskLobber_C_UserConstructionScript");
static_assert(sizeof(ProjectileHuskLobber_C_UserConstructionScript) == 0x00000C, "Wrong size on ProjectileHuskLobber_C_UserConstructionScript");
static_assert(offsetof(ProjectileHuskLobber_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'ProjectileHuskLobber_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000004, "Member 'ProjectileHuskLobber_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskLobber_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000008, "Member 'ProjectileHuskLobber_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");

}

#pragma pack(pop)
