#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Explorer_OutlanderFragment_Llama

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C.ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama
// 0x048C (0x048C - 0x0000)
struct Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage4;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags4;                          // 0x0014(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum4;                            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo4;                             // 0x0038(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy4;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser4;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext4;                       // 0x00C0(0x000C)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_CarryOverDamage; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_DamageRemainder; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_ConvertDamageToResources_AmountSpawned;   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConvertDamageToResources_FinishedSpawning; // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ConvertDamageToResources_CarryOverDamage2; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_DamageRemainder2; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_ConvertDamageToResources_AmountSpawned2;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConvertDamageToResources_FinishedSpawning2; // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ConvertDamageToResources_CarryOverDamage3; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_DamageRemainder3; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_ConvertDamageToResources_AmountSpawned3;  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConvertDamageToResources_FinishedSpawning3; // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage3;                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags3;                          // 0x0104(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum3;                            // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo3;                             // 0x0128(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy3;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser3;                        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext3;                       // 0x01B0(0x000C)()
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortIngredientItemDefinition*          CallFunc_RollIngrediants_SpawnItem;                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_CarryOverDamage4; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_ConvertDamageToResources_DamageRemainder4; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_ConvertDamageToResources_AmountSpawned4;  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConvertDamageToResources_FinishedSpawning4; // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage2;                              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x01F8(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x021C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x02A4(0x000C)()
	float                                         K2Node_Event_Damage;                               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x02B4(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x02D8(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0360(0x000C)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortBounceData                        K2Node_Event_Data;                                 // 0x03F4(0x0030)()
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue3;      // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULlamaAnim_BP_C*                        K2Node_DynamicCast_AsLlama_Anim_BP;                // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama) == 0x000004, "Wrong alignment on Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama");
static_assert(sizeof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama) == 0x00048C, "Wrong size on Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, EntryPoint) == 0x000000, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_HasAuthority_ReturnValue2) == 0x00000D, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, Temp_bool_Has_Been_Initd_Variable) == 0x00000E, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00000F, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Damage4) == 0x000010, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Damage4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageTags4) == 0x000014, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageTags4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Momentum4) == 0x00002C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Momentum4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_HitInfo4) == 0x000038, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_HitInfo4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_InstigatedBy4) == 0x0000B8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_InstigatedBy4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageCauser4) == 0x0000BC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageCauser4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_EffectContext4) == 0x0000C0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_EffectContext4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000CC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_CarryOverDamage) == 0x0000D0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_CarryOverDamage' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_DamageRemainder) == 0x0000D4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_DamageRemainder' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_AmountSpawned) == 0x0000D8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_AmountSpawned' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_FinishedSpawning) == 0x0000DC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_FinishedSpawning' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_CarryOverDamage2) == 0x0000E0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_CarryOverDamage2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_DamageRemainder2) == 0x0000E4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_DamageRemainder2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_AmountSpawned2) == 0x0000E8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_AmountSpawned2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_FinishedSpawning2) == 0x0000EC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_FinishedSpawning2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_CarryOverDamage3) == 0x0000F0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_CarryOverDamage3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_DamageRemainder3) == 0x0000F4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_DamageRemainder3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_AmountSpawned3) == 0x0000F8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_AmountSpawned3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_FinishedSpawning3) == 0x0000FC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_FinishedSpawning3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Damage3) == 0x000100, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Damage3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageTags3) == 0x000104, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageTags3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Momentum3) == 0x00011C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Momentum3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_HitInfo3) == 0x000128, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_HitInfo3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_InstigatedBy3) == 0x0001A8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_InstigatedBy3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageCauser3) == 0x0001AC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageCauser3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_EffectContext3) == 0x0001B0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_EffectContext3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001BC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_RollIngrediants_SpawnItem) == 0x0001C4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_RollIngrediants_SpawnItem' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_CarryOverDamage4) == 0x0001C8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_CarryOverDamage4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_DamageRemainder4) == 0x0001CC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_DamageRemainder4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_AmountSpawned4) == 0x0001D0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_AmountSpawned4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_ConvertDamageToResources_FinishedSpawning4) == 0x0001D4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_ConvertDamageToResources_FinishedSpawning4' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BooleanAND_ReturnValue) == 0x0001D5, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x0001D8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001DC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001E8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Damage2) == 0x0001F4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageTags2) == 0x0001F8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Momentum2) == 0x000210, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_HitInfo2) == 0x00021C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_InstigatedBy2) == 0x00029C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageCauser2) == 0x0002A0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_EffectContext2) == 0x0002A4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Damage) == 0x0002B0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageTags) == 0x0002B4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Momentum) == 0x0002CC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_HitInfo) == 0x0002D8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_InstigatedBy) == 0x000358, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_DamageCauser) == 0x00035C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_EffectContext) == 0x000360, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_bBlockingHit) == 0x00036C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_bInitialOverlap) == 0x00036D, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_Time) == 0x000370, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_Location) == 0x000374, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_ImpactPoint) == 0x000380, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_Normal) == 0x00038C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_ImpactNormal) == 0x000398, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_PhysMat) == 0x0003A4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_HitActor) == 0x0003A8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_HitComponent) == 0x0003AC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_HitBoneName) == 0x0003B0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_HitItem) == 0x0003B8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_TraceStart) == 0x0003BC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_BreakHitResult_TraceEnd) == 0x0003C8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_MakeRotFromX_ReturnValue) == 0x0003D4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_GetSocketLocation_ReturnValue) == 0x0003E0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0003EC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x0003F0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_Event_Data) == 0x0003F4, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Array_Get_Item) == 0x000424, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000428, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Array_Length_ReturnValue) == 0x00042C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SelectFloat_ReturnValue) == 0x000430, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000434, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x000438, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SelectFloat_ReturnValue2) == 0x00043C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, Temp_bool_IsClosed_Variable) == 0x000440, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000444, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_GetSocketLocation_ReturnValue2) == 0x000448, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_GetSocketLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnEmitterAtLocation_ReturnValue3) == 0x000454, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnEmitterAtLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x000458, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, Temp_int_Loop_Counter_Variable) == 0x00045C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000460, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Less_IntInt_ReturnValue) == 0x00046C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Add_IntInt_ReturnValue) == 0x000470, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Not_PreBool_ReturnValue) == 0x000474, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_Add_FloatFloat_ReturnValue) == 0x000478, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_IsDedicatedServer_ReturnValue3) == 0x00047C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, CallFunc_GetAnimInstance_ReturnValue) == 0x000480, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_DynamicCast_AsLlama_Anim_BP) == 0x000484, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_DynamicCast_AsLlama_Anim_BP' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama, K2Node_DynamicCast_bSuccess2) == 0x000488, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C.OnBounceAnimationUpdate
// 0x0030 (0x0030 - 0x0000)
struct Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate final
{
public:
	struct FFortBounceData                        Data;                                              // 0x0000(0x0030)(Parm)
};
static_assert(alignof(Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate) == 0x000004, "Wrong alignment on Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate");
static_assert(sizeof(Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate) == 0x000030, "Wrong size on Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate, Data) == 0x000000, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnBounceAnimationUpdate::Data' has a wrong offset!");

// Function Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects");
static_assert(sizeof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects");
static_assert(sizeof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Prop_Explorer_OutlanderFragment_Llama_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct Prop_Explorer_OutlanderFragment_Llama_C_OnDeathServer final
{
public:
