#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseFlow

#include "Basic.hpp"

#include "PurchaseFlow_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function PurchaseFlow.PurchaseFlowJSBridge.Receipt
// 0x0024 (0x0024 - 0x0000)
struct PurchaseFlowJSBridge_Receipt final
{
public:
	struct FPurchaseFlowReceiptParam              Receipt_0;                                         // 0x0000(0x0024)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PurchaseFlowJSBridge_Receipt) == 0x000004, "Wrong alignment on PurchaseFlowJSBridge_Receipt");
static_assert(sizeof(PurchaseFlowJSBridge_Receipt) == 0x000024, "Wrong size on PurchaseFlowJSBridge_Receipt");
static_assert(offsetof(PurchaseFlowJSBridge_Receipt, Receipt_0) == 0x000000, "Member 'PurchaseFlowJSBridge_Receipt::Receipt_0' has a wrong offset!");

// Function PurchaseFlow.PurchaseFlowJSBridge.RequestClose
// 0x000C (0x000C - 0x0000)
struct PurchaseFlowJSBridge_RequestClose final
{
public:
	class FString                                 CloseInfo;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PurchaseFlowJSBridge_RequestClose) == 0x000004, "Wrong alignment on PurchaseFlowJSBridge_RequestClose");
static_assert(sizeof(PurchaseFlowJSBridge_RequestClose) == 0x00000C, "Wrong size on PurchaseFlowJSBridge_RequestClose");
static_assert(offsetof(PurchaseFlowJSBridge_RequestClose, CloseInfo) == 0x000000, "Member 'PurchaseFlowJSBridge_RequestClose::CloseInfo' has a wrong offset!");

}

#pragma pack(pop)
