#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RateExperience

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function RateExperience.RateExperience_C.ExecuteUbergraph_RateExperience
// 0x0060 (0x0060 - 0x0000)
struct RateExperience_C_ExecuteUbergraph_RateExperience final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button2;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_CustomEvent_Button;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UButtonIconText_C*>              K2Node_MakeArray_Array;                            // 0x001C(0x000C)(ZeroConstructor, ReferenceParm)
	class UButtonIconText_C*                      K2Node_DynamicCast_AsButton_Icon_Text;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0044(0x000C)(ConstParm)
	TDelegate<void(class UFortBaseButton* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(RateExperience_C_ExecuteUbergraph_RateExperience) == 0x000004, "Wrong alignment on RateExperience_C_ExecuteUbergraph_RateExperience");
static_assert(sizeof(RateExperience_C_ExecuteUbergraph_RateExperience) == 0x000060, "Wrong size on RateExperience_C_ExecuteUbergraph_RateExperience");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, EntryPoint) == 0x000000, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::EntryPoint' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, Temp_int_Array_Index_Variable) == 0x000008, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_ComponentBoundEvent_Button2) == 0x000010, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_ComponentBoundEvent_Button) == 0x000014, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_CustomEvent_Button) == 0x000018, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_MakeArray_Array) == 0x00001C, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_DynamicCast_AsButton_Icon_Text) == 0x000028, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_DynamicCast_AsButton_Icon_Text' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_DynamicCast_bSuccess) == 0x00002C, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Array_Find_ReturnValue) == 0x000030, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Array_Get_Item) == 0x000034, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Add_IntInt_ReturnValue2) == 0x000038, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_ComponentBoundEvent_Text) == 0x000044, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(RateExperience_C_ExecuteUbergraph_RateExperience, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'RateExperience_C_ExecuteUbergraph_RateExperience::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function RateExperience.RateExperience_C.BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   TEXT;                                              // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature) == 0x00000C, "Wrong size on RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature, TEXT) == 0x000000, "Member 'RateExperience_C_BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature::TEXT' has a wrong offset!");

// Function RateExperience.RateExperience_C.StarButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct RateExperience_C_StarButtonClicked final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_StarButtonClicked) == 0x000004, "Wrong alignment on RateExperience_C_StarButtonClicked");
static_assert(sizeof(RateExperience_C_StarButtonClicked) == 0x000004, "Wrong size on RateExperience_C_StarButtonClicked");
static_assert(offsetof(RateExperience_C_StarButtonClicked, Button) == 0x000000, "Member 'RateExperience_C_StarButtonClicked::Button' has a wrong offset!");

// Function RateExperience.RateExperience_C.BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RateExperience_C_BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RateExperience.RateExperience_C.BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RateExperience_C_BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RateExperience.RateExperience_C.SetStarCount
// 0x0020 (0x0020 - 0x0000)
struct RateExperience_C_SetStarCount final
{
public:
	int32                                         StarCount_0;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UButtonIconText_C*                      CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_SetStarCount) == 0x000004, "Wrong alignment on RateExperience_C_SetStarCount");
static_assert(sizeof(RateExperience_C_SetStarCount) == 0x000020, "Wrong size on RateExperience_C_SetStarCount");
static_assert(offsetof(RateExperience_C_SetStarCount, StarCount_0) == 0x000000, "Member 'RateExperience_C_SetStarCount::StarCount_0' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RateExperience_C_SetStarCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RateExperience_C_SetStarCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'RateExperience_C_SetStarCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'RateExperience_C_SetStarCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, CallFunc_Array_Get_Item) == 0x000014, "Member 'RateExperience_C_SetStarCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'RateExperience_C_SetStarCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SetStarCount, CallFunc_Less_IntInt_ReturnValue2) == 0x00001C, "Member 'RateExperience_C_SetStarCount::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function RateExperience.RateExperience_C.CreateToolTip
// 0x0028 (0x0028 - 0x0000)
struct RateExperience_C_CreateToolTip final
{
public:
	class UWidget*                                StarWidget;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         WidgetIndex;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x000C)()
	class FText                                   CallFunc_Array_Get_Item2;                          // 0x0014(0x000C)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_CreateToolTip) == 0x000004, "Wrong alignment on RateExperience_C_CreateToolTip");
static_assert(sizeof(RateExperience_C_CreateToolTip) == 0x000028, "Wrong size on RateExperience_C_CreateToolTip");
static_assert(offsetof(RateExperience_C_CreateToolTip, StarWidget) == 0x000000, "Member 'RateExperience_C_CreateToolTip::StarWidget' has a wrong offset!");
static_assert(offsetof(RateExperience_C_CreateToolTip, WidgetIndex) == 0x000004, "Member 'RateExperience_C_CreateToolTip::WidgetIndex' has a wrong offset!");
static_assert(offsetof(RateExperience_C_CreateToolTip, CallFunc_Array_Get_Item) == 0x000008, "Member 'RateExperience_C_CreateToolTip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RateExperience_C_CreateToolTip, CallFunc_Array_Get_Item2) == 0x000014, "Member 'RateExperience_C_CreateToolTip::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(RateExperience_C_CreateToolTip, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'RateExperience_C_CreateToolTip::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_CreateToolTip, CallFunc_Create_Basic_Tooltip_Output) == 0x000024, "Member 'RateExperience_C_CreateToolTip::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function RateExperience.RateExperience_C.SendAnalyticsEvent
// 0x0054 (0x0054 - 0x0000)
struct RateExperience_C_SendAnalyticsEvent final
{
public:
	class FString                                 Temp_string_Variable;                              // 0x0000(0x000C)(ZeroConstructor)
	class FString                                 Temp_string_Variable2;                             // 0x000C(0x000C)(ZeroConstructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameSummaryInfo                       CallFunc_GetLastGameSummaryInfo_ReturnValue;       // 0x0020(0x0010)()
	class FString                                 K2Node_Select_Default;                             // 0x0030(0x000C)(ZeroConstructor)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x003C(0x000C)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor)
};
static_assert(alignof(RateExperience_C_SendAnalyticsEvent) == 0x000004, "Wrong alignment on RateExperience_C_SendAnalyticsEvent");
static_assert(sizeof(RateExperience_C_SendAnalyticsEvent) == 0x000054, "Wrong size on RateExperience_C_SendAnalyticsEvent");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, Temp_string_Variable) == 0x000000, "Member 'RateExperience_C_SendAnalyticsEvent::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, Temp_string_Variable2) == 0x00000C, "Member 'RateExperience_C_SendAnalyticsEvent::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'RateExperience_C_SendAnalyticsEvent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, Temp_bool_Variable) == 0x00001C, "Member 'RateExperience_C_SendAnalyticsEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, CallFunc_GetLastGameSummaryInfo_ReturnValue) == 0x000020, "Member 'RateExperience_C_SendAnalyticsEvent::CallFunc_GetLastGameSummaryInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, K2Node_Select_Default) == 0x000030, "Member 'RateExperience_C_SendAnalyticsEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, CallFunc_GetText_ReturnValue) == 0x00003C, "Member 'RateExperience_C_SendAnalyticsEvent::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_SendAnalyticsEvent, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'RateExperience_C_SendAnalyticsEvent::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function RateExperience.RateExperience_C.UpdateVisibility
// 0x0010 (0x0010 - 0x0000)
struct RateExperience_C_UpdateVisibility final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x000C)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_UpdateVisibility) == 0x000004, "Wrong alignment on RateExperience_C_UpdateVisibility");
static_assert(sizeof(RateExperience_C_UpdateVisibility) == 0x000010, "Wrong size on RateExperience_C_UpdateVisibility");
static_assert(offsetof(RateExperience_C_UpdateVisibility, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'RateExperience_C_UpdateVisibility::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_UpdateVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'RateExperience_C_UpdateVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_UpdateVisibility, CallFunc_TextIsEmpty_ReturnValue) == 0x00000D, "Member 'RateExperience_C_UpdateVisibility::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'RateExperience_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RateExperience_C_UpdateVisibility, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'RateExperience_C_UpdateVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function RateExperience.RateExperience_C.OnHandleAction
// 0x00C4 (0x00C4 - 0x0000)
struct RateExperience_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x0060)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0064(0x0060)()
};
static_assert(alignof(RateExperience_C_OnHandleAction) == 0x000004, "Wrong alignment on RateExperience_C_OnHandleAction");
static_assert(sizeof(RateExperience_C_OnHandleAction) == 0x0000C4, "Wrong size on RateExperience_C_OnHandleAction");
static_assert(offsetof(RateExperience_C_OnHandleAction, Result) == 0x000000, "Member 'RateExperience_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(RateExperience_C_OnHandleAction, bPassThrough) == 0x000060, "Member 'RateExperience_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(RateExperience_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x000064, "Member 'RateExperience_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function RateExperience.RateExperience_C.HandleFinished
// 0x0004 (0x0004 - 0x0000)
struct RateExperience_C_HandleFinished final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RateExperience_C_HandleFinished) == 0x000004, "Wrong alignment on RateExperience_C_HandleFinished");
static_assert(sizeof(RateExperience_C_HandleFinished) == 0x000004, "Wrong size on RateExperience_C_HandleFinished");
static_assert(offsetof(RateExperience_C_HandleFinished, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'RateExperience_C_HandleFinished::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
