#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RateExperience

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass RateExperience.RateExperience_C
// 0x0144 (0x03AC - 0x0268)
class URateExperience_C final : public UFortActionHandlerPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonIconText_C*                      OneStar;                                           // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      TwoStar;                                           // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      ThreeStar;                                         // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      FourStar;                                          // 0x0278(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      FiveStar;                                          // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMultiLineEditableTextBox*              CommentField;                                      // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      Decline;                                           // 0x0284(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_4;                                           // 0x0288(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         RewardBox;                                         // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      Submit;                                            // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             Title;                                             // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UButtonIconText_C*>              StarButtons;                                       // 0x0298(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         StarCount;                                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            StarOnBrush;                                       // 0x02A8(0x0074)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            StarOffBrush;                                      // 0x031C(0x0074)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           TooltipHeaders;                                    // 0x0390(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FText>                           TooltipBodys;                                      // 0x039C(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          QuitAfter;                                         // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_RateExperience(int32 EntryPoint);
	void BndEvt__CommentField_K2Node_ComponentBoundEvent_503_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature(const class FText& TEXT);
	void StarButtonClicked(class UFortBaseButton* Button);
	void BndEvt__Decline_K2Node_ComponentBoundEvent_59_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt__Submit_K2Node_ComponentBoundEvent_50_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void Construct();
	void SetStarCount(int32 StarCount_0);
	void CreateToolTip(class UWidget* StarWidget, int32 WidgetIndex);
	void SendAnalyticsEvent();
	void UpdateVisibility();
	void OnHandleAction(struct FEventReply* Result, bool* bPassThrough);
	void HandleFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RateExperience_C">();
	}
	static class URateExperience_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URateExperience_C>();
	}
};
static_assert(alignof(URateExperience_C) == 0x000004, "Wrong alignment on URateExperience_C");
static_assert(sizeof(URateExperience_C) == 0x0003AC, "Wrong size on URateExperience_C");
static_assert(offsetof(URateExperience_C, UberGraphFrame) == 0x000268, "Member 'URateExperience_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URateExperience_C, OneStar) == 0x00026C, "Member 'URateExperience_C::OneStar' has a wrong offset!");
static_assert(offsetof(URateExperience_C, TwoStar) == 0x000270, "Member 'URateExperience_C::TwoStar' has a wrong offset!");
static_assert(offsetof(URateExperience_C, ThreeStar) == 0x000274, "Member 'URateExperience_C::ThreeStar' has a wrong offset!");
static_assert(offsetof(URateExperience_C, FourStar) == 0x000278, "Member 'URateExperience_C::FourStar' has a wrong offset!");
static_assert(offsetof(URateExperience_C, FiveStar) == 0x00027C, "Member 'URateExperience_C::FiveStar' has a wrong offset!");
static_assert(offsetof(URateExperience_C, CommentField) == 0x000280, "Member 'URateExperience_C::CommentField' has a wrong offset!");
static_assert(offsetof(URateExperience_C, Decline) == 0x000284, "Member 'URateExperience_C::Decline' has a wrong offset!");
static_assert(offsetof(URateExperience_C, Image_4) == 0x000288, "Member 'URateExperience_C::Image_4' has a wrong offset!");
static_assert(offsetof(URateExperience_C, RewardBox) == 0x00028C, "Member 'URateExperience_C::RewardBox' has a wrong offset!");
static_assert(offsetof(URateExperience_C, Submit) == 0x000290, "Member 'URateExperience_C::Submit' has a wrong offset!");
static_assert(offsetof(URateExperience_C, Title) == 0x000294, "Member 'URateExperience_C::Title' has a wrong offset!");
static_assert(offsetof(URateExperience_C, StarButtons) == 0x000298, "Member 'URateExperience_C::StarButtons' has a wrong offset!");
static_assert(offsetof(URateExperience_C, StarCount) == 0x0002A4, "Member 'URateExperience_C::StarCount' has a wrong offset!");
static_assert(offsetof(URateExperience_C, StarOnBrush) == 0x0002A8, "Member 'URateExperience_C::StarOnBrush' has a wrong offset!");
static_assert(offsetof(URateExperience_C, StarOffBrush) == 0x00031C, "Member 'URateExperience_C::StarOffBrush' has a wrong offset!");
static_assert(offsetof(URateExperience_C, TooltipHeaders) == 0x000390, "Member 'URateExperience_C::TooltipHeaders' has a wrong offset!");
static_assert(offsetof(URateExperience_C, TooltipBodys) == 0x00039C, "Member 'URateExperience_C::TooltipBodys' has a wrong offset!");
static_assert(offsetof(URateExperience_C, QuitAfter) == 0x0003A8, "Member 'URateExperience_C::QuitAfter' has a wrong offset!");

}

#pragma pack(pop)
