#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "RatingDisplayStyle_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass RatingWidget.RatingWidget_C
// 0x0B08 (0x1244 - 0x073C)
class URatingWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x073C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _Image__RatingIcon;                                // 0x0740(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class USizeBox*                               _SizeBox_;                                         // 0x0744(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__RatingValue;                                // 0x0748(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x074C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	int32                                         RatingValue;                                       // 0x0750(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FFortMultiSizeBrush                    Icon_Sum;                                          // 0x0754(0x02B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    Icon_Team;                                         // 0x0A0C(0x02B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    Icon_Default;                                      // 0x0CC4(0x02B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    Icon;                                              // 0x0F7C(0x02B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	ERatingDisplayStyle                           Display_Style;                                     // 0x1234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_1235[0x3];                                     // 0x1235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortButtonStyle*                       Style_Sum;                                         // 0x1238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortButtonStyle*                       Style_Team;                                        // 0x123C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortButtonStyle*                       Style_Default;                                     // 0x1240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RatingWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Rating_Value(int32 Rating);
	void Set_Icon(const struct FFortMultiSizeBrush& Icon_Brush);
	void Set_Size_Box(class USizeBox* Size_Box);
	void Set_Padding();
	void Set_Display_Style(ERatingDisplayStyle New_Style);
	void Redraw();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RatingWidget_C">();
	}
	static class URatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URatingWidget_C>();
	}
};
static_assert(alignof(URatingWidget_C) == 0x000004, "Wrong alignment on URatingWidget_C");
static_assert(sizeof(URatingWidget_C) == 0x001244, "Wrong size on URatingWidget_C");
static_assert(offsetof(URatingWidget_C, UberGraphFrame) == 0x00073C, "Member 'URatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, _Image__RatingIcon) == 0x000740, "Member 'URatingWidget_C::_Image__RatingIcon' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, _SizeBox_) == 0x000744, "Member 'URatingWidget_C::_SizeBox_' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, _Text__RatingValue) == 0x000748, "Member 'URatingWidget_C::_Text__RatingValue' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, HorizontalBox) == 0x00074C, "Member 'URatingWidget_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, RatingValue) == 0x000750, "Member 'URatingWidget_C::RatingValue' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Icon_Sum) == 0x000754, "Member 'URatingWidget_C::Icon_Sum' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Icon_Team) == 0x000A0C, "Member 'URatingWidget_C::Icon_Team' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Icon_Default) == 0x000CC4, "Member 'URatingWidget_C::Icon_Default' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Icon) == 0x000F7C, "Member 'URatingWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Display_Style) == 0x001234, "Member 'URatingWidget_C::Display_Style' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Style_Sum) == 0x001238, "Member 'URatingWidget_C::Style_Sum' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Style_Team) == 0x00123C, "Member 'URatingWidget_C::Style_Team' has a wrong offset!");
static_assert(offsetof(URatingWidget_C, Style_Default) == 0x001240, "Member 'URatingWidget_C::Style_Default' has a wrong offset!");

}

#pragma pack(pop)
