#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardsListWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass RewardsListWidget.RewardsListWidget_C
// 0x0008 (0x024C - 0x0244)
class URewardsListWidget_C final : public UFortUserWidget
{
public:
	class UHorizontalBox*                         _Horizontal_Box__Container;                        // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	bool                                          bShowDescription;                                  // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                BrushSize;                                         // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void PopulateRewards(TArray<struct FFortQuestReward>& Rewards);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardsListWidget_C">();
	}
	static class URewardsListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardsListWidget_C>();
	}
};
static_assert(alignof(URewardsListWidget_C) == 0x000004, "Wrong alignment on URewardsListWidget_C");
static_assert(sizeof(URewardsListWidget_C) == 0x00024C, "Wrong size on URewardsListWidget_C");
static_assert(offsetof(URewardsListWidget_C, _Horizontal_Box__Container) == 0x000244, "Member 'URewardsListWidget_C::_Horizontal_Box__Container' has a wrong offset!");
static_assert(offsetof(URewardsListWidget_C, bShowDescription) == 0x000248, "Member 'URewardsListWidget_C::bShowDescription' has a wrong offset!");
static_assert(offsetof(URewardsListWidget_C, BrushSize) == 0x000249, "Member 'URewardsListWidget_C::BrushSize' has a wrong offset!");

}

#pragma pack(pop)
