#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoboBear_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass RoboBear_AnimBP.RoboBear_AnimBP_C
// 0x0250 (0x0690 - 0x0440)
class URoboBear_AnimBP_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_94A5640D46AA80EE3A525181A40E89FB; // 0x0444(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8FC73BE849B7182366D0C69D3B182E6A; // 0x0470(0x002C)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_46A72CBF4D105A71E6DE649812CC6D5B; // 0x049C(0x0094)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12; // 0x0530(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9EB9EC34459C844B0FE0BA8E435EFF6F; // 0x05B0(0x002C)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_03791F914454ADFD2E1913880C785340; // 0x05DC(0x002C)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0; // 0x0608(0x0080)()
	float                                         BearYaw;                                           // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         BearPitch;                                         // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RoboBear_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RoboBear_AnimBP_C">();
	}
	static class URoboBear_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoboBear_AnimBP_C>();
	}
};
static_assert(alignof(URoboBear_AnimBP_C) == 0x000010, "Wrong alignment on URoboBear_AnimBP_C");
static_assert(sizeof(URoboBear_AnimBP_C) == 0x000690, "Wrong size on URoboBear_AnimBP_C");
static_assert(offsetof(URoboBear_AnimBP_C, UberGraphFrame) == 0x000440, "Member 'URoboBear_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_Root_94A5640D46AA80EE3A525181A40E89FB) == 0x000444, "Member 'URoboBear_AnimBP_C::AnimGraphNode_Root_94A5640D46AA80EE3A525181A40E89FB' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_StateResult_8FC73BE849B7182366D0C69D3B182E6A) == 0x000470, "Member 'URoboBear_AnimBP_C::AnimGraphNode_StateResult_8FC73BE849B7182366D0C69D3B182E6A' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_StateMachine_46A72CBF4D105A71E6DE649812CC6D5B) == 0x00049C, "Member 'URoboBear_AnimBP_C::AnimGraphNode_StateMachine_46A72CBF4D105A71E6DE649812CC6D5B' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12) == 0x000530, "Member 'URoboBear_AnimBP_C::AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_LocalToComponentSpace_9EB9EC34459C844B0FE0BA8E435EFF6F) == 0x0005B0, "Member 'URoboBear_AnimBP_C::AnimGraphNode_LocalToComponentSpace_9EB9EC34459C844B0FE0BA8E435EFF6F' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_03791F914454ADFD2E1913880C785340) == 0x0005DC, "Member 'URoboBear_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_03791F914454ADFD2E1913880C785340' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0) == 0x000608, "Member 'URoboBear_AnimBP_C::AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, BearYaw) == 0x000688, "Member 'URoboBear_AnimBP_C::BearYaw' has a wrong offset!");
static_assert(offsetof(URoboBear_AnimBP_C, BearPitch) == 0x00068C, "Member 'URoboBear_AnimBP_C::BearPitch' has a wrong offset!");

}

#pragma pack(pop)
