#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_HB_OnboardingCloudCover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C
// 0x0108 (0x0348 - 0x0240)
class AS_HB_OnboardingCloudCover_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        StormSounds;                                       // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               SwirlPS;                                           // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ActivatePhase1;                                    // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ActivatePhase2;                                    // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Lightning_05;                                      // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Lightning_04;                                      // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Lightning_03;                                      // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Lightning_02;                                      // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Lightning_01;                                      // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       HeroBuildingBCollision;                            // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       HeroBuildingACollision;                            // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Phase2_Collision;                                  // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Phase1_Collision;                                  // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   SwirlEdge_Fade_04;                                 // 0x0278(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   EdgeFade_03;                                       // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   EdgeFade_02;                                       // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   EdgeFade_01;                                       // 0x0284(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl06_Phase02;                                   // 0x0288(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl05_TOP_Phase02;                               // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl04_Phase02;                                   // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl03_Phase02;                                   // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl02_Phase02;                                   // 0x0298(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl01_TOP_Phase02;                               // 0x029C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   CloudMajor;                                        // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   SwirldEdge;                                        // 0x02A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl07_Phase01;                                   // 0x02A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl03_Top_Phase01;                               // 0x02AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Swirl01_Top_Phase01;                               // 0x02B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   CloudHero;                                         // 0x02B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Scene1;                                            // 0x02B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_0_AtlasWarmup_732098ED4B33C11B4D86E0A29FB74A5E; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_732098ED4B33C11B4D86E0A29FB74A5E; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase_01_AlphaScale_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase_01_ErodeAlpha_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase_01_ContrastLow_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Control_Clouds_Phase_01__Direction_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Control_Clouds_Phase_01;                           // 0x02D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Control_Clouds_Phase02_ScaleNormal_875904894700C4C178BB4892C88FB0C4; // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_GlobalFade_875904894700C4C178BB4892C88FB0C4; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_AlphaScale_875904894700C4C178BB4892C88FB0C4; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_Erode_Alpha_875904894700C4C178BB4892C88FB0C4; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_Swirl_05_Top_875904894700C4C178BB4892C88FB0C4; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_Swirl_01_Top_875904894700C4C178BB4892C88FB0C4; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Control_Clouds_Phase02_FadeSwirls_875904894700C4C178BB4892C88FB0C4; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Control_Clouds_Phase02__Direction_875904894700C4C178BB4892C88FB0C4; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Control_Clouds_Phase02;                            // 0x0304(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl03_Top_Phase01_MID;                           // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl01_Top_Phase01_MID;                           // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl07_Phase01_MID;                               // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl06_Phase02_MID;                               // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl05__TOP_Phase02_MID;                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl04_Phase02_MID;                               // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl03_Phase02_MID;                               // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl02_Phase02_MID;                               // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Swirl01_TOP_Phase02_MID;                           // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CloudMajor_MID;                                    // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CloudHero_MID;                                     // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               EdgeFade_01_MID;                                   // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               EdgeFade_02_MID;                                   // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               EdgeFade_03_MID;                                   // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               EdgeFade_04_MID;                                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               SwirlEdgeFade_MID;                                 // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_S_HB_OnboardingCloudCover(int32 EntryPoint);
	void BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void HandleClientEvent_OnboardingRevealAllBuildings(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_OnboardingBuildingsStage2(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_OnboardingRevealHeroBuildings(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_OnboardingBuildingsStage1(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Control_Clouds_Phase02__UpdateFunc();
	void Control_Clouds_Phase02__FinishedFunc();
	void Control_Clouds_Phase_01__UpdateFunc();
	void Control_Clouds_Phase_01__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"S_HB_OnboardingCloudCover_C">();
	}
	static class AS_HB_OnboardingCloudCover_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AS_HB_OnboardingCloudCover_C>();
	}
};
static_assert(alignof(AS_HB_OnboardingCloudCover_C) == 0x000004, "Wrong alignment on AS_HB_OnboardingCloudCover_C");
static_assert(sizeof(AS_HB_OnboardingCloudCover_C) == 0x000348, "Wrong size on AS_HB_OnboardingCloudCover_C");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, UberGraphFrame) == 0x000240, "Member 'AS_HB_OnboardingCloudCover_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, StormSounds) == 0x000244, "Member 'AS_HB_OnboardingCloudCover_C::StormSounds' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, SwirlPS) == 0x000248, "Member 'AS_HB_OnboardingCloudCover_C::SwirlPS' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, ActivatePhase1) == 0x00024C, "Member 'AS_HB_OnboardingCloudCover_C::ActivatePhase1' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, ActivatePhase2) == 0x000250, "Member 'AS_HB_OnboardingCloudCover_C::ActivatePhase2' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Lightning_05) == 0x000254, "Member 'AS_HB_OnboardingCloudCover_C::Lightning_05' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Lightning_04) == 0x000258, "Member 'AS_HB_OnboardingCloudCover_C::Lightning_04' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Lightning_03) == 0x00025C, "Member 'AS_HB_OnboardingCloudCover_C::Lightning_03' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Lightning_02) == 0x000260, "Member 'AS_HB_OnboardingCloudCover_C::Lightning_02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Lightning_01) == 0x000264, "Member 'AS_HB_OnboardingCloudCover_C::Lightning_01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, HeroBuildingBCollision) == 0x000268, "Member 'AS_HB_OnboardingCloudCover_C::HeroBuildingBCollision' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, HeroBuildingACollision) == 0x00026C, "Member 'AS_HB_OnboardingCloudCover_C::HeroBuildingACollision' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Phase2_Collision) == 0x000270, "Member 'AS_HB_OnboardingCloudCover_C::Phase2_Collision' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Phase1_Collision) == 0x000274, "Member 'AS_HB_OnboardingCloudCover_C::Phase1_Collision' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, SwirlEdge_Fade_04) == 0x000278, "Member 'AS_HB_OnboardingCloudCover_C::SwirlEdge_Fade_04' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_03) == 0x00027C, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_03' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_02) == 0x000280, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_01) == 0x000284, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl06_Phase02) == 0x000288, "Member 'AS_HB_OnboardingCloudCover_C::Swirl06_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl05_TOP_Phase02) == 0x00028C, "Member 'AS_HB_OnboardingCloudCover_C::Swirl05_TOP_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl04_Phase02) == 0x000290, "Member 'AS_HB_OnboardingCloudCover_C::Swirl04_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl03_Phase02) == 0x000294, "Member 'AS_HB_OnboardingCloudCover_C::Swirl03_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl02_Phase02) == 0x000298, "Member 'AS_HB_OnboardingCloudCover_C::Swirl02_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl01_TOP_Phase02) == 0x00029C, "Member 'AS_HB_OnboardingCloudCover_C::Swirl01_TOP_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, CloudMajor) == 0x0002A0, "Member 'AS_HB_OnboardingCloudCover_C::CloudMajor' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, SwirldEdge) == 0x0002A4, "Member 'AS_HB_OnboardingCloudCover_C::SwirldEdge' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl07_Phase01) == 0x0002A8, "Member 'AS_HB_OnboardingCloudCover_C::Swirl07_Phase01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl03_Top_Phase01) == 0x0002AC, "Member 'AS_HB_OnboardingCloudCover_C::Swirl03_Top_Phase01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl01_Top_Phase01) == 0x0002B0, "Member 'AS_HB_OnboardingCloudCover_C::Swirl01_Top_Phase01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, CloudHero) == 0x0002B4, "Member 'AS_HB_OnboardingCloudCover_C::CloudHero' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Scene1) == 0x0002B8, "Member 'AS_HB_OnboardingCloudCover_C::Scene1' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Timeline_0_AtlasWarmup_732098ED4B33C11B4D86E0A29FB74A5E) == 0x0002BC, "Member 'AS_HB_OnboardingCloudCover_C::Timeline_0_AtlasWarmup_732098ED4B33C11B4D86E0A29FB74A5E' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Timeline_0__Direction_732098ED4B33C11B4D86E0A29FB74A5E) == 0x0002C0, "Member 'AS_HB_OnboardingCloudCover_C::Timeline_0__Direction_732098ED4B33C11B4D86E0A29FB74A5E' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Timeline_0) == 0x0002C4, "Member 'AS_HB_OnboardingCloudCover_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase_01_AlphaScale_C48C72CA42026F0D8C3086BDF4C03DF2) == 0x0002C8, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase_01_AlphaScale_C48C72CA42026F0D8C3086BDF4C03DF2' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase_01_ErodeAlpha_C48C72CA42026F0D8C3086BDF4C03DF2) == 0x0002CC, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase_01_ErodeAlpha_C48C72CA42026F0D8C3086BDF4C03DF2' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase_01_ContrastLow_C48C72CA42026F0D8C3086BDF4C03DF2) == 0x0002D0, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase_01_ContrastLow_C48C72CA42026F0D8C3086BDF4C03DF2' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase_01__Direction_C48C72CA42026F0D8C3086BDF4C03DF2) == 0x0002D4, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase_01__Direction_C48C72CA42026F0D8C3086BDF4C03DF2' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase_01) == 0x0002D8, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase_01' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_ScaleNormal_875904894700C4C178BB4892C88FB0C4) == 0x0002DC, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_ScaleNormal_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_GlobalFade_875904894700C4C178BB4892C88FB0C4) == 0x0002E8, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_GlobalFade_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_AlphaScale_875904894700C4C178BB4892C88FB0C4) == 0x0002EC, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_AlphaScale_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_Erode_Alpha_875904894700C4C178BB4892C88FB0C4) == 0x0002F0, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_Erode_Alpha_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_Swirl_05_Top_875904894700C4C178BB4892C88FB0C4) == 0x0002F4, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_Swirl_05_Top_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_Swirl_01_Top_875904894700C4C178BB4892C88FB0C4) == 0x0002F8, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_Swirl_01_Top_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02_FadeSwirls_875904894700C4C178BB4892C88FB0C4) == 0x0002FC, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02_FadeSwirls_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02__Direction_875904894700C4C178BB4892C88FB0C4) == 0x000300, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02__Direction_875904894700C4C178BB4892C88FB0C4' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Control_Clouds_Phase02) == 0x000304, "Member 'AS_HB_OnboardingCloudCover_C::Control_Clouds_Phase02' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl03_Top_Phase01_MID) == 0x000308, "Member 'AS_HB_OnboardingCloudCover_C::Swirl03_Top_Phase01_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl01_Top_Phase01_MID) == 0x00030C, "Member 'AS_HB_OnboardingCloudCover_C::Swirl01_Top_Phase01_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl07_Phase01_MID) == 0x000310, "Member 'AS_HB_OnboardingCloudCover_C::Swirl07_Phase01_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl06_Phase02_MID) == 0x000314, "Member 'AS_HB_OnboardingCloudCover_C::Swirl06_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl05__TOP_Phase02_MID) == 0x000318, "Member 'AS_HB_OnboardingCloudCover_C::Swirl05__TOP_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl04_Phase02_MID) == 0x00031C, "Member 'AS_HB_OnboardingCloudCover_C::Swirl04_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl03_Phase02_MID) == 0x000320, "Member 'AS_HB_OnboardingCloudCover_C::Swirl03_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl02_Phase02_MID) == 0x000324, "Member 'AS_HB_OnboardingCloudCover_C::Swirl02_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, Swirl01_TOP_Phase02_MID) == 0x000328, "Member 'AS_HB_OnboardingCloudCover_C::Swirl01_TOP_Phase02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, CloudMajor_MID) == 0x00032C, "Member 'AS_HB_OnboardingCloudCover_C::CloudMajor_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, CloudHero_MID) == 0x000330, "Member 'AS_HB_OnboardingCloudCover_C::CloudHero_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_01_MID) == 0x000334, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_01_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_02_MID) == 0x000338, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_02_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_03_MID) == 0x00033C, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_03_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, EdgeFade_04_MID) == 0x000340, "Member 'AS_HB_OnboardingCloudCover_C::EdgeFade_04_MID' has a wrong offset!");
static_assert(offsetof(AS_HB_OnboardingCloudCover_C, SwirlEdgeFade_MID) == 0x000344, "Member 'AS_HB_OnboardingCloudCover_C::SwirlEdgeFade_MID' has a wrong offset!");

}

#pragma pack(pop)
