#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_HB_OnboardingCloudCover

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.ExecuteUbergraph_S_HB_OnboardingCloudCover
// 0x01D0 (0x01D0 - 0x0000)
struct S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_EventName;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_EmitterTime;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Location;               // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity;               // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue4; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue5; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue6; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue7; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue8; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue9; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue10; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue11; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0070(0x000C)(ZeroConstructor, ReferenceParm)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors2;           // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item2;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors3;           // 0x0090(0x000C)(ZeroConstructor, ReferenceParm)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item3;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue12; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue13; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue14; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue15; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue16; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors4;           // 0x00B4(0x000C)(ZeroConstructor, ReferenceParm)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item4;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors5;           // 0x00C4(0x000C)(ZeroConstructor, ReferenceParm)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item5;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AHB_CommandCenter_Main_C*>       CallFunc_GetAllActorsOfClass_OutActors6;           // 0x00D4(0x000C)(ZeroConstructor, ReferenceParm)
	class AHB_CommandCenter_Main_C*               CallFunc_Array_Get_Item6;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource4;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus4;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent4;             // 0x00EC(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource3;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus3;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent3;             // 0x010C(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x012C(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x014C(0x0018)(ConstParm)
	class FName                                   K2Node_ComponentBoundEvent_EventName4;             // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_EmitterTime4;           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Location4;              // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity4;              // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_EventName3;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_EmitterTime3;           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Location3;              // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity3;              // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_EventName2;             // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_EmitterTime2;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Location2;              // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity2;              // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover) == 0x0001D0, "Wrong size on S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, EntryPoint) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::EntryPoint' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EventName) == 0x000004, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EventName' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EmitterTime) == 0x00000C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Location) == 0x000010, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Location' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Velocity) == 0x00001C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Velocity' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000028, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_SpawnSoundAttached_ReturnValue) == 0x00003C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000040, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000044, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000048, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue3) == 0x00004C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue4) == 0x000050, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue5) == 0x000054, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue5' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue6) == 0x000058, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue6' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue7) == 0x00005C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue7' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue8) == 0x000060, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue8' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue9) == 0x000064, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue9' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue10) == 0x000068, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue10' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue11) == 0x00006C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue11' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors) == 0x000070, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors2) == 0x00007C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item) == 0x000088, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item2) == 0x00008C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors3) == 0x000090, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item3) == 0x00009C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue12) == 0x0000A0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue12' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue13) == 0x0000A4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue13' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue14) == 0x0000A8, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue14' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue15) == 0x0000AC, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue15' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_CreateDynamicMaterialInstance_ReturnValue16) == 0x0000B0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_CreateDynamicMaterialInstance_ReturnValue16' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors4) == 0x0000B4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item4) == 0x0000C0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors5) == 0x0000C4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors5' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item5) == 0x0000D0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_GetAllActorsOfClass_OutActors6) == 0x0000D4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_GetAllActorsOfClass_OutActors6' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, CallFunc_Array_Get_Item6) == 0x0000E0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventSource4) == 0x0000E4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventSource4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventFocus4) == 0x0000E8, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventFocus4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_ClientEvent4) == 0x0000EC, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_ClientEvent4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventSource3) == 0x000104, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventSource3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventFocus3) == 0x000108, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventFocus3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_ClientEvent3) == 0x00010C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_ClientEvent3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventSource2) == 0x000124, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventSource2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventFocus2) == 0x000128, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_ClientEvent2) == 0x00012C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_ClientEvent2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventSource) == 0x000144, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_EventFocus) == 0x000148, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_HandleClientEvent_ClientEvent) == 0x00014C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EventName4) == 0x000164, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EventName4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EmitterTime4) == 0x00016C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EmitterTime4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Location4) == 0x000170, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Location4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Velocity4) == 0x00017C, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Velocity4' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EventName3) == 0x000188, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EventName3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EmitterTime3) == 0x000190, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EmitterTime3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Location3) == 0x000194, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Location3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Velocity3) == 0x0001A0, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Velocity3' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EventName2) == 0x0001AC, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EventName2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_EmitterTime2) == 0x0001B4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_EmitterTime2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Location2) == 0x0001B8, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Location2' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover, K2Node_ComponentBoundEvent_Velocity2) == 0x0001C4, "Member 'S_HB_OnboardingCloudCover_C_ExecuteUbergraph_S_HB_OnboardingCloudCover::K2Node_ComponentBoundEvent_Velocity2' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'S_HB_OnboardingCloudCover_C_BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.HandleClientEvent_OnboardingRevealAllBuildings
// 0x0020 (0x0020 - 0x0000)
struct S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings) == 0x000020, "Wrong size on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings, EventSource) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings::EventSource' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings, EventFocus) == 0x000004, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings::EventFocus' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings, ClientEvent) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealAllBuildings::ClientEvent' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.HandleClientEvent_OnboardingBuildingsStage2
// 0x0020 (0x0020 - 0x0000)
struct S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2 final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2) == 0x000020, "Wrong size on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2, EventSource) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2::EventSource' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2, EventFocus) == 0x000004, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2::EventFocus' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2, ClientEvent) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage2::ClientEvent' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.HandleClientEvent_OnboardingRevealHeroBuildings
// 0x0020 (0x0020 - 0x0000)
struct S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings) == 0x000020, "Wrong size on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings, EventSource) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings::EventSource' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings, EventFocus) == 0x000004, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings::EventFocus' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings, ClientEvent) == 0x000008, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingRevealHeroBuildings::ClientEvent' has a wrong offset!");

// Function S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C.HandleClientEvent_OnboardingBuildingsStage1
// 0x0020 (0x0020 - 0x0000)
struct S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1 final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1) == 0x000004, "Wrong alignment on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1");
static_assert(sizeof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1) == 0x000020, "Wrong size on S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1, EventSource) == 0x000000, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1::EventSource' has a wrong offset!");
static_assert(offsetof(S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1, EventFocus) == 0x000004, "Member 'S_HB_OnboardingCloudCover_C_HandleClientEvent_OnboardingBuildingsStage1::EventFocus' has a wrong offset!");
