#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class SlateCore.FontBulkData
// 0x0064 (0x0080 - 0x001C)
class UFontBulkData final : public UObject
{
public:
	uint8                                         Pad_1C[0x64];                                      // 0x001C(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FontBulkData">();
	}
	static class UFontBulkData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFontBulkData>();
	}
};
static_assert(alignof(UFontBulkData) == 0x000004, "Wrong alignment on UFontBulkData");
static_assert(sizeof(UFontBulkData) == 0x000080, "Wrong size on UFontBulkData");

// Class SlateCore.FontProviderInterface
// 0x0000 (0x001C - 0x001C)
class IFontProviderInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FontProviderInterface">();
	}
	static class IFontProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFontProviderInterface>();
	}
};
static_assert(alignof(IFontProviderInterface) == 0x000004, "Wrong alignment on IFontProviderInterface");
static_assert(sizeof(IFontProviderInterface) == 0x00001C, "Wrong size on IFontProviderInterface");

// Class SlateCore.SlateTypes
// 0x0000 (0x001C - 0x001C)
class USlateTypes final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateTypes">();
	}
	static class USlateTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateTypes>();
	}
};
static_assert(alignof(USlateTypes) == 0x000004, "Wrong alignment on USlateTypes");
static_assert(sizeof(USlateTypes) == 0x00001C, "Wrong size on USlateTypes");

// Class SlateCore.SlateWidgetStyleContainerInterface
// 0x0000 (0x001C - 0x001C)
class ISlateWidgetStyleContainerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateWidgetStyleContainerInterface">();
	}
	static class ISlateWidgetStyleContainerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISlateWidgetStyleContainerInterface>();
	}
};
static_assert(alignof(ISlateWidgetStyleContainerInterface) == 0x000004, "Wrong alignment on ISlateWidgetStyleContainerInterface");
static_assert(sizeof(ISlateWidgetStyleContainerInterface) == 0x00001C, "Wrong size on ISlateWidgetStyleContainerInterface");

// Class SlateCore.SlateWidgetStyleContainerBase
// 0x0004 (0x0020 - 0x001C)
class USlateWidgetStyleContainerBase : public UObject
{
public:
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateWidgetStyleContainerBase">();
	}
	static class USlateWidgetStyleContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateWidgetStyleContainerBase>();
	}
};
static_assert(alignof(USlateWidgetStyleContainerBase) == 0x000004, "Wrong alignment on USlateWidgetStyleContainerBase");
static_assert(sizeof(USlateWidgetStyleContainerBase) == 0x000020, "Wrong size on USlateWidgetStyleContainerBase");

// Class SlateCore.SlateWidgetStyleAsset
// 0x0004 (0x0020 - 0x001C)
class USlateWidgetStyleAsset final : public UObject
{
public:
	class USlateWidgetStyleContainerBase*         CustomStyle;                                       // 0x001C(0x0004)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateWidgetStyleAsset">();
	}
	static class USlateWidgetStyleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateWidgetStyleAsset>();
	}
};
static_assert(alignof(USlateWidgetStyleAsset) == 0x000004, "Wrong alignment on USlateWidgetStyleAsset");
static_assert(sizeof(USlateWidgetStyleAsset) == 0x000020, "Wrong size on USlateWidgetStyleAsset");
static_assert(offsetof(USlateWidgetStyleAsset, CustomStyle) == 0x00001C, "Member 'USlateWidgetStyleAsset::CustomStyle' has a wrong offset!");

}

#pragma pack(pop)
