#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateContent_ActionHandlerPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass SlateContent_ActionHandlerPanel.SlateContent_ActionHandlerPanel_C
// 0x0010 (0x0278 - 0x0268)
class USlateContent_ActionHandlerPanel_C final : public UFortActionHandlerPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLegacySlateBridgeWidget*           _Slate_Widget__Panel_Content;                      // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class USizeBox*                               SlateSizeBox;                                      // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	bool                                          CloseOnEscape;                                     // 0x0274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SlateContent_ActionHandlerPanel(int32 EntryPoint);
	void HandleOnSlateWidgetClosed();
	void Construct();
	void InitializeSlateContent(EFortLegacySlateWidget Slate_Widget_Type);
	void OnHandleAction(struct FEventReply* Result, bool* bPassThrough);
	void SetSizeBoxOverrides(float InWidth, float InHeight);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SlateContent_ActionHandlerPanel_C">();
	}
	static class USlateContent_ActionHandlerPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateContent_ActionHandlerPanel_C>();
	}
};
static_assert(alignof(USlateContent_ActionHandlerPanel_C) == 0x000004, "Wrong alignment on USlateContent_ActionHandlerPanel_C");
static_assert(sizeof(USlateContent_ActionHandlerPanel_C) == 0x000278, "Wrong size on USlateContent_ActionHandlerPanel_C");
static_assert(offsetof(USlateContent_ActionHandlerPanel_C, UberGraphFrame) == 0x000268, "Member 'USlateContent_ActionHandlerPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USlateContent_ActionHandlerPanel_C, _Slate_Widget__Panel_Content) == 0x00026C, "Member 'USlateContent_ActionHandlerPanel_C::_Slate_Widget__Panel_Content' has a wrong offset!");
static_assert(offsetof(USlateContent_ActionHandlerPanel_C, SlateSizeBox) == 0x000270, "Member 'USlateContent_ActionHandlerPanel_C::SlateSizeBox' has a wrong offset!");
static_assert(offsetof(USlateContent_ActionHandlerPanel_C, CloseOnEscape) == 0x000274, "Member 'USlateContent_ActionHandlerPanel_C::CloseOnEscape' has a wrong offset!");

}

#pragma pack(pop)
