#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateContent_ActionHandlerPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function SlateContent_ActionHandlerPanel.SlateContent_ActionHandlerPanel_C.ExecuteUbergraph_SlateContent_ActionHandlerPanel
// 0x0014 (0x0014 - 0x0000)
struct SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel) == 0x000004, "Wrong alignment on SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel");
static_assert(sizeof(SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel) == 0x000014, "Wrong size on SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel, EntryPoint) == 0x000000, "Member 'SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SlateContent_ActionHandlerPanel_C_ExecuteUbergraph_SlateContent_ActionHandlerPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function SlateContent_ActionHandlerPanel.SlateContent_ActionHandlerPanel_C.InitializeSlateContent
// 0x0001 (0x0001 - 0x0000)
struct SlateContent_ActionHandlerPanel_C_InitializeSlateContent final
{
public:
	EFortLegacySlateWidget                        Slate_Widget_Type;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlateContent_ActionHandlerPanel_C_InitializeSlateContent) == 0x000001, "Wrong alignment on SlateContent_ActionHandlerPanel_C_InitializeSlateContent");
static_assert(sizeof(SlateContent_ActionHandlerPanel_C_InitializeSlateContent) == 0x000001, "Wrong size on SlateContent_ActionHandlerPanel_C_InitializeSlateContent");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_InitializeSlateContent, Slate_Widget_Type) == 0x000000, "Member 'SlateContent_ActionHandlerPanel_C_InitializeSlateContent::Slate_Widget_Type' has a wrong offset!");

// Function SlateContent_ActionHandlerPanel.SlateContent_ActionHandlerPanel_C.OnHandleAction
// 0x0188 (0x0188 - 0x0000)
struct SlateContent_ActionHandlerPanel_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x0060)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0064(0x0060)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00C4(0x0060)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x0124(0x0060)()
	bool                                          HandleAction;                                      // 0x0184(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlateContent_ActionHandlerPanel_C_OnHandleAction) == 0x000004, "Wrong alignment on SlateContent_ActionHandlerPanel_C_OnHandleAction");
static_assert(sizeof(SlateContent_ActionHandlerPanel_C_OnHandleAction) == 0x000188, "Wrong size on SlateContent_ActionHandlerPanel_C_OnHandleAction");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, Result) == 0x000000, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, bPassThrough) == 0x000060, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, Temp_bool_Variable) == 0x000061, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, CallFunc_Unhandled_ReturnValue) == 0x000064, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x0000C4, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, K2Node_Select_Default) == 0x000124, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_OnHandleAction, HandleAction) == 0x000184, "Member 'SlateContent_ActionHandlerPanel_C_OnHandleAction::HandleAction' has a wrong offset!");

// Function SlateContent_ActionHandlerPanel.SlateContent_ActionHandlerPanel_C.SetSizeBoxOverrides
// 0x0008 (0x0008 - 0x0000)
struct SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides final
{
public:
	float                                         InWidth;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         InHeight;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides) == 0x000004, "Wrong alignment on SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides");
static_assert(sizeof(SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides) == 0x000008, "Wrong size on SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides, InWidth) == 0x000000, "Member 'SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides::InWidth' has a wrong offset!");
static_assert(offsetof(SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides, InHeight) == 0x000004, "Member 'SlateContent_ActionHandlerPanel_C_SetSizeBoxOverrides::InHeight' has a wrong offset!");

}

#pragma pack(pop)
