#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StorePinataMaster_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function StorePinataMaster_BP.StorePinataMaster_BP_C.ExecuteUbergraph_StorePinataMaster_BP
// 0x0870 (0x0870 - 0x0000)
struct StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0004(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A8(0x0080)(ContainsInstancedReference)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortStoreState                               K2Node_CustomEvent_NewStoreState;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0130(0x000C)(ZeroConstructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CardPackOpeningComplete_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CardPackDestroyComplete_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortStoreState NewStoreState)> K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x016C(0x0080)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x01F0(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult2;      // 0x0270(0x0080)(ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult3;      // 0x0314(0x0080)(ContainsInstancedReference)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x03AC(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult4;      // 0x042C(0x0080)(ContainsInstancedReference)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate2;             // 0x04AC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue2;     // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue2;           // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x04F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue2;     // 0x0504(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0525(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526[0x2];                                      // 0x0526(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select2_Default;                            // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             K2Node_CustomEvent_InputTickleVO;                  // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0540(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0553(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556[0x2];                                      // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x056C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0584(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue2;   // 0x058C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0594(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x05AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x05BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_ColorToString_ReturnValue;           // 0x05CC(0x000C)(ZeroConstructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select3_Default;                            // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA[0x2];                                      // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           Temp_assetclass_Variable;                          // 0x05EC(0x000C)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue5;     // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0628(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 Temp_class_Variable;                               // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_CustomEvent_Loaded;                         // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<TSoftClassPtr<class UClass>>           Temp_assetclass_Variable2;                         // 0x0644(0x000C)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0650(0x000C)(ZeroConstructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition2;     // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue2;        // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMousePosition_LocationX2;              // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMousePosition_LocationY2;              // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMousePosition_ReturnValue2;            // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue3;   // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor3;                    // 0x0690(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x06A0(0x0030)(IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue;           // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue2;          // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base2;                  // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue3;          // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base3;                  // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1[0x3];                                      // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue5;                  // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AStoreWeaponMaster_BP_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue4;         // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AStoreCamera_Blueprint_C*>       CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0714(0x000C)(ZeroConstructor, ReferenceParm)
	class AStoreCamera_Blueprint_C*               CallFunc_Array_Get_Item2;                          // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStoreCardReveal_BP_C*>          CallFunc_GetAllActorsOfClass_OutActors3;           // 0x072C(0x000C)(ZeroConstructor, ReferenceParm)
	class AStoreCardReveal_BP_C*                  CallFunc_Array_Get_Item3;                          // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x3];                                      // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     K2Node_MakeArray_Array;                            // 0x0744(0x000C)(ZeroConstructor, ReferenceParm)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue4;          // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue5;          // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue6;                  // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item4;                          // 0x0760(0x0018)()
	class UClass*                                 CallFunc_Conv_AssetClassToClass_ReturnValue;       // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsStore_Weapon_Master_BP;  // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue5;         // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue7;                  // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0794(0x000C)(ZeroConstructor)
	struct FKey                                   Temp_struct_Variable;                              // 0x07A0(0x0010)()
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x07B0(0x0010)()
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x07C0(0x0010)()
	struct FRotator                               CallFunc_RLerp_ReturnValue2;                       // 0x07D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult2;   // 0x07DC(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP) == 0x000010, "Wrong alignment on StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP");
static_assert(sizeof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP) == 0x000870, "Wrong size on StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, EntryPoint) == 0x000000, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000004, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000084, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector_X) == 0x000090, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector_Y) == 0x000094, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector_Z) == 0x000098, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_MakeVector_ReturnValue) == 0x00009C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000A8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetContext_ReturnValue) == 0x000128, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CustomEvent_NewStoreState) == 0x00012C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CustomEvent_NewStoreState' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_SwitchEnum_CmpSuccess) == 0x00012D, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_IntToString_ReturnValue) == 0x000130, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetContext_ReturnValue2) == 0x00013C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_CardPackOpeningComplete_ReturnValue) == 0x000140, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_CardPackOpeningComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CustomEvent_Enable) == 0x000141, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetContext_ReturnValue3) == 0x000144, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_CardPackDestroyComplete_ReturnValue) == 0x000148, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_CardPackDestroyComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetContext_ReturnValue4) == 0x00015C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Lerp_ReturnValue) == 0x000160, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Lerp_ReturnValue2) == 0x000164, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Variable) == 0x000168, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00016C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable) == 0x0001EC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0001F0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldLocation_SweepHitResult2) == 0x000270, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetPlayerController_ReturnValue) == 0x0002F0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_Event_DeltaSeconds) == 0x0002F4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Array_Index_Variable) == 0x0002F8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_MakeVector_ReturnValue2) == 0x0002FC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000308, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldLocation_SweepHitResult3) == 0x000314, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldLocation_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_RLerp_ReturnValue) == 0x000394, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_VLerp_ReturnValue) == 0x0003A0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0003AC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_SetWorldLocation_SweepHitResult4) == 0x00042C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_SetWorldLocation_SweepHitResult4' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CreateDelegate_OutputDelegate2) == 0x0004AC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Loop_Counter_Variable) == 0x0004BC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0004C0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable2) == 0x0004C4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Array_Index_Variable2) == 0x0004C8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Loop_Counter_Variable2) == 0x0004CC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Add_IntInt_ReturnValue2) == 0x0004D0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable3) == 0x0004D4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x0004D8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_Select_Default) == 0x0004DC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Variable2) == 0x0004E0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_LinearColorToColor_ReturnValue2) == 0x0004E4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_LinearColorToColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetTimelineLength_ReturnValue) == 0x0004E8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetTimelineLength_ReturnValue2) == 0x0004EC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetTimelineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable4) == 0x0004F0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetVectorParameterValue_ReturnValue) == 0x0004F4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetVectorParameterValue_ReturnValue2) == 0x000504, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetVectorParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable5) == 0x000514, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetPlayerController_ReturnValue2) == 0x000518, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_LocationX) == 0x00051C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_LocationY) == 0x000520, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_ReturnValue) == 0x000524, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable6) == 0x000525, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_MakeVector2D_ReturnValue) == 0x000528, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_Select2_Default) == 0x000530, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Variable3) == 0x000534, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CustomEvent_InputTickleVO) == 0x000538, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CustomEvent_InputTickleVO' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_SpawnSoundAttached_ReturnValue) == 0x00053C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000540, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Array_Length_ReturnValue) == 0x00054C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000550, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_IsClosed_Variable) == 0x000551, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable7) == 0x000552, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Has_Been_Initd_Variable2) == 0x000553, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_IsClosed_Variable2) == 0x000554, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable8) == 0x000555, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Array_Index_Variable3) == 0x000558, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Array_Get_Item) == 0x00055C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000560, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x00056C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000578, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000580, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000584, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Subtract_Vector2DVector2D_ReturnValue2) == 0x00058C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Subtract_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000594, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector2D_X) == 0x00059C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector2D_Y) == 0x0005A0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector2D_X2) == 0x0005A4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_BreakVector2D_Y2) == 0x0005A8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_MakeStruct_LinearColor) == 0x0005AC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_MakeStruct_LinearColor2) == 0x0005BC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_MakeStruct_LinearColor2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_ColorToString_ReturnValue) == 0x0005CC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_ColorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0005D8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_int_Loop_Counter_Variable3) == 0x0005DC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0005E0, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Add_IntInt_ReturnValue3) == 0x0005E4, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_bool_Variable9) == 0x0005E8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_Select3_Default) == 0x0005E9, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_assetclass_Variable) == 0x0005EC, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_assetclass_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_GetComponentLocation_ReturnValue4) == 0x0005F8, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_GetComponentLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_K2_GetComponentLocation_ReturnValue5) == 0x000604, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_K2_GetComponentLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000610, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00061C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000628, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000638, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_class_Variable) == 0x00063C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, K2Node_CustomEvent_Loaded) == 0x000640, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, Temp_assetclass_Variable2) == 0x000644, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::Temp_assetclass_Variable2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_Conv_FloatToString_ReturnValue) == 0x000650, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetPlayerController_ReturnValue3) == 0x00065C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_ProjectWorldToScreen_ScreenPosition2) == 0x000660, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_ProjectWorldToScreen_ScreenPosition2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_ProjectWorldToScreen_ReturnValue2) == 0x000668, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_ProjectWorldToScreen_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_LocationX2) == 0x00066C, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_LocationX2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_LocationY2) == 0x000670, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_LocationY2' has a wrong offset!");
static_assert(offsetof(StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP, CallFunc_GetMousePosition_ReturnValue2) == 0x000674, "Member 'StorePinataMaster_BP_C_ExecuteUbergraph_StorePinataMaster_BP::CallFunc_GetMousePosition_ReturnValue2' has a wrong offset!");
