#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCamera_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function StoreCamera_Blueprint.StoreCamera_Blueprint_C.ExecuteUbergraph_StoreCamera_Blueprint
// 0x0110 (0x0110 - 0x0000)
struct StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ADayPhaseLightingAndFog_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0014(0x000C)(ZeroConstructor, ReferenceParm)
	class ADayPhaseLightingAndFog_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0054(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStorePinataMaster_BP_C*>        CallFunc_GetAllActorsOfClass_OutActors2;           // 0x00D8(0x000C)(ZeroConstructor, ReferenceParm)
	class AStorePinataMaster_BP_C*                CallFunc_Array_Get_Item2;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AStoreCardReveal_BP_C*>          CallFunc_GetAllActorsOfClass_OutActors3;           // 0x00EC(0x000C)(ZeroConstructor, ReferenceParm)
	class AStoreCardReveal_BP_C*                  CallFunc_Array_Get_Item3;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint) == 0x000004, "Wrong alignment on StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint");
static_assert(sizeof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint) == 0x000110, "Wrong size on StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, EntryPoint) == 0x000000, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Array_Index_Variable) == 0x000004, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Array_Index_Variable2) == 0x000010, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000014, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000020, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Loop_Counter_Variable2) == 0x00002C, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Add_IntInt_ReturnValue2) == 0x000030, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Array_Index_Variable3) == 0x000034, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_RLerp_ReturnValue) == 0x00003C, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_VLerp_ReturnValue) == 0x000048, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000054, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0000D4, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, K2Node_CustomEvent_Enable) == 0x0000D5, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors2) == 0x0000D8, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Get_Item2) == 0x0000E4, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Length_ReturnValue2) == 0x0000E8, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors3) == 0x0000EC, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Get_Item3) == 0x0000F8, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Array_Length_ReturnValue3) == 0x0000FC, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Less_IntInt_ReturnValue2) == 0x000100, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, Temp_int_Loop_Counter_Variable3) == 0x000104, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Less_IntInt_ReturnValue3) == 0x000108, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint, CallFunc_Add_IntInt_ReturnValue3) == 0x00010C, "Member 'StoreCamera_Blueprint_C_ExecuteUbergraph_StoreCamera_Blueprint::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");

// Function StoreCamera_Blueprint.StoreCamera_Blueprint_C.DarkenBGVisibility
// 0x0001 (0x0001 - 0x0000)
struct StoreCamera_Blueprint_C_DarkenBGVisibility final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreCamera_Blueprint_C_DarkenBGVisibility) == 0x000001, "Wrong alignment on StoreCamera_Blueprint_C_DarkenBGVisibility");
static_assert(sizeof(StoreCamera_Blueprint_C_DarkenBGVisibility) == 0x000001, "Wrong size on StoreCamera_Blueprint_C_DarkenBGVisibility");
static_assert(offsetof(StoreCamera_Blueprint_C_DarkenBGVisibility, Enable) == 0x000000, "Member 'StoreCamera_Blueprint_C_DarkenBGVisibility::Enable' has a wrong offset!");

// Function StoreCamera_Blueprint.StoreCamera_Blueprint_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct StoreCamera_Blueprint_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue2;     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreCamera_Blueprint_C_UserConstructionScript) == 0x000004, "Wrong alignment on StoreCamera_Blueprint_C_UserConstructionScript");
static_assert(sizeof(StoreCamera_Blueprint_C_UserConstructionScript) == 0x000030, "Wrong size on StoreCamera_Blueprint_C_UserConstructionScript");
static_assert(offsetof(StoreCamera_Blueprint_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000000, "Member 'StoreCamera_Blueprint_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue2) == 0x00000C, "Member 'StoreCamera_Blueprint_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'StoreCamera_Blueprint_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCamera_Blueprint_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000024, "Member 'StoreCamera_Blueprint_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");

}

#pragma pack(pop)
