#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCamera_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass StoreCamera_Blueprint.StoreCamera_Blueprint_C
// 0x0058 (0x0660 - 0x0608)
class AStoreCamera_Blueprint_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh_DarkenBG;                                     // 0x060C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCameraComponent*                       CameraPlaceholderGround;                           // 0x0610(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9; // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9; // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x061C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CameraGroundLoc;                                   // 0x0620(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               CameraGroundRot;                                   // 0x062C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                CameraOriginalLoc;                                 // 0x0638(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               CameraOriginalRot;                                 // 0x0644(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CameraInStartPos;                                  // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MouseDown;                                         // 0x0651(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_652[0x2];                                      // 0x0652(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AStorePinataMaster_BP_C*                PinataInLevel;                                     // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ADayPhaseLightingAndFog_C*              WorldLighting;                                     // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AStoreCardReveal_BP_C*                  CardRevealInLevel;                                 // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_StoreCamera_Blueprint(int32 EntryPoint);
	void DarkenBGVisibility(bool Enable);
	void ResetCamera();
	void OpeningCameraTransition();
	void OnDeactivated();
	void OnActivated();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreCamera_Blueprint_C">();
	}
	static class AStoreCamera_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStoreCamera_Blueprint_C>();
	}
};
static_assert(alignof(AStoreCamera_Blueprint_C) == 0x000004, "Wrong alignment on AStoreCamera_Blueprint_C");
static_assert(sizeof(AStoreCamera_Blueprint_C) == 0x000660, "Wrong size on AStoreCamera_Blueprint_C");
static_assert(offsetof(AStoreCamera_Blueprint_C, UberGraphFrame) == 0x000608, "Member 'AStoreCamera_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Mesh_DarkenBG) == 0x00060C, "Member 'AStoreCamera_Blueprint_C::Mesh_DarkenBG' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraPlaceholderGround) == 0x000610, "Member 'AStoreCamera_Blueprint_C::CameraPlaceholderGround' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9) == 0x000614, "Member 'AStoreCamera_Blueprint_C::Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9) == 0x000618, "Member 'AStoreCamera_Blueprint_C::Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0) == 0x00061C, "Member 'AStoreCamera_Blueprint_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraGroundLoc) == 0x000620, "Member 'AStoreCamera_Blueprint_C::CameraGroundLoc' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraGroundRot) == 0x00062C, "Member 'AStoreCamera_Blueprint_C::CameraGroundRot' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraOriginalLoc) == 0x000638, "Member 'AStoreCamera_Blueprint_C::CameraOriginalLoc' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraOriginalRot) == 0x000644, "Member 'AStoreCamera_Blueprint_C::CameraOriginalRot' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraInStartPos) == 0x000650, "Member 'AStoreCamera_Blueprint_C::CameraInStartPos' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, MouseDown) == 0x000651, "Member 'AStoreCamera_Blueprint_C::MouseDown' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, PinataInLevel) == 0x000654, "Member 'AStoreCamera_Blueprint_C::PinataInLevel' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, WorldLighting) == 0x000658, "Member 'AStoreCamera_Blueprint_C::WorldLighting' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CardRevealInLevel) == 0x00065C, "Member 'AStoreCamera_Blueprint_C::CardRevealInLevel' has a wrong offset!");

}

#pragma pack(pop)
