#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheaterCamera_Blueprint

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TheaterCamera_Blueprint.TheaterCamera_Blueprint_C.ExecuteUbergraph_TheaterCamera_Blueprint
// 0x04F0 (0x04F0 - 0x0000)
struct TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ABP_Hex_Outpost_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0004(0x000C)(ZeroConstructor, ReferenceParm)
	struct FKey                                   UniqueObjectNameForCooking_Key2;                   // 0x0010(0x0010)()
	class ABP_Hex_Outpost_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   UniqueObjectNameForCooking_Key;                    // 0x0044(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ADayPhaseLightingAndFog_C*>      CallFunc_GetAllActorsOfClass_OutActors2;           // 0x005C(0x000C)(ZeroConstructor, ReferenceParm)
	class ADayPhaseLightingAndFog_C*              CallFunc_Array_Get_Item2;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors3;           // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue4;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item3;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue5;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LimitToTheater_ReturnValue;               // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortTheaterMapTile*                    K2Node_Event_TargetTile;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00E8(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue6;         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult2;      // 0x01B0(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue2;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue7;         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue2;        // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LimitToTheater_ReturnValue2;              // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LimitToTheater_ReturnValue3;              // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X4;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y4;                           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z4;                           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X5;                           // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y5;                           // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z5;                           // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue6;                  // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0354(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult2;   // 0x03D4(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue7;                  // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult3;      // 0x0460(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue3;         // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint) == 0x000010, "Wrong alignment on TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint");
static_assert(sizeof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint) == 0x0004F0, "Wrong size on TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, EntryPoint) == 0x000000, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000004, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, UniqueObjectNameForCooking_Key2) == 0x000010, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::UniqueObjectNameForCooking_Key2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000020, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000028, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue2) == 0x000038, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, UniqueObjectNameForCooking_Key) == 0x000044, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::UniqueObjectNameForCooking_Key' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000054, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue2) == 0x000058, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors2) == 0x00005C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Array_Get_Item2) == 0x000068, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue3) == 0x00006C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors3) == 0x00007C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue4) == 0x000088, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Array_Get_Item3) == 0x00008C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000090, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_X) == 0x00009C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Z) == 0x0000A4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue5) == 0x0000AC, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaX) == 0x0000B0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaY) == 0x0000B4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaY' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000B8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x0000BC, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue3) == 0x0000C0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x0000CC, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_LimitToTheater_ReturnValue) == 0x0000D8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_LimitToTheater_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, K2Node_Event_TargetTile) == 0x0000E4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::K2Node_Event_TargetTile' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000E8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000168, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue6) == 0x00016C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000170, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_X2) == 0x00017C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Y2) == 0x000180, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Z2) == 0x000184, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000188, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue4) == 0x00018C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_X3) == 0x000198, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Y3) == 0x00019C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Z3) == 0x0001A0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_VLerp_ReturnValue) == 0x0001A4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_SweepHitResult2) == 0x0001B0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_ReturnValue2) == 0x000230, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue7) == 0x000234, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetRelativeTransform_ReturnValue) == 0x000240, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GetRelativeTransform_ReturnValue2) == 0x000270, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GetRelativeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Location) == 0x0002A0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Rotation) == 0x0002AC, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Scale) == 0x0002B8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Location2) == 0x0002C4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Rotation2) == 0x0002D0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakTransform_Scale2) == 0x0002DC, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Add_VectorVector_ReturnValue2) == 0x0002E8, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_Add_VectorVector_ReturnValue3) == 0x0002F4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_LimitToTheater_ReturnValue2) == 0x000300, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_LimitToTheater_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_LimitToTheater_ReturnValue3) == 0x00030C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_LimitToTheater_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_X4) == 0x000318, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_X4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Y4) == 0x00031C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Y4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Z4) == 0x000320, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Z4' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_X5) == 0x000324, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_X5' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Y5) == 0x000328, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Y5' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_BreakVector_Z5) == 0x00032C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_BreakVector_Z5' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000330, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000331, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_FClamp_ReturnValue) == 0x000334, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_FClamp_ReturnValue2) == 0x000338, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue5) == 0x00033C, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue6) == 0x000348, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000354, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetRelativeLocation_SweepHitResult2) == 0x0003D4, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetRelativeLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_MakeVector_ReturnValue7) == 0x000454, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_MakeVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_SweepHitResult3) == 0x000460, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint, CallFunc_K2_SetActorLocation_ReturnValue3) == 0x0004E0, "Member 'TheaterCamera_Blueprint_C_ExecuteUbergraph_TheaterCamera_Blueprint::CallFunc_K2_SetActorLocation_ReturnValue3' has a wrong offset!");

// Function TheaterCamera_Blueprint.TheaterCamera_Blueprint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TheaterCamera_Blueprint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TheaterCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong alignment on TheaterCamera_Blueprint_C_ReceiveTick");
static_assert(sizeof(TheaterCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong size on TheaterCamera_Blueprint_C_ReceiveTick");
static_assert(offsetof(TheaterCamera_Blueprint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TheaterCamera_Blueprint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function TheaterCamera_Blueprint.TheaterCamera_Blueprint_C.SetTileFocus
// 0x0004 (0x0004 - 0x0000)
struct TheaterCamera_Blueprint_C_SetTileFocus final
{
public:
	class AFortTheaterMapTile*                    TargetTile_0;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TheaterCamera_Blueprint_C_SetTileFocus) == 0x000004, "Wrong alignment on TheaterCamera_Blueprint_C_SetTileFocus");
static_assert(sizeof(TheaterCamera_Blueprint_C_SetTileFocus) == 0x000004, "Wrong size on TheaterCamera_Blueprint_C_SetTileFocus");
static_assert(offsetof(TheaterCamera_Blueprint_C_SetTileFocus, TargetTile_0) == 0x000000, "Member 'TheaterCamera_Blueprint_C_SetTileFocus::TargetTile_0' has a wrong offset!");

// Function TheaterCamera_Blueprint.TheaterCamera_Blueprint_C.InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10
// 0x0010 (0x0010 - 0x0000)
struct TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10) == 0x000004, "Wrong alignment on TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10");
static_assert(sizeof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10) == 0x000010, "Wrong size on TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10");
static_assert(offsetof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10, Key) == 0x000000, "Member 'TheaterCamera_Blueprint_C_InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10::Key' has a wrong offset!");

// Function TheaterCamera_Blueprint.TheaterCamera_Blueprint_C.InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11
// 0x0010 (0x0010 - 0x0000)
struct TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11) == 0x000004, "Wrong alignment on TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11");
static_assert(sizeof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11) == 0x000010, "Wrong size on TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11");
static_assert(offsetof(TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11, Key) == 0x000000, "Member 'TheaterCamera_Blueprint_C_InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11::Key' has a wrong offset!");

}

#pragma pack(pop)
