#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_CoreStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HeroCoreStat_structs.hpp"
#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-CoreStat.Tooltip-CoreStat_C
// 0x02F0 (0x04A8 - 0x01B8)
class UTooltip_CoreStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageStatIcon;                                     // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 ImageStatShadow;                                   // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextStatDesc;                                      // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextStatLabel;                                     // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextStatValue;                                     // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FHeroCoreStat                          Data;                                              // 0x01D0(0x02D4)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         Value;                                             // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Tooltip_CoreStat(int32 EntryPoint);
	void Construct();
	void Update(const struct FHeroCoreStat& Data_0, float Value_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-CoreStat_C">();
	}
	static class UTooltip_CoreStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltip_CoreStat_C>();
	}
};
static_assert(alignof(UTooltip_CoreStat_C) == 0x000004, "Wrong alignment on UTooltip_CoreStat_C");
static_assert(sizeof(UTooltip_CoreStat_C) == 0x0004A8, "Wrong size on UTooltip_CoreStat_C");
static_assert(offsetof(UTooltip_CoreStat_C, UberGraphFrame) == 0x0001B8, "Member 'UTooltip_CoreStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, ImageStatIcon) == 0x0001BC, "Member 'UTooltip_CoreStat_C::ImageStatIcon' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, ImageStatShadow) == 0x0001C0, "Member 'UTooltip_CoreStat_C::ImageStatShadow' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, TextStatDesc) == 0x0001C4, "Member 'UTooltip_CoreStat_C::TextStatDesc' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, TextStatLabel) == 0x0001C8, "Member 'UTooltip_CoreStat_C::TextStatLabel' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, TextStatValue) == 0x0001CC, "Member 'UTooltip_CoreStat_C::TextStatValue' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, Data) == 0x0001D0, "Member 'UTooltip_CoreStat_C::Data' has a wrong offset!");
static_assert(offsetof(UTooltip_CoreStat_C, Value) == 0x0004A4, "Member 'UTooltip_CoreStat_C::Value' has a wrong offset!");

}

#pragma pack(pop)
