#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_CoreStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HeroCoreStat_structs.hpp"
#include "SlateCore_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Tooltip-CoreStat.Tooltip-CoreStat_C.ExecuteUbergraph_Tooltip-CoreStat
// 0x0004 (0x0004 - 0x0000)
struct Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat) == 0x000004, "Wrong alignment on Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat");
static_assert(sizeof(Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat) == 0x000004, "Wrong size on Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat");
static_assert(offsetof(Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat, EntryPoint) == 0x000000, "Member 'Tooltip_CoreStat_C_ExecuteUbergraph_Tooltip_CoreStat::EntryPoint' has a wrong offset!");

// Function Tooltip-CoreStat.Tooltip-CoreStat_C.Update
// 0x03A0 (0x03A0 - 0x0000)
struct Tooltip_CoreStat_C_Update final
{
public:
	struct FHeroCoreStat                          Data_0;                                            // 0x0000(0x02D4)(Parm)
	float                                         Value_0;                                           // 0x02D4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x02D8(0x0074)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x034C(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0364(0x000C)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0370(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0388(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0394(0x000C)()
};
static_assert(alignof(Tooltip_CoreStat_C_Update) == 0x000004, "Wrong alignment on Tooltip_CoreStat_C_Update");
static_assert(sizeof(Tooltip_CoreStat_C_Update) == 0x0003A0, "Wrong size on Tooltip_CoreStat_C_Update");
static_assert(offsetof(Tooltip_CoreStat_C_Update, Data_0) == 0x000000, "Member 'Tooltip_CoreStat_C_Update::Data_0' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, Value_0) == 0x0002D4, "Member 'Tooltip_CoreStat_C_Update::Value_0' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x0002D8, "Member 'Tooltip_CoreStat_C_Update::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, K2Node_MakeStruct_FormatArgumentData) == 0x00034C, "Member 'Tooltip_CoreStat_C_Update::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, CallFunc_Conv_FloatToText_ReturnValue) == 0x000364, "Member 'Tooltip_CoreStat_C_Update::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, K2Node_MakeStruct_FormatArgumentData2) == 0x000370, "Member 'Tooltip_CoreStat_C_Update::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, K2Node_MakeArray_Array) == 0x000388, "Member 'Tooltip_CoreStat_C_Update::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Tooltip_CoreStat_C_Update, CallFunc_Format_ReturnValue) == 0x000394, "Member 'Tooltip_CoreStat_C_Update::CallFunc_Format_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
