#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipStatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "TooltipStat_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass TooltipStatWidget.TooltipStatWidget_C
// 0x0058 (0x0210 - 0x01B8)
class UTooltipStatWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _Image__HR;                                        // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Label;                                      // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Single;                                     // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Value;                                      // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                ButtonHover;                                       // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        Switcher;                                          // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FTooltipStat                           TooltipData;                                       // 0x01D4(0x001C)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            TextColor;                                         // 0x01F0(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HoverEnabled;                                      // 0x020C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_TooltipStatWidget(int32 EntryPoint);
	void BndEvt__ButtonHover_K2Node_ComponentBoundEvent_1037_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonHover_K2Node_ComponentBoundEvent_1026_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TooltipStatWidget_C">();
	}
	static class UTooltipStatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipStatWidget_C>();
	}
};
static_assert(alignof(UTooltipStatWidget_C) == 0x000004, "Wrong alignment on UTooltipStatWidget_C");
static_assert(sizeof(UTooltipStatWidget_C) == 0x000210, "Wrong size on UTooltipStatWidget_C");
static_assert(offsetof(UTooltipStatWidget_C, UberGraphFrame) == 0x0001B8, "Member 'UTooltipStatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, _Image__HR) == 0x0001BC, "Member 'UTooltipStatWidget_C::_Image__HR' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, _Text__Label) == 0x0001C0, "Member 'UTooltipStatWidget_C::_Text__Label' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, _Text__Single) == 0x0001C4, "Member 'UTooltipStatWidget_C::_Text__Single' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, _Text__Value) == 0x0001C8, "Member 'UTooltipStatWidget_C::_Text__Value' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, ButtonHover) == 0x0001CC, "Member 'UTooltipStatWidget_C::ButtonHover' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, Switcher) == 0x0001D0, "Member 'UTooltipStatWidget_C::Switcher' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, TooltipData) == 0x0001D4, "Member 'UTooltipStatWidget_C::TooltipData' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, TextColor) == 0x0001F0, "Member 'UTooltipStatWidget_C::TextColor' has a wrong offset!");
static_assert(offsetof(UTooltipStatWidget_C, HoverEnabled) == 0x00020C, "Member 'UTooltipStatWidget_C::HoverEnabled' has a wrong offset!");

}

#pragma pack(pop)
