#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipDurabilityMeter

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TooltipDurabilityMeter.TooltipDurabilityMeter_C.Draw
// 0x008C (0x008C - 0x0000)
struct TooltipDurabilityMeter_C_Draw final
{
public:
	float                                         Normalized;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Current;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Max;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x000C)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x001C(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue2;            // 0x0034(0x000C)()
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0044(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x006C(0x000C)()
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x007C(0x000C)()
	bool                                          Temp_bool_Variable2;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TooltipDurabilityMeter_C_Draw) == 0x000004, "Wrong alignment on TooltipDurabilityMeter_C_Draw");
static_assert(sizeof(TooltipDurabilityMeter_C_Draw) == 0x00008C, "Wrong size on TooltipDurabilityMeter_C_Draw");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Normalized) == 0x000000, "Member 'TooltipDurabilityMeter_C_Draw::Normalized' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Current) == 0x000004, "Member 'TooltipDurabilityMeter_C_Draw::Current' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Max) == 0x000008, "Member 'TooltipDurabilityMeter_C_Draw::Max' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Temp_byte_Variable) == 0x00000C, "Member 'TooltipDurabilityMeter_C_Draw::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, CallFunc_Conv_FloatToText_ReturnValue) == 0x000010, "Member 'TooltipDurabilityMeter_C_Draw::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, K2Node_MakeStruct_FormatArgumentData) == 0x00001C, "Member 'TooltipDurabilityMeter_C_Draw::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, CallFunc_Conv_FloatToText_ReturnValue2) == 0x000034, "Member 'TooltipDurabilityMeter_C_Draw::CallFunc_Conv_FloatToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'TooltipDurabilityMeter_C_Draw::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, K2Node_MakeStruct_FormatArgumentData2) == 0x000044, "Member 'TooltipDurabilityMeter_C_Draw::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Temp_bool_Variable) == 0x00005C, "Member 'TooltipDurabilityMeter_C_Draw::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, K2Node_MakeArray_Array) == 0x000060, "Member 'TooltipDurabilityMeter_C_Draw::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, CallFunc_Format_ReturnValue) == 0x00006C, "Member 'TooltipDurabilityMeter_C_Draw::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Temp_byte_Variable2) == 0x000078, "Member 'TooltipDurabilityMeter_C_Draw::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, K2Node_Select_Default) == 0x00007C, "Member 'TooltipDurabilityMeter_C_Draw::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, Temp_bool_Variable2) == 0x000088, "Member 'TooltipDurabilityMeter_C_Draw::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TooltipDurabilityMeter_C_Draw, K2Node_Select2_Default) == 0x000089, "Member 'TooltipDurabilityMeter_C_Draw::K2Node_Select2_Default' has a wrong offset!");

}

#pragma pack(pop)
