#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipStatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TooltipStatWidget.TooltipStatWidget_C.ExecuteUbergraph_TooltipStatWidget
// 0x0004 (0x0004 - 0x0000)
struct TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget) == 0x000004, "Wrong alignment on TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget");
static_assert(sizeof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget) == 0x000004, "Wrong size on TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget");
static_assert(offsetof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget, EntryPoint) == 0x000000, "Member 'TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget::EntryPoint' has a wrong offset!");

// Function TooltipStatWidget.TooltipStatWidget_C.Init
// 0x00EC (0x00EC - 0x0000)
struct TooltipStatWidget_C_Init final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x001C)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x001C(0x001C)()
	struct FLinearColor                           CallFunc_Get_Theme_Color_Theme_Color;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Get_Additive_Color_Color;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x0058(0x001C)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor4;                     // 0x0074(0x001C)()
	struct FLinearColor                           CallFunc_Get_Negative_Color_Color;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Get_Theme_Color_Theme_Color2;             // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor5;                     // 0x00B0(0x001C)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor6;                     // 0x00CC(0x001C)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TooltipStatWidget_C_Init) == 0x000004, "Wrong alignment on TooltipStatWidget_C_Init");
static_assert(sizeof(TooltipStatWidget_C_Init) == 0x0000EC, "Wrong size on TooltipStatWidget_C_Init");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor2) == 0x00001C, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Theme_Color_Theme_Color) == 0x000038, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Theme_Color_Theme_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Additive_Color_Color) == 0x000048, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Additive_Color_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor3) == 0x000058, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor4) == 0x000074, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor4' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Negative_Color_Color) == 0x000090, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Negative_Color_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Theme_Color_Theme_Color2) == 0x0000A0, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Theme_Color_Theme_Color2' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor5) == 0x0000B0, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor5' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor6) == 0x0000CC, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor6' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'TooltipStatWidget_C_Init::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

#pragma pack(pop)
