#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopLevel_TabControls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass TopLevel-TabControls.TopLevel-TabControls_C
// 0x004C (0x02B4 - 0x0268)
class UTopLevel_TabControls_C final : public UFortActionHandlerPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       QuestCountPulse;                                   // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button__Friends;                                  // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button__Menu;                                     // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button_Journal;                                   // 0x0278(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMenuAnchor*                            _Menu_Anchor__Friends_List;                        // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMenuAnchor*                            _Menu_Anchor__Journal;                             // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMenuAnchor*                            _MenuAnchor__Main_Menu;                            // 0x0284(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                BorderOuterFrame;                                  // 0x0288(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_1045;                                        // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	int32                                         ActiveIndex;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Sound_ConfigClicked;                               // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        CurrentSelectedButton;                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        Context;                                           // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowFriends;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ShowJournal;                                       // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestCount_Int;                                    // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   FriendsButton_ToolTipText;                         // 0x02A8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_TopLevel_TabControls(int32 EntryPoint);
	void HandleClientEvent_OpenNewsScreen(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_OpenQuestJournal(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleQuestUpdated();
	void BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED);
	void BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void HandlePartyTransitionStarted(EFortPartyTransition PartyTransition);
	void HandlePartyTransitionComplete(EFortPartyTransition PartyTransition);
	void OnSocialUpdate(const TArray<class UFortSocialItem*>& SocialItems);
	void On_Social_Feature_Changed_Copy(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState);
	void Construct();
	void ClearActiveTab();
	void OnHandleAction(struct FEventReply* Result, bool* bPassThrough);
	class UWidget* OnGetFriendsList();
	class UWidget* OnGetMainMenu();
	void HandleMenuAnchorChanged(class UButtonIconText_C* Menu_Button, bool Is_Open);
	void HandleMainMenuClose();
	void OpenMainMenu();
	void UpdateFriendButtonState(EFortUIFeatureState FeatureState);
	class UWidget* OnGetJournal();
	void SelectButtonAndMenuAnchor(class UFortBaseButton* Button, class UMenuAnchor* MenuAnchor, bool FocusMenu);
	void InitializeFriendAndJournal();
	void SetQuestCountIndicator();
	void GetTotalQuestCount(int32* outQuestCount);
	class UWidget* Journal_ToolTipWidget();
	class UWidget* Friends_ToolTipWidget();
	class UWidget* Menu_ToolTipWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopLevel-TabControls_C">();
	}
	static class UTopLevel_TabControls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopLevel_TabControls_C>();
	}
};
static_assert(alignof(UTopLevel_TabControls_C) == 0x000004, "Wrong alignment on UTopLevel_TabControls_C");
static_assert(sizeof(UTopLevel_TabControls_C) == 0x0002B4, "Wrong size on UTopLevel_TabControls_C");
static_assert(offsetof(UTopLevel_TabControls_C, UberGraphFrame) == 0x000268, "Member 'UTopLevel_TabControls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, QuestCountPulse) == 0x00026C, "Member 'UTopLevel_TabControls_C::QuestCountPulse' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _Button__Friends) == 0x000270, "Member 'UTopLevel_TabControls_C::_Button__Friends' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _Button__Menu) == 0x000274, "Member 'UTopLevel_TabControls_C::_Button__Menu' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _Button_Journal) == 0x000278, "Member 'UTopLevel_TabControls_C::_Button_Journal' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _Menu_Anchor__Friends_List) == 0x00027C, "Member 'UTopLevel_TabControls_C::_Menu_Anchor__Friends_List' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _Menu_Anchor__Journal) == 0x000280, "Member 'UTopLevel_TabControls_C::_Menu_Anchor__Journal' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, _MenuAnchor__Main_Menu) == 0x000284, "Member 'UTopLevel_TabControls_C::_MenuAnchor__Main_Menu' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, BorderOuterFrame) == 0x000288, "Member 'UTopLevel_TabControls_C::BorderOuterFrame' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, Image_1045) == 0x00028C, "Member 'UTopLevel_TabControls_C::Image_1045' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, ActiveIndex) == 0x000290, "Member 'UTopLevel_TabControls_C::ActiveIndex' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, Sound_ConfigClicked) == 0x000294, "Member 'UTopLevel_TabControls_C::Sound_ConfigClicked' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, CurrentSelectedButton) == 0x000298, "Member 'UTopLevel_TabControls_C::CurrentSelectedButton' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, Context) == 0x00029C, "Member 'UTopLevel_TabControls_C::Context' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, ShowFriends) == 0x0002A0, "Member 'UTopLevel_TabControls_C::ShowFriends' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, ShowJournal) == 0x0002A1, "Member 'UTopLevel_TabControls_C::ShowJournal' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, QuestCount_Int) == 0x0002A4, "Member 'UTopLevel_TabControls_C::QuestCount_Int' has a wrong offset!");
static_assert(offsetof(UTopLevel_TabControls_C, FriendsButton_ToolTipText) == 0x0002A8, "Member 'UTopLevel_TabControls_C::FriendsButton_ToolTipText' has a wrong offset!");

}

#pragma pack(pop)
