#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopLevel_TabControls

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TopLevel-TabControls.TopLevel-TabControls_C.ExecuteUbergraph_TopLevel-TabControls
// 0x0134 (0x0134 - 0x0000)
struct TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0004(0x000C)()
	EFortUIFeature                                K2Node_CustomEvent_ChangedFeature;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           K2Node_CustomEvent_NewState;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortPartyTransition                          Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UFortSocialItem*>                K2Node_CustomEvent_SocialItems;                    // 0x0018(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(const TArray<class UFortSocialItem*>& SocialItems)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortPartyTransition PartyTransition)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortPartyTransition PartyTransition)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	EFortPartyTransition                          K2Node_CustomEvent_PartyTransition2;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortPartyTransition                          K2Node_CustomEvent_PartyTransition;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen3;               // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen2;               // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button6;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button5;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button4;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected3;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button3;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected2;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingFriendRequest_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           CallFunc_GetFeatureState_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   Temp_text_Variable2;                               // 0x00B8(0x000C)()
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x00CC(0x0018)(ConstParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x00EC(0x0018)(ConstParm)
	class UFortUIManagerWidget*                   CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewsScreenWidget_C*                    CallFunc_Create_ReturnValue;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable3;                               // 0x0118(0x000C)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x000C)()
};
static_assert(alignof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls");
static_assert(sizeof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls) == 0x000134, "Wrong size on TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, EntryPoint) == 0x000000, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, Temp_text_Variable) == 0x000004, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CustomEvent_ChangedFeature) == 0x000010, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CustomEvent_ChangedFeature' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CustomEvent_NewState) == 0x000011, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, Temp_byte_Variable) == 0x000012, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue) == 0x000014, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CustomEvent_SocialItems) == 0x000018, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CustomEvent_SocialItems' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CreateDelegate_OutputDelegate2) == 0x000034, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CreateDelegate_OutputDelegate3) == 0x000044, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CreateDelegate_OutputDelegate4) == 0x000054, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CustomEvent_PartyTransition2) == 0x000064, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CustomEvent_PartyTransition2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CustomEvent_PartyTransition) == 0x000065, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CustomEvent_PartyTransition' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_bIsOpen3) == 0x000066, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_bIsOpen3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_bIsOpen2) == 0x000067, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_bIsOpen2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button6) == 0x000068, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button5) == 0x00006C, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button4) == 0x000070, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Selected3) == 0x000074, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Selected3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button3) == 0x000078, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Selected2) == 0x00007C, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Selected2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue2) == 0x000080, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_HasPendingFriendRequest_ReturnValue) == 0x000084, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_HasPendingFriendRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_bIsOpen) == 0x000085, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue3) == 0x000088, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetQuestManager_ReturnValue) == 0x00008C, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button2) == 0x000090, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Selected) == 0x000094, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_IsValid_ReturnValue) == 0x000095, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue4) == 0x00009C, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetFeatureState_ReturnValue) == 0x0000A0, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetFeatureState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue5) == 0x0000A4, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_CreateDelegate_OutputDelegate5) == 0x0000A8, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, Temp_text_Variable2) == 0x0000B8, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_EventSource2) == 0x0000C4, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_EventSource2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_EventFocus2) == 0x0000C8, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_ClientEvent2) == 0x0000CC, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_ClientEvent2' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_EventSource) == 0x0000E4, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_EventFocus) == 0x0000E8, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_HandleClientEvent_ClientEvent) == 0x0000EC, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000104, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetOwningPlayer_ReturnValue) == 0x000108, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_DynamicCast_AsUIManager) == 0x00010C, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_Create_ReturnValue) == 0x000114, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, Temp_text_Variable3) == 0x000118, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, CallFunc_GetContext_ReturnValue6) == 0x000124, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls, K2Node_Select_Default) == 0x000128, "Member 'TopLevel_TabControls_C_ExecuteUbergraph_TopLevel_TabControls::K2Node_Select_Default' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.HandleClientEvent_OpenNewsScreen
// 0x0020 (0x0020 - 0x0000)
struct TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen");
static_assert(sizeof(TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen) == 0x000020, "Wrong size on TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen, EventSource) == 0x000000, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen::EventSource' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen, EventFocus) == 0x000004, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen::EventFocus' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen, ClientEvent) == 0x000008, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenNewsScreen::ClientEvent' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.HandleClientEvent_OpenQuestJournal
// 0x0020 (0x0020 - 0x0000)
struct TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                EventFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal");
static_assert(sizeof(TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal) == 0x000020, "Wrong size on TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal, EventSource) == 0x000000, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal::EventSource' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal, EventFocus) == 0x000004, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal::EventFocus' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal, ClientEvent) == 0x000008, "Member 'TopLevel_TabControls_C_HandleClientEvent_OpenQuestJournal::ClientEvent' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button]Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button]Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'TopLevel_TabControls_C_BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Menu Anchor] Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button] Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button] Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SELECTED;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong size on TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature, SELECTED) == 0x000004, "Member 'TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature::SELECTED' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button] Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Button] Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature) == 0x000004, "Wrong size on TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[Menu Anchor] Friends List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.BndEvt__[MenuAnchor] Main Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'TopLevel_TabControls_C_BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.HandlePartyTransitionStarted
// 0x0001 (0x0001 - 0x0000)
struct TopLevel_TabControls_C_HandlePartyTransitionStarted final
{
public:
	EFortPartyTransition                          PartyTransition;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_HandlePartyTransitionStarted) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_HandlePartyTransitionStarted");
static_assert(sizeof(TopLevel_TabControls_C_HandlePartyTransitionStarted) == 0x000001, "Wrong size on TopLevel_TabControls_C_HandlePartyTransitionStarted");
static_assert(offsetof(TopLevel_TabControls_C_HandlePartyTransitionStarted, PartyTransition) == 0x000000, "Member 'TopLevel_TabControls_C_HandlePartyTransitionStarted::PartyTransition' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.HandlePartyTransitionComplete
// 0x0001 (0x0001 - 0x0000)
struct TopLevel_TabControls_C_HandlePartyTransitionComplete final
{
public:
	EFortPartyTransition                          PartyTransition;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_HandlePartyTransitionComplete) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_HandlePartyTransitionComplete");
static_assert(sizeof(TopLevel_TabControls_C_HandlePartyTransitionComplete) == 0x000001, "Wrong size on TopLevel_TabControls_C_HandlePartyTransitionComplete");
static_assert(offsetof(TopLevel_TabControls_C_HandlePartyTransitionComplete, PartyTransition) == 0x000000, "Member 'TopLevel_TabControls_C_HandlePartyTransitionComplete::PartyTransition' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.OnSocialUpdate
// 0x000C (0x000C - 0x0000)
struct TopLevel_TabControls_C_OnSocialUpdate final
{
public:
	TArray<class UFortSocialItem*>                SocialItems;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(TopLevel_TabControls_C_OnSocialUpdate) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_OnSocialUpdate");
static_assert(sizeof(TopLevel_TabControls_C_OnSocialUpdate) == 0x00000C, "Wrong size on TopLevel_TabControls_C_OnSocialUpdate");
static_assert(offsetof(TopLevel_TabControls_C_OnSocialUpdate, SocialItems) == 0x000000, "Member 'TopLevel_TabControls_C_OnSocialUpdate::SocialItems' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.On Social Feature Changed_Copy
// 0x0002 (0x0002 - 0x0000)
struct TopLevel_TabControls_C_On_Social_Feature_Changed_Copy final
{
public:
	EFortUIFeature                                ChangedFeature;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           NewState;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_On_Social_Feature_Changed_Copy) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_On_Social_Feature_Changed_Copy");
static_assert(sizeof(TopLevel_TabControls_C_On_Social_Feature_Changed_Copy) == 0x000002, "Wrong size on TopLevel_TabControls_C_On_Social_Feature_Changed_Copy");
static_assert(offsetof(TopLevel_TabControls_C_On_Social_Feature_Changed_Copy, ChangedFeature) == 0x000000, "Member 'TopLevel_TabControls_C_On_Social_Feature_Changed_Copy::ChangedFeature' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_On_Social_Feature_Changed_Copy, NewState) == 0x000001, "Member 'TopLevel_TabControls_C_On_Social_Feature_Changed_Copy::NewState' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.OnHandleAction
// 0x0194 (0x0194 - 0x0000)
struct TopLevel_TabControls_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x0060)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldCloseMenuOnEscape_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x006C(0x0060)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00CC(0x0060)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x012C(0x0060)()
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldPassThrough;                                 // 0x018F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Handled;                                           // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_OnHandleAction) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_OnHandleAction");
static_assert(sizeof(TopLevel_TabControls_C_OnHandleAction) == 0x000194, "Wrong size on TopLevel_TabControls_C_OnHandleAction");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, Result) == 0x000000, "Member 'TopLevel_TabControls_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, bPassThrough) == 0x000060, "Member 'TopLevel_TabControls_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, Temp_bool_Variable) == 0x000061, "Member 'TopLevel_TabControls_C_OnHandleAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_GetContext_ReturnValue) == 0x000064, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_ShouldCloseMenuOnEscape_ReturnValue) == 0x000068, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_ShouldCloseMenuOnEscape_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_Unhandled_ReturnValue) == 0x00006C, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x0000CC, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, K2Node_Select_Default) == 0x00012C, "Member 'TopLevel_TabControls_C_OnHandleAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_IsOpen_ReturnValue) == 0x00018C, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_BooleanAND_ReturnValue) == 0x00018D, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, CallFunc_IsValid_ReturnValue) == 0x00018E, "Member 'TopLevel_TabControls_C_OnHandleAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, ShouldPassThrough) == 0x00018F, "Member 'TopLevel_TabControls_C_OnHandleAction::ShouldPassThrough' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnHandleAction, Handled) == 0x000190, "Member 'TopLevel_TabControls_C_OnHandleAction::Handled' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.OnGetFriendsList
// 0x0010 (0x0010 - 0x0000)
struct TopLevel_TabControls_C_OnGetFriendsList final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USlateContentCalloutMenu_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USizeBox*                               CallFunc_Get_Size_Box_Size_Box;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_OnGetFriendsList) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_OnGetFriendsList");
static_assert(sizeof(TopLevel_TabControls_C_OnGetFriendsList) == 0x000010, "Wrong size on TopLevel_TabControls_C_OnGetFriendsList");
static_assert(offsetof(TopLevel_TabControls_C_OnGetFriendsList, ReturnValue) == 0x000000, "Member 'TopLevel_TabControls_C_OnGetFriendsList::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetFriendsList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000004, "Member 'TopLevel_TabControls_C_OnGetFriendsList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetFriendsList, CallFunc_Create_ReturnValue) == 0x000008, "Member 'TopLevel_TabControls_C_OnGetFriendsList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetFriendsList, CallFunc_Get_Size_Box_Size_Box) == 0x00000C, "Member 'TopLevel_TabControls_C_OnGetFriendsList::CallFunc_Get_Size_Box_Size_Box' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.OnGetMainMenu
// 0x001C (0x001C - 0x0000)
struct TopLevel_TabControls_C_OnGetMainMenu final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UTopLevelRibbon_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_OnGetMainMenu) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_OnGetMainMenu");
static_assert(sizeof(TopLevel_TabControls_C_OnGetMainMenu) == 0x00001C, "Wrong size on TopLevel_TabControls_C_OnGetMainMenu");
static_assert(offsetof(TopLevel_TabControls_C_OnGetMainMenu, ReturnValue) == 0x000000, "Member 'TopLevel_TabControls_C_OnGetMainMenu::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetMainMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000004, "Member 'TopLevel_TabControls_C_OnGetMainMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TopLevel_TabControls_C_OnGetMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetMainMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'TopLevel_TabControls_C_OnGetMainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.HandleMenuAnchorChanged
// 0x0010 (0x0010 - 0x0000)
struct TopLevel_TabControls_C_HandleMenuAnchorChanged final
{
public:
	class UButtonIconText_C*                      Menu_Button;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Is_Open;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTutorialContext*                   CallFunc_GetContext_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_HandleMenuAnchorChanged) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_HandleMenuAnchorChanged");
static_assert(sizeof(TopLevel_TabControls_C_HandleMenuAnchorChanged) == 0x000010, "Wrong size on TopLevel_TabControls_C_HandleMenuAnchorChanged");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, Menu_Button) == 0x000000, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::Menu_Button' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, Is_Open) == 0x000004, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::Is_Open' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000006, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_GetSelected_ReturnValue) == 0x000007, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_HandleMenuAnchorChanged, CallFunc_GetContext_ReturnValue) == 0x00000C, "Member 'TopLevel_TabControls_C_HandleMenuAnchorChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.UpdateFriendButtonState
// 0x0002 (0x0002 - 0x0000)
struct TopLevel_TabControls_C_UpdateFriendButtonState final
{
public:
	EFortUIFeatureState                           FeatureState;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_UpdateFriendButtonState) == 0x000001, "Wrong alignment on TopLevel_TabControls_C_UpdateFriendButtonState");
static_assert(sizeof(TopLevel_TabControls_C_UpdateFriendButtonState) == 0x000002, "Wrong size on TopLevel_TabControls_C_UpdateFriendButtonState");
static_assert(offsetof(TopLevel_TabControls_C_UpdateFriendButtonState, FeatureState) == 0x000000, "Member 'TopLevel_TabControls_C_UpdateFriendButtonState::FeatureState' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_UpdateFriendButtonState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'TopLevel_TabControls_C_UpdateFriendButtonState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TopLevel-TabControls.TopLevel-TabControls_C.OnGetJournal
// 0x000C (0x000C - 0x0000)
struct TopLevel_TabControls_C_OnGetJournal final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJournalWidget_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopLevel_TabControls_C_OnGetJournal) == 0x000004, "Wrong alignment on TopLevel_TabControls_C_OnGetJournal");
static_assert(sizeof(TopLevel_TabControls_C_OnGetJournal) == 0x00000C, "Wrong size on TopLevel_TabControls_C_OnGetJournal");
static_assert(offsetof(TopLevel_TabControls_C_OnGetJournal, ReturnValue) == 0x000000, "Member 'TopLevel_TabControls_C_OnGetJournal::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopLevel_TabControls_C_OnGetJournal, CallFunc_GetOwningPlayer_ReturnValue) == 0x000004, "Member 'TopLevel_TabControls_C_OnGetJournal::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
