#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopLevelRibbon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass TopLevelRibbon.TopLevelRibbon_C
// 0x003C (0x0280 - 0x0244)
class UTopLevelRibbon_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0244(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonIconText_C*                      _Button__Feedback;                                 // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button__Log_Out;                                  // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button__Options;                                  // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      _Button__Quit;                                     // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 _Image__Switch_Action;                             // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVerticalBox*                           _Vertical_Box__FrontEnd_Options;                   // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ULeaveButton_C*                         ButtonLeave;                                       // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_234;                                         // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonIconText_C*                      News_Button;                                       // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOutpost_CanEditPanel_C*                Outpost_CanEditPanel;                              // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOverlay*                               OutpostSettings_Overlay;                           // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	UMulticastDelegateProperty_                   OnClosed;                                          // 0x0274(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_TopLevelRibbon(int32 EntryPoint);
	void BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_632_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void OnLeaveClicked();
	void BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_2469_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Button__Quit_K2Node_ComponentBoundEvent_2092_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Button__Log_Out_K2Node_ComponentBoundEvent_2079_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt___Button__Feedback_K2Node_ComponentBoundEvent_1732_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void Construct();
	void OnConfirmed_5265A9FE464FA87840004EB001876A10();
	void OnDeclined_5265A9FE464FA87840004EB001876A10();
	void OnTimedOut_5265A9FE464FA87840004EB001876A10();
	void OnConfirmed_79E55F534B88358E4441C485A4E14D6E();
	void OnDeclined_79E55F534B88358E4441C485A4E14D6E();
	void OnTimedOut_79E55F534B88358E4441C485A4E14D6E();
	void LeavePartyAndGame();
	void ShowGameOptions();
	void ShowFeedback();
	void ShowRateExperience();
	void BindDelegates();
	void GetFrontEndOptionsVisibility(ESlateVisibility* Visibility_0);
	void SetupButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopLevelRibbon_C">();
	}
	static class UTopLevelRibbon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopLevelRibbon_C>();
	}
};
static_assert(alignof(UTopLevelRibbon_C) == 0x000004, "Wrong alignment on UTopLevelRibbon_C");
static_assert(sizeof(UTopLevelRibbon_C) == 0x000280, "Wrong size on UTopLevelRibbon_C");
static_assert(offsetof(UTopLevelRibbon_C, UberGraphFrame) == 0x000244, "Member 'UTopLevelRibbon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Button__Feedback) == 0x000248, "Member 'UTopLevelRibbon_C::_Button__Feedback' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Button__Log_Out) == 0x00024C, "Member 'UTopLevelRibbon_C::_Button__Log_Out' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Button__Options) == 0x000250, "Member 'UTopLevelRibbon_C::_Button__Options' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Button__Quit) == 0x000254, "Member 'UTopLevelRibbon_C::_Button__Quit' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Image__Switch_Action) == 0x000258, "Member 'UTopLevelRibbon_C::_Image__Switch_Action' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, _Vertical_Box__FrontEnd_Options) == 0x00025C, "Member 'UTopLevelRibbon_C::_Vertical_Box__FrontEnd_Options' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, ButtonLeave) == 0x000260, "Member 'UTopLevelRibbon_C::ButtonLeave' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, Image_234) == 0x000264, "Member 'UTopLevelRibbon_C::Image_234' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, News_Button) == 0x000268, "Member 'UTopLevelRibbon_C::News_Button' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, Outpost_CanEditPanel) == 0x00026C, "Member 'UTopLevelRibbon_C::Outpost_CanEditPanel' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, OutpostSettings_Overlay) == 0x000270, "Member 'UTopLevelRibbon_C::OutpostSettings_Overlay' has a wrong offset!");
static_assert(offsetof(UTopLevelRibbon_C, OnClosed) == 0x000274, "Member 'UTopLevelRibbon_C::OnClosed' has a wrong offset!");

}

#pragma pack(pop)
