#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TracerGeneric

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TracerGeneric.TracerGeneric_C.ExecuteUbergraph_TracerGeneric
// 0x0020 (0x0020 - 0x0000)
struct TracerGeneric_C_ExecuteUbergraph_TracerGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Distance;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric) == 0x000004, "Wrong alignment on TracerGeneric_C_ExecuteUbergraph_TracerGeneric");
static_assert(sizeof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric) == 0x000020, "Wrong size on TracerGeneric_C_ExecuteUbergraph_TracerGeneric");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, EntryPoint) == 0x000000, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, K2Node_Event_Distance) == 0x000004, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::K2Node_Event_Distance' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000008, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x00000C, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000015, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_NormalizeToRange_ReturnValue) == 0x000018, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_ExecuteUbergraph_TracerGeneric, CallFunc_Lerp_ReturnValue) == 0x00001C, "Member 'TracerGeneric_C_ExecuteUbergraph_TracerGeneric::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function TracerGeneric.TracerGeneric_C.OnInitTracerDistance
// 0x0004 (0x0004 - 0x0000)
struct TracerGeneric_C_OnInitTracerDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TracerGeneric_C_OnInitTracerDistance) == 0x000004, "Wrong alignment on TracerGeneric_C_OnInitTracerDistance");
static_assert(sizeof(TracerGeneric_C_OnInitTracerDistance) == 0x000004, "Wrong size on TracerGeneric_C_OnInitTracerDistance");
static_assert(offsetof(TracerGeneric_C_OnInitTracerDistance, Distance) == 0x000000, "Member 'TracerGeneric_C_OnInitTracerDistance::Distance' has a wrong offset!");

// Function TracerGeneric.TracerGeneric_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct TracerGeneric_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(TracerGeneric_C_UserConstructionScript) == 0x000004, "Wrong alignment on TracerGeneric_C_UserConstructionScript");
static_assert(sizeof(TracerGeneric_C_UserConstructionScript) == 0x000094, "Wrong size on TracerGeneric_C_UserConstructionScript");
static_assert(offsetof(TracerGeneric_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'TracerGeneric_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'TracerGeneric_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'TracerGeneric_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TracerGeneric_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'TracerGeneric_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

#pragma pack(pop)
