#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TracerGeneric

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass TracerGeneric.TracerGeneric_C
// 0x0014 (0x02B8 - 0x02A4)
class ATracerGeneric_C : public AFortTracerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A4(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Speed_Mult;                                        // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Speed_Mult_StartDist;                              // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Speed_Mult_EndDist;                                // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxSpeed_Mult;                                     // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TracerGeneric(int32 EntryPoint);
	void OnInitTracerDistance(float Distance);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TracerGeneric_C">();
	}
	static class ATracerGeneric_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATracerGeneric_C>();
	}
};
static_assert(alignof(ATracerGeneric_C) == 0x000004, "Wrong alignment on ATracerGeneric_C");
static_assert(sizeof(ATracerGeneric_C) == 0x0002B8, "Wrong size on ATracerGeneric_C");
static_assert(offsetof(ATracerGeneric_C, UberGraphFrame) == 0x0002A4, "Member 'ATracerGeneric_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATracerGeneric_C, Speed_Mult) == 0x0002A8, "Member 'ATracerGeneric_C::Speed_Mult' has a wrong offset!");
static_assert(offsetof(ATracerGeneric_C, Speed_Mult_StartDist) == 0x0002AC, "Member 'ATracerGeneric_C::Speed_Mult_StartDist' has a wrong offset!");
static_assert(offsetof(ATracerGeneric_C, Speed_Mult_EndDist) == 0x0002B0, "Member 'ATracerGeneric_C::Speed_Mult_EndDist' has a wrong offset!");
static_assert(offsetof(ATracerGeneric_C, MaxSpeed_Mult) == 0x0002B4, "Member 'ATracerGeneric_C::MaxSpeed_Mult' has a wrong offset!");

}

#pragma pack(pop)
