#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Spikes_Wood

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C.ExecuteUbergraph_Trap_Floor_Spikes_Wood
// 0x00D0 (0x00D0 - 0x0000)
struct Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0008(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood) == 0x000004, "Wrong alignment on Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood");
static_assert(sizeof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood) == 0x0000D0, "Wrong size on Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, EntryPoint) == 0x000000, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, K2Node_GameplayCueEvent_EventType) == 0x000004, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, K2Node_GameplayCueEvent_Parameters) == 0x000008, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, K2Node_SwitchEnum_CmpSuccess) == 0x00008C, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, Temp_bool_Has_Been_Initd_Variable) == 0x00009C, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000A0, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0000AC, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000B8, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000BC, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000C8, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood, Temp_bool_IsClosed_Variable) == 0x0000CC, "Member 'Trap_Floor_Spikes_Wood_C_ExecuteUbergraph_Trap_Floor_Spikes_Wood::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Floor_Spikes_Wood_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

}

#pragma pack(pop)
