#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Spikes_Wood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C
// 0x0020 (0x0A10 - 0x09F0)
class ATrap_Floor_Spikes_Wood_C final : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Trigger;                                           // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x09FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Reload_Sound;                                      // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Floor_Spikes_Wood(int32 EntryPoint);
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnOutOfDurability();
	void OnFinishedBuilding();
	void OnPlaced();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_Spikes_Wood_C">();
	}
	static class ATrap_Floor_Spikes_Wood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_Spikes_Wood_C>();
	}
};
static_assert(alignof(ATrap_Floor_Spikes_Wood_C) == 0x000004, "Wrong alignment on ATrap_Floor_Spikes_Wood_C");
static_assert(sizeof(ATrap_Floor_Spikes_Wood_C) == 0x000A10, "Wrong size on ATrap_Floor_Spikes_Wood_C");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Floor_Spikes_Wood_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Trigger) == 0x0009F4, "Member 'ATrap_Floor_Spikes_Wood_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Root) == 0x0009F8, "Member 'ATrap_Floor_Spikes_Wood_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Place_Trap_Sound) == 0x0009FC, "Member 'ATrap_Floor_Spikes_Wood_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Trap_Active_Sound) == 0x000A00, "Member 'ATrap_Floor_Spikes_Wood_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Trap_Fire_Sound) == 0x000A04, "Member 'ATrap_Floor_Spikes_Wood_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Reload_Sound) == 0x000A08, "Member 'ATrap_Floor_Spikes_Wood_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Spikes_Wood_C, Trap_Explode_Sound) == 0x000A0C, "Member 'ATrap_Floor_Spikes_Wood_C::Trap_Explode_Sound' has a wrong offset!");

}

#pragma pack(pop)
