#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Launcher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Floor_Launcher.Trap_Floor_Launcher_C.ExecuteUbergraph_Trap_Floor_Launcher
// 0x0160 (0x0160 - 0x0000)
struct Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0008(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCenter_ReturnValue;                    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher) == 0x000010, "Wrong alignment on Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher");
static_assert(sizeof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher) == 0x000160, "Wrong size on Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, EntryPoint) == 0x000000, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, K2Node_GameplayCueEvent_EventType) == 0x000004, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, K2Node_GameplayCueEvent_Parameters) == 0x000008, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, K2Node_SwitchEnum_CmpSuccess) == 0x00008C, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00009C, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0000A8, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0000B4, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0000C0, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000CC, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D0, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000DC, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_GetCenter_ReturnValue) == 0x0000E0, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_GetCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x0000EC, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x0000F8, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000100, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_BreakTransform_Location) == 0x000130, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_BreakTransform_Rotation) == 0x00013C, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher, CallFunc_BreakTransform_Scale) == 0x000148, "Member 'Trap_Floor_Launcher_C_ExecuteUbergraph_Trap_Floor_Launcher::CallFunc_BreakTransform_Scale' has a wrong offset!");

// Function Trap_Floor_Launcher.Trap_Floor_Launcher_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Floor_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Launcher.Trap_Floor_Launcher_C.SetFloorPosition
// 0x009C (0x009C - 0x0000)
struct Trap_Floor_Launcher_C_SetFloorPosition final
{
public:
	float                                         NewFloorPosition;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x001C(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Launcher_C_SetFloorPosition) == 0x000004, "Wrong alignment on Trap_Floor_Launcher_C_SetFloorPosition");
static_assert(sizeof(Trap_Floor_Launcher_C_SetFloorPosition) == 0x00009C, "Wrong size on Trap_Floor_Launcher_C_SetFloorPosition");
static_assert(offsetof(Trap_Floor_Launcher_C_SetFloorPosition, NewFloorPosition) == 0x000000, "Member 'Trap_Floor_Launcher_C_SetFloorPosition::NewFloorPosition' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_SetFloorPosition, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Trap_Floor_Launcher_C_SetFloorPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_SetFloorPosition, CallFunc_Add_VectorVector_ReturnValue) == 0x000010, "Member 'Trap_Floor_Launcher_C_SetFloorPosition::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Launcher_C_SetFloorPosition, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00001C, "Member 'Trap_Floor_Launcher_C_SetFloorPosition::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

#pragma pack(pop)
