#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_Spikes

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Wall_Spikes.Trap_Wall_Spikes_C.ExecuteUbergraph_Trap_Wall_Spikes
// 0x00E8 (0x00E8 - 0x0000)
struct Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x005C(0x0084)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes) == 0x000004, "Wrong alignment on Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes");
static_assert(sizeof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes) == 0x0000E8, "Wrong size on Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, EntryPoint) == 0x000000, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000018, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000024, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000030, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x00003C, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x000048, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00004C, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, K2Node_GameplayCueEvent_EventType) == 0x000058, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, K2Node_GameplayCueEvent_Parameters) == 0x00005C, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000E0, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes, K2Node_SwitchEnum_CmpSuccess) == 0x0000E4, "Member 'Trap_Wall_Spikes_C_ExecuteUbergraph_Trap_Wall_Spikes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Trap_Wall_Spikes.Trap_Wall_Spikes_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Wall_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

}

#pragma pack(pop)
