#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TVPostProcessBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function TVPostProcessBP.TVPostProcessBP_C.ExecuteUbergraph_TVPostProcessBP
// 0x0100 (0x0100 - 0x0000)
struct TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue5;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue6;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue7;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue2;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue3;     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue4;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue4;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue5;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue6;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue2;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue5;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue6;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue7;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue8;     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R;                             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue9;     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue6;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue3;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_CustomEvent_SequenceName;                   // 0x00EC(0x000C)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue10;    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP) == 0x000004, "Wrong alignment on TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP");
static_assert(sizeof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP) == 0x000100, "Wrong size on TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, EntryPoint) == 0x000000, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue2) == 0x000008, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue3) == 0x00000C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue4) == 0x000010, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue5) == 0x000014, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue6) == 0x000018, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Lerp_ReturnValue7) == 0x00001C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Lerp_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, Temp_bool_IsClosed_Variable2) == 0x000022, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, Temp_bool_Has_Been_Initd_Variable2) == 0x000023, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloat_ReturnValue) == 0x000028, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue) == 0x00002C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000034, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000038, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue2) == 0x00003C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloat_ReturnValue2) == 0x000048, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue3) == 0x00004C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000050, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue2) == 0x000054, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000058, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00005C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000060, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue3) == 0x000064, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue4) == 0x000068, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00006C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloat_ReturnValue3) == 0x000070, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x000074, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue4) == 0x000078, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Conv_BoolToFloat_ReturnValue2) == 0x00007C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Conv_BoolToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000080, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue5) == 0x000084, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000088, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_RandomFloatInRange_ReturnValue6) == 0x00008C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_RandomFloatInRange_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetTimelineLength_ReturnValue) == 0x000090, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetTimelineLength_ReturnValue2) == 0x000094, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetTimelineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue5) == 0x000098, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue6) == 0x00009C, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue7) == 0x0000A0, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue3) == 0x0000A4, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue8) == 0x0000A8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue8' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue4) == 0x0000AC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue5) == 0x0000B0, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_BreakColor_R) == 0x0000B4, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_BreakColor_G) == 0x0000B8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_BreakColor_B) == 0x0000BC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_BreakColor_A) == 0x0000C0, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_FClamp_ReturnValue) == 0x0000C4, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x0000C8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x0000CC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x0000D0, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue9) == 0x0000D4, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue9' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Add_FloatFloat_ReturnValue6) == 0x0000D8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Add_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_FClamp_ReturnValue2) == 0x0000DC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_FFloor_ReturnValue) == 0x0000E0, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000E4, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_Not_PreBool_ReturnValue) == 0x0000E5, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_BooleanAND_ReturnValue) == 0x0000E6, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetTimelineLength_ReturnValue3) == 0x0000E8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetTimelineLength_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, K2Node_CustomEvent_SequenceName) == 0x0000EC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::K2Node_CustomEvent_SequenceName' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0000F8, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_GetScalarParameterValue_ReturnValue10) == 0x0000FC, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_GetScalarParameterValue_ReturnValue10' has a wrong offset!");

// Function TVPostProcessBP.TVPostProcessBP_C.SequenceFinished
// 0x000C (0x000C - 0x0000)
struct TVPostProcessBP_C_SequenceFinished final
{
public:
	class FString                                 SequenceName;                                      // 0x0000(0x000C)(Parm, ZeroConstructor)
};
static_assert(alignof(TVPostProcessBP_C_SequenceFinished) == 0x000004, "Wrong alignment on TVPostProcessBP_C_SequenceFinished");
static_assert(sizeof(TVPostProcessBP_C_SequenceFinished) == 0x00000C, "Wrong size on TVPostProcessBP_C_SequenceFinished");
static_assert(offsetof(TVPostProcessBP_C_SequenceFinished, SequenceName) == 0x000000, "Member 'TVPostProcessBP_C_SequenceFinished::SequenceName' has a wrong offset!");

// Function TVPostProcessBP.TVPostProcessBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TVPostProcessBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TVPostProcessBP_C_ReceiveTick) == 0x000004, "Wrong alignment on TVPostProcessBP_C_ReceiveTick");
static_assert(sizeof(TVPostProcessBP_C_ReceiveTick) == 0x000004, "Wrong size on TVPostProcessBP_C_ReceiveTick");
static_assert(offsetof(TVPostProcessBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TVPostProcessBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function TVPostProcessBP.TVPostProcessBP_C.RandomizeTheColor
// 0x0060 (0x0060 - 0x0000)
struct TVPostProcessBP_C_RandomizeTheColor final
{
public:
	float                                         Use_Bluescreen;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Probablility_modulator;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Use_Flat_Blue;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MaxColorPerChannelValue;                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Control_replacement_alpha;                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TVPostProcessBP_C_RandomizeTheColor) == 0x000004, "Wrong alignment on TVPostProcessBP_C_RandomizeTheColor");
static_assert(sizeof(TVPostProcessBP_C_RandomizeTheColor) == 0x000060, "Wrong size on TVPostProcessBP_C_RandomizeTheColor");
static_assert(offsetof(TVPostProcessBP_C_RandomizeTheColor, Use_Bluescreen) == 0x000000, "Member 'TVPostProcessBP_C_RandomizeTheColor::Use_Bluescreen' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_RandomizeTheColor, Probablility_modulator) == 0x000004, "Member 'TVPostProcessBP_C_RandomizeTheColor::Probablility_modulator' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_RandomizeTheColor, Use_Flat_Blue) == 0x000008, "Member 'TVPostProcessBP_C_RandomizeTheColor::Use_Flat_Blue' has a wrong offset!");
