#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIManager

#include "Basic.hpp"

#include "ModalQueueEntry_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function UIManager.UIManager_C.ExecuteUbergraph_UIManager
// 0x00A0 (0x00A0 - 0x0000)
struct UIManager_C_ExecuteUbergraph_UIManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIStateWidget*                     K2Node_Event_StateWidget;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortDialogDescription                 K2Node_Event_Description;                          // 0x0010(0x0050)(ConstParm)
	bool                                          K2Node_Event_bDisplay;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortErrorInfo                         K2Node_Event_Info;                                 // 0x006C(0x002C)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ExecuteUbergraph_UIManager) == 0x000004, "Wrong alignment on UIManager_C_ExecuteUbergraph_UIManager");
static_assert(sizeof(UIManager_C_ExecuteUbergraph_UIManager) == 0x0000A0, "Wrong size on UIManager_C_ExecuteUbergraph_UIManager");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, EntryPoint) == 0x000000, "Member 'UIManager_C_ExecuteUbergraph_UIManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_bool_Variable) == 0x000004, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_StateWidget) == 0x000008, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_StateWidget' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_AddChild_ReturnValue) == 0x00000C, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Description) == 0x000010, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Description' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_bDisplay) == 0x000060, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_bDisplay' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_HasAnyChildren_ReturnValue) == 0x000061, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_GetContext_ReturnValue) == 0x000064, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_byte_Variable) == 0x000068, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x000069, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Info) == 0x00006C, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000099, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_byte_Variable2) == 0x00009B, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Select_Default) == 0x00009C, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Select_Default' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayErrorDialog
// 0x002C (0x002C - 0x0000)
struct UIManager_C_DisplayErrorDialog final
{
public:
	struct FFortErrorInfo                         Info;                                              // 0x0000(0x002C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIManager_C_DisplayErrorDialog) == 0x000004, "Wrong alignment on UIManager_C_DisplayErrorDialog");
static_assert(sizeof(UIManager_C_DisplayErrorDialog) == 0x00002C, "Wrong size on UIManager_C_DisplayErrorDialog");
static_assert(offsetof(UIManager_C_DisplayErrorDialog, Info) == 0x000000, "Member 'UIManager_C_DisplayErrorDialog::Info' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayStateContent
// 0x0001 (0x0001 - 0x0000)
struct UIManager_C_DisplayStateContent final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_DisplayStateContent) == 0x000001, "Wrong alignment on UIManager_C_DisplayStateContent");
static_assert(sizeof(UIManager_C_DisplayStateContent) == 0x000001, "Wrong size on UIManager_C_DisplayStateContent");
static_assert(offsetof(UIManager_C_DisplayStateContent, bDisplay) == 0x000000, "Member 'UIManager_C_DisplayStateContent::bDisplay' has a wrong offset!");

// Function UIManager.UIManager_C.OnShowConfirmation
// 0x0050 (0x0050 - 0x0000)
struct UIManager_C_OnShowConfirmation final
{
public:
	struct FFortDialogDescription                 Description;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIManager_C_OnShowConfirmation) == 0x000004, "Wrong alignment on UIManager_C_OnShowConfirmation");
static_assert(sizeof(UIManager_C_OnShowConfirmation) == 0x000050, "Wrong size on UIManager_C_OnShowConfirmation");
static_assert(offsetof(UIManager_C_OnShowConfirmation, Description) == 0x000000, "Member 'UIManager_C_OnShowConfirmation::Description' has a wrong offset!");

// Function UIManager.UIManager_C.UpdateStateWidgetContent
// 0x0004 (0x0004 - 0x0000)
struct UIManager_C_UpdateStateWidgetContent final
{
public:
	class UFortUIStateWidget*                     StateWidget;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_UpdateStateWidgetContent) == 0x000004, "Wrong alignment on UIManager_C_UpdateStateWidgetContent");
static_assert(sizeof(UIManager_C_UpdateStateWidgetContent) == 0x000004, "Wrong size on UIManager_C_UpdateStateWidgetContent");
static_assert(offsetof(UIManager_C_UpdateStateWidgetContent, StateWidget) == 0x000000, "Member 'UIManager_C_UpdateStateWidgetContent::StateWidget' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayOKButtonConfirmation
// 0x0068 (0x0068 - 0x0000)
struct UIManager_C_DisplayOKButtonConfirmation final
{
public:
	class FText                                   Header;                                            // 0x0000(0x000C)(Parm, OutParm, ReferenceParm)
	class FText                                   Message;                                           // 0x000C(0x000C)(Parm, OutParm, ReferenceParm)
	struct FFortDialogDescription                 K2Node_MakeStruct_FortDialogDescription;           // 0x0018(0x0050)()
};
static_assert(alignof(UIManager_C_DisplayOKButtonConfirmation) == 0x000004, "Wrong alignment on UIManager_C_DisplayOKButtonConfirmation");
static_assert(sizeof(UIManager_C_DisplayOKButtonConfirmation) == 0x000068, "Wrong size on UIManager_C_DisplayOKButtonConfirmation");
static_assert(offsetof(UIManager_C_DisplayOKButtonConfirmation, Header) == 0x000000, "Member 'UIManager_C_DisplayOKButtonConfirmation::Header' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayOKButtonConfirmation, Message) == 0x00000C, "Member 'UIManager_C_DisplayOKButtonConfirmation::Message' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayOKButtonConfirmation, K2Node_MakeStruct_FortDialogDescription) == 0x000018, "Member 'UIManager_C_DisplayOKButtonConfirmation::K2Node_MakeStruct_FortDialogDescription' has a wrong offset!");

// Function UIManager.UIManager_C.ShowActionPanelInModalLayer
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_ShowActionPanelInModalLayer final
{
public:
	class UFortActionHandlerPanel*                InActionHandlerPanel;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ShowActionPanelInModalLayer) == 0x000004, "Wrong alignment on UIManager_C_ShowActionPanelInModalLayer");
static_assert(sizeof(UIManager_C_ShowActionPanelInModalLayer) == 0x000008, "Wrong size on UIManager_C_ShowActionPanelInModalLayer");
static_assert(offsetof(UIManager_C_ShowActionPanelInModalLayer, InActionHandlerPanel) == 0x000000, "Member 'UIManager_C_ShowActionPanelInModalLayer::InActionHandlerPanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowActionPanelInModalLayer, InHorizontalAlignment) == 0x000004, "Member 'UIManager_C_ShowActionPanelInModalLayer::InHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowActionPanelInModalLayer, InVerticalAlignment) == 0x000005, "Member 'UIManager_C_ShowActionPanelInModalLayer::InVerticalAlignment' has a wrong offset!");

// Function UIManager.UIManager_C.ClearLayers
// 0x0004 (0x0004 - 0x0000)
struct UIManager_C_ClearLayers final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ClearLayers) == 0x000004, "Wrong alignment on UIManager_C_ClearLayers");
static_assert(sizeof(UIManager_C_ClearLayers) == 0x000004, "Wrong size on UIManager_C_ClearLayers");
static_assert(offsetof(UIManager_C_ClearLayers, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'UIManager_C_ClearLayers::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.QueueActionPanelInModalLayer
// 0x001C (0x001C - 0x0000)
struct UIManager_C_QueueActionPanelInModalLayer final
{
public:
	class UFortActionHandlerPanel*                InActionHandlerPanel;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModalQueueEntry                       K2Node_MakeStruct_ModalQueueEntry;                 // 0x0008(0x0008)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStateContentChildShowing_ReturnValue;   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_QueueActionPanelInModalLayer) == 0x000004, "Wrong alignment on UIManager_C_QueueActionPanelInModalLayer");
static_assert(sizeof(UIManager_C_QueueActionPanelInModalLayer) == 0x00001C, "Wrong size on UIManager_C_QueueActionPanelInModalLayer");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, InActionHandlerPanel) == 0x000000, "Member 'UIManager_C_QueueActionPanelInModalLayer::InActionHandlerPanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, InHorizontalAlignment) == 0x000004, "Member 'UIManager_C_QueueActionPanelInModalLayer::InHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, InVerticalAlignment) == 0x000005, "Member 'UIManager_C_QueueActionPanelInModalLayer::InVerticalAlignment' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, K2Node_MakeStruct_ModalQueueEntry) == 0x000008, "Member 'UIManager_C_QueueActionPanelInModalLayer::K2Node_MakeStruct_ModalQueueEntry' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UIManager_C_QueueActionPanelInModalLayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, CallFunc_IsStateContentChildShowing_ReturnValue) == 0x000014, "Member 'UIManager_C_QueueActionPanelInModalLayer::CallFunc_IsStateContentChildShowing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'UIManager_C_QueueActionPanelInModalLayer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'UIManager_C_QueueActionPanelInModalLayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueActionPanelInModalLayer, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'UIManager_C_QueueActionPanelInModalLayer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.ShowNextModalWidget
// 0x0018 (0x0018 - 0x0000)
struct UIManager_C_ShowNextModalWidget final
{
public:
	struct FModalQueueEntry                       CallFunc_Array_Get_Item;                           // 0x0000(0x0008)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModalQueueEntry                       QueueEntry;                                        // 0x0010(0x0008)(Edit)
};
static_assert(alignof(UIManager_C_ShowNextModalWidget) == 0x000004, "Wrong alignment on UIManager_C_ShowNextModalWidget");
static_assert(sizeof(UIManager_C_ShowNextModalWidget) == 0x000018, "Wrong size on UIManager_C_ShowNextModalWidget");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Array_Get_Item) == 0x000000, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, QueueEntry) == 0x000010, "Member 'UIManager_C_ShowNextModalWidget::QueueEntry' has a wrong offset!");

// Function UIManager.UIManager_C.BindDelegates
// 0x0048 (0x0048 - 0x0000)
struct UIManager_C_BindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FText& Header, const class FText& Message)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UWidget* WebWidget, const class FString& OfferId)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_BindDelegates) == 0x000004, "Wrong alignment on UIManager_C_BindDelegates");
static_assert(sizeof(UIManager_C_BindDelegates) == 0x000048, "Wrong size on UIManager_C_BindDelegates");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'UIManager_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate3) == 0x000024, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate4) == 0x000034, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, CallFunc_GetContext_ReturnValue2) == 0x000044, "Member 'UIManager_C_BindDelegates::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayPurchaseWidget
// 0x001C (0x001C - 0x0000)
struct UIManager_C_DisplayPurchaseWidget final
{
public:
	class UWidget*                                Web_Widget;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 OfferId;                                           // 0x0004(0x000C)(Parm, ZeroConstructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenWebPayment_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_DisplayPurchaseWidget) == 0x000004, "Wrong alignment on UIManager_C_DisplayPurchaseWidget");
static_assert(sizeof(UIManager_C_DisplayPurchaseWidget) == 0x00001C, "Wrong size on UIManager_C_DisplayPurchaseWidget");
static_assert(offsetof(UIManager_C_DisplayPurchaseWidget, Web_Widget) == 0x000000, "Member 'UIManager_C_DisplayPurchaseWidget::Web_Widget' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayPurchaseWidget, OfferId) == 0x000004, "Member 'UIManager_C_DisplayPurchaseWidget::OfferId' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayPurchaseWidget, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'UIManager_C_DisplayPurchaseWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayPurchaseWidget, CallFunc_OpenWebPayment_ReturnValue) == 0x000014, "Member 'UIManager_C_DisplayPurchaseWidget::CallFunc_OpenWebPayment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayPurchaseWidget, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'UIManager_C_DisplayPurchaseWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.DismissPurchaseWidget
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_DismissPurchaseWidget final
{
public:
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExitWebPayment_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_DismissPurchaseWidget) == 0x000004, "Wrong alignment on UIManager_C_DismissPurchaseWidget");
static_assert(sizeof(UIManager_C_DismissPurchaseWidget) == 0x000008, "Wrong size on UIManager_C_DismissPurchaseWidget");
static_assert(offsetof(UIManager_C_DismissPurchaseWidget, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'UIManager_C_DismissPurchaseWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DismissPurchaseWidget, CallFunc_ExitWebPayment_ReturnValue) == 0x000004, "Member 'UIManager_C_DismissPurchaseWidget::CallFunc_ExitWebPayment_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.IsStateContentChildShowing
// 0x0010 (0x0010 - 0x0000)
struct UIManager_C_IsStateContentChildShowing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_IsStateContentChildShowing) == 0x000004, "Wrong alignment on UIManager_C_IsStateContentChildShowing");
static_assert(sizeof(UIManager_C_IsStateContentChildShowing) == 0x000010, "Wrong size on UIManager_C_IsStateContentChildShowing");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, ReturnValue) == 0x000000, "Member 'UIManager_C_IsStateContentChildShowing::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_IsVisible_ReturnValue) == 0x00000D, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.HandleModalContentCleared
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_HandleModalContentCleared final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_HandleModalContentCleared) == 0x000004, "Wrong alignment on UIManager_C_HandleModalContentCleared");
static_assert(sizeof(UIManager_C_HandleModalContentCleared) == 0x000008, "Wrong size on UIManager_C_HandleModalContentCleared");
static_assert(offsetof(UIManager_C_HandleModalContentCleared, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'UIManager_C_HandleModalContentCleared::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleModalContentCleared, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'UIManager_C_HandleModalContentCleared::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
