#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class UMG.AsyncTaskDownloadImage
// 0x0018 (0x0034 - 0x001C)
class UAsyncTaskDownloadImage final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x001C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFail;                                            // 0x0028(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAsyncTaskDownloadImage* DownloadImage(const class FString& URL);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncTaskDownloadImage">();
	}
	static class UAsyncTaskDownloadImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskDownloadImage>();
	}
};
static_assert(alignof(UAsyncTaskDownloadImage) == 0x000004, "Wrong alignment on UAsyncTaskDownloadImage");
static_assert(sizeof(UAsyncTaskDownloadImage) == 0x000034, "Wrong size on UAsyncTaskDownloadImage");
static_assert(offsetof(UAsyncTaskDownloadImage, OnSuccess) == 0x00001C, "Member 'UAsyncTaskDownloadImage::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAsyncTaskDownloadImage, OnFail) == 0x000028, "Member 'UAsyncTaskDownloadImage::OnFail' has a wrong offset!");

// Class UMG.DragDropOperation
// 0x0044 (0x0060 - 0x001C)
class UDragDropOperation final : public UObject
{
public:
	class FString                                 Tag;                                               // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Payload;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                DefaultDragVisual;                                 // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDragPivot                                    Pivot;                                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDrop;                                            // 0x003C(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDragCancelled;                                   // 0x0048(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDragged;                                         // 0x0054(0x000C)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void DragCancelled(const struct FPointerEvent& PointerEvent);
	void Dragged(const struct FPointerEvent& PointerEvent);
	void Drop(const struct FPointerEvent& PointerEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DragDropOperation">();
	}
	static class UDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragDropOperation>();
	}
};
static_assert(alignof(UDragDropOperation) == 0x000004, "Wrong alignment on UDragDropOperation");
static_assert(sizeof(UDragDropOperation) == 0x000060, "Wrong size on UDragDropOperation");
static_assert(offsetof(UDragDropOperation, Tag) == 0x00001C, "Member 'UDragDropOperation::Tag' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, Payload) == 0x000028, "Member 'UDragDropOperation::Payload' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, DefaultDragVisual) == 0x00002C, "Member 'UDragDropOperation::DefaultDragVisual' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, Pivot) == 0x000030, "Member 'UDragDropOperation::Pivot' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, Offset) == 0x000034, "Member 'UDragDropOperation::Offset' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, OnDrop) == 0x00003C, "Member 'UDragDropOperation::OnDrop' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, OnDragCancelled) == 0x000048, "Member 'UDragDropOperation::OnDragCancelled' has a wrong offset!");
static_assert(offsetof(UDragDropOperation, OnDragged) == 0x000054, "Member 'UDragDropOperation::OnDragged' has a wrong offset!");

// Class UMG.MovieScene2DTransformSection
// 0x0250 (0x0280 - 0x0030)
class UMovieScene2DTransformSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             Translation[0x2];                                  // 0x0034(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             Rotation;                                          // 0x00DC(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             Scale[0x2];                                        // 0x0130(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             Shear[0x2];                                        // 0x01D8(0x0054)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene2DTransformSection">();
	}
	static class UMovieScene2DTransformSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene2DTransformSection>();
	}
};
static_assert(alignof(UMovieScene2DTransformSection) == 0x000004, "Wrong alignment on UMovieScene2DTransformSection");
static_assert(sizeof(UMovieScene2DTransformSection) == 0x000280, "Wrong size on UMovieScene2DTransformSection");
static_assert(offsetof(UMovieScene2DTransformSection, Translation) == 0x000034, "Member 'UMovieScene2DTransformSection::Translation' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Rotation) == 0x0000DC, "Member 'UMovieScene2DTransformSection::Rotation' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Scale) == 0x000130, "Member 'UMovieScene2DTransformSection::Scale' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Shear) == 0x0001D8, "Member 'UMovieScene2DTransformSection::Shear' has a wrong offset!");

// Class UMG.MovieScene2DTransformTrack
// 0x0000 (0x003C - 0x003C)
class UMovieScene2DTransformTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene2DTransformTrack">();
	}
	static class UMovieScene2DTransformTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene2DTransformTrack>();
	}
};
static_assert(alignof(UMovieScene2DTransformTrack) == 0x000004, "Wrong alignment on UMovieScene2DTransformTrack");
static_assert(sizeof(UMovieScene2DTransformTrack) == 0x00003C, "Wrong size on UMovieScene2DTransformTrack");

// Class UMG.MovieSceneMarginSection
// 0x0154 (0x0184 - 0x0030)
class UMovieSceneMarginSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             TopCurve;                                          // 0x0034(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             LeftCurve;                                         // 0x0088(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             RightCurve;                                        // 0x00DC(0x0054)(NativeAccessSpecifierPrivate)
	struct FRichCurve                             BottomCurve;                                       // 0x0130(0x0054)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMarginSection">();
	}
	static class UMovieSceneMarginSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMarginSection>();
	}
};
static_assert(alignof(UMovieSceneMarginSection) == 0x000004, "Wrong alignment on UMovieSceneMarginSection");
static_assert(sizeof(UMovieSceneMarginSection) == 0x000184, "Wrong size on UMovieSceneMarginSection");
static_assert(offsetof(UMovieSceneMarginSection, TopCurve) == 0x000034, "Member 'UMovieSceneMarginSection::TopCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, LeftCurve) == 0x000088, "Member 'UMovieSceneMarginSection::LeftCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, RightCurve) == 0x0000DC, "Member 'UMovieSceneMarginSection::RightCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, BottomCurve) == 0x000130, "Member 'UMovieSceneMarginSection::BottomCurve' has a wrong offset!");

// Class UMG.MovieSceneMarginTrack
// 0x0000 (0x003C - 0x003C)
class UMovieSceneMarginTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMarginTrack">();
	}
	static class UMovieSceneMarginTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMarginTrack>();
	}
};
static_assert(alignof(UMovieSceneMarginTrack) == 0x000004, "Wrong alignment on UMovieSceneMarginTrack");
static_assert(sizeof(UMovieSceneMarginTrack) == 0x00003C, "Wrong size on UMovieSceneMarginTrack");

// Class UMG.NamedSlotInterface
// 0x0000 (0x001C - 0x001C)
class INamedSlotInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NamedSlotInterface">();
	}
	static class INamedSlotInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INamedSlotInterface>();
	}
};
static_assert(alignof(INamedSlotInterface) == 0x000004, "Wrong alignment on INamedSlotInterface");
static_assert(sizeof(INamedSlotInterface) == 0x00001C, "Wrong size on INamedSlotInterface");

// Class UMG.PropertyBinding
// 0x001C (0x0038 - 0x001C)
class UPropertyBinding : public UObject
{
public:
	TWeakObjectPtr<class UObject>                 SourceObject;                                      // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FDynamicPropertyPath                   SourcePath;                                        // 0x0024(0x000C)(NativeAccessSpecifierPublic)
	class FName                                   DestinationProperty;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyBinding">();
	}
	static class UPropertyBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyBinding>();
	}
};
static_assert(alignof(UPropertyBinding) == 0x000004, "Wrong alignment on UPropertyBinding");
static_assert(sizeof(UPropertyBinding) == 0x000038, "Wrong size on UPropertyBinding");
static_assert(offsetof(UPropertyBinding, SourceObject) == 0x00001C, "Member 'UPropertyBinding::SourceObject' has a wrong offset!");
static_assert(offsetof(UPropertyBinding, SourcePath) == 0x000024, "Member 'UPropertyBinding::SourcePath' has a wrong offset!");
static_assert(offsetof(UPropertyBinding, DestinationProperty) == 0x000030, "Member 'UPropertyBinding::DestinationProperty' has a wrong offset!");

// Class UMG.BoolBinding
// 0x0000 (0x0038 - 0x0038)
class UBoolBinding final : public UPropertyBinding
{
public:
	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoolBinding">();
	}
	static class UBoolBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoolBinding>();
	}
};
static_assert(alignof(UBoolBinding) == 0x000004, "Wrong alignment on UBoolBinding");
static_assert(sizeof(UBoolBinding) == 0x000038, "Wrong size on UBoolBinding");

// Class UMG.BrushBinding
// 0x0004 (0x003C - 0x0038)
class UBrushBinding final : public UPropertyBinding
{
public:
	uint8                                         Pad_38[0x4];                                       // 0x0038(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSlateBrush GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrushBinding">();
	}
	static class UBrushBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrushBinding>();
	}
};
static_assert(alignof(UBrushBinding) == 0x000004, "Wrong alignment on UBrushBinding");
static_assert(sizeof(UBrushBinding) == 0x00003C, "Wrong size on UBrushBinding");

// Class UMG.CheckedStateBinding
// 0x0004 (0x003C - 0x0038)
class UCheckedStateBinding final : public UPropertyBinding
{
public:
	uint8                                         Pad_38[0x4];                                       // 0x0038(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ECheckBoxState GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CheckedStateBinding">();
	}
	static class UCheckedStateBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckedStateBinding>();
	}
};
static_assert(alignof(UCheckedStateBinding) == 0x000004, "Wrong alignment on UCheckedStateBinding");
static_assert(sizeof(UCheckedStateBinding) == 0x00003C, "Wrong size on UCheckedStateBinding");

// Class UMG.ColorBinding
// 0x0004 (0x003C - 0x0038)
class UColorBinding final : public UPropertyBinding
{
public:
	uint8                                         Pad_38[0x4];                                       // 0x0038(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FLinearColor GetLinearValue() const;
	struct FSlateColor GetSlateValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorBinding">();
	}
	static class UColorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorBinding>();
	}
};
static_assert(alignof(UColorBinding) == 0x000004, "Wrong alignment on UColorBinding");
static_assert(sizeof(UColorBinding) == 0x00003C, "Wrong size on UColorBinding");

// Class UMG.FloatBinding
// 0x0000 (0x0038 - 0x0038)
class UFloatBinding final : public UPropertyBinding
{
public:
	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatBinding">();
	}
	static class UFloatBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatBinding>();
	}
};
static_assert(alignof(UFloatBinding) == 0x000004, "Wrong alignment on UFloatBinding");
static_assert(sizeof(UFloatBinding) == 0x000038, "Wrong size on UFloatBinding");

// Class UMG.Int32Binding
// 0x0000 (0x0038 - 0x0038)
class UInt32Binding final : public UPropertyBinding
{
public:
	int32 GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Int32Binding">();
	}
	static class UInt32Binding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInt32Binding>();
	}
};
static_assert(alignof(UInt32Binding) == 0x000004, "Wrong alignment on UInt32Binding");
static_assert(sizeof(UInt32Binding) == 0x000038, "Wrong size on UInt32Binding");

// Class UMG.MouseCursorBinding
// 0x0000 (0x0038 - 0x0038)
class UMouseCursorBinding final : public UPropertyBinding
{
public:
	EMouseCursor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MouseCursorBinding">();
	}
	static class UMouseCursorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseCursorBinding>();
	}
};
static_assert(alignof(UMouseCursorBinding) == 0x000004, "Wrong alignment on UMouseCursorBinding");
static_assert(sizeof(UMouseCursorBinding) == 0x000038, "Wrong size on UMouseCursorBinding");

// Class UMG.TextBinding
// 0x0004 (0x003C - 0x0038)
class UTextBinding final : public UPropertyBinding
{
public:
	uint8                                         Pad_38[0x4];                                       // 0x0038(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetStringValue() const;
	class FText GetTextValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextBinding">();
	}
	static class UTextBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextBinding>();
	}
};
static_assert(alignof(UTextBinding) == 0x000004, "Wrong alignment on UTextBinding");
static_assert(sizeof(UTextBinding) == 0x00003C, "Wrong size on UTextBinding");

// Class UMG.VisibilityBinding
// 0x0000 (0x0038 - 0x0038)
class UVisibilityBinding final : public UPropertyBinding
{
public:
	ESlateVisibility GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisibilityBinding">();
	}
	static class UVisibilityBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisibilityBinding>();
	}
};
static_assert(alignof(UVisibilityBinding) == 0x000004, "Wrong alignment on UVisibilityBinding");
static_assert(sizeof(UVisibilityBinding) == 0x000038, "Wrong size on UVisibilityBinding");

// Class UMG.WidgetBinding
// 0x0000 (0x0038 - 0x0038)
class UWidgetBinding final : public UPropertyBinding
{
public:
	class UWidget* GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBinding">();
	}
	static class UWidgetBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBinding>();
	}
};
static_assert(alignof(UWidgetBinding) == 0x000004, "Wrong alignment on UWidgetBinding");
static_assert(sizeof(UWidgetBinding) == 0x000038, "Wrong size on UWidgetBinding");

// Class UMG.RichTextBlockDecorator
// 0x0008 (0x0024 - 0x001C)
class URichTextBlockDecorator final : public UObject
{
public:
	bool                                          bReveal;                                           // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RevealedIndex;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextBlockDecorator">();
	}
	static class URichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlockDecorator>();
	}
};
static_assert(alignof(URichTextBlockDecorator) == 0x000004, "Wrong alignment on URichTextBlockDecorator");
static_assert(sizeof(URichTextBlockDecorator) == 0x000024, "Wrong size on URichTextBlockDecorator");
static_assert(offsetof(URichTextBlockDecorator, bReveal) == 0x00001C, "Member 'URichTextBlockDecorator::bReveal' has a wrong offset!");
static_assert(offsetof(URichTextBlockDecorator, RevealedIndex) == 0x000020, "Member 'URichTextBlockDecorator::RevealedIndex' has a wrong offset!");

// Class UMG.SlateBlueprintLibrary
// 0x0000 (0x001C - 0x001C)
class USlateBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector2D AbsoluteToLocal(const struct FGeometry& Geometry, const struct FVector2D& AbsoluteCoordinate);
	static void AbsoluteToViewport(class UObject* WorldContextObject, const struct FVector2D& AbsoluteDesktopCoordinate, struct FVector2D* PixelPosition, struct FVector2D* ViewportPosition);
	static struct FVector2D GetLocalSize(const struct FGeometry& Geometry);
	static bool IsUnderLocation(const struct FGeometry& Geometry, const struct FVector2D& AbsoluteCoordinate);
	static struct FVector2D LocalToAbsolute(const struct FGeometry& Geometry, const struct FVector2D& LocalCoordinate);
	static void LocalToViewport(class UObject* WorldContextObject, const struct FGeometry& Geometry, const struct FVector2D& LocalCoordinate, struct FVector2D* PixelPosition, struct FVector2D* ViewportPosition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateBlueprintLibrary">();
	}
	static class USlateBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateBlueprintLibrary>();
	}
};
static_assert(alignof(USlateBlueprintLibrary) == 0x000004, "Wrong alignment on USlateBlueprintLibrary");
static_assert(sizeof(USlateBlueprintLibrary) == 0x00001C, "Wrong size on USlateBlueprintLibrary");

// Class UMG.SlateDataSheet
// 0x0404 (0x0420 - 0x001C)
class USlateDataSheet final : public UObject
{
public:
	class UTexture2D*                             DataTexture;                                       // 0x001C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x400];                                     // 0x0020(0x0400)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateDataSheet">();
	}
	static class USlateDataSheet* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateDataSheet>();
	}
};
static_assert(alignof(USlateDataSheet) == 0x000004, "Wrong alignment on USlateDataSheet");
static_assert(sizeof(USlateDataSheet) == 0x000420, "Wrong size on USlateDataSheet");
static_assert(offsetof(USlateDataSheet, DataTexture) == 0x00001C, "Member 'USlateDataSheet::DataTexture' has a wrong offset!");

// Class UMG.SlateVectorArtData
// 0x002C (0x0048 - 0x001C)
class USlateVectorArtData final : public UObject
{
public:
	TArray<struct FSlateMeshVertex>               VertexData;                                        // 0x001C(0x000C)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint32>                                IndexData;                                         // 0x0028(0x000C)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     Material;                                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              ExtentMin;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector2D                              ExtentMax;                                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateVectorArtData">();
	}
	static class USlateVectorArtData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateVectorArtData>();
	}
};
static_assert(alignof(USlateVectorArtData) == 0x000004, "Wrong alignment on USlateVectorArtData");
static_assert(sizeof(USlateVectorArtData) == 0x000048, "Wrong size on USlateVectorArtData");
static_assert(offsetof(USlateVectorArtData, VertexData) == 0x00001C, "Member 'USlateVectorArtData::VertexData' has a wrong offset!");
static_assert(offsetof(USlateVectorArtData, IndexData) == 0x000028, "Member 'USlateVectorArtData::IndexData' has a wrong offset!");
static_assert(offsetof(USlateVectorArtData, Material) == 0x000034, "Member 'USlateVectorArtData::Material' has a wrong offset!");
static_assert(offsetof(USlateVectorArtData, ExtentMin) == 0x000038, "Member 'USlateVectorArtData::ExtentMin' has a wrong offset!");
static_assert(offsetof(USlateVectorArtData, ExtentMax) == 0x000040, "Member 'USlateVectorArtData::ExtentMax' has a wrong offset!");

// Class UMG.UMGSequencePlayer
// 0x00A8 (0x00C4 - 0x001C)
class UUMGSequencePlayer final : public UObject
{
public:
	uint8                                         Pad_1C[0x10];                                      // 0x001C(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Animation;                                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x94];                                      // 0x0030(0x0094)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGSequencePlayer">();
	}
	static class UUMGSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSequencePlayer>();
	}
};
static_assert(alignof(UUMGSequencePlayer) == 0x000004, "Wrong alignment on UUMGSequencePlayer");
static_assert(sizeof(UUMGSequencePlayer) == 0x0000C4, "Wrong size on UUMGSequencePlayer");
static_assert(offsetof(UUMGSequencePlayer, Animation) == 0x00002C, "Member 'UUMGSequencePlayer::Animation' has a wrong offset!");

// Class UMG.Visual
// 0x0000 (0x001C - 0x001C)
class UVisual : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Visual">();
	}
	static class UVisual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisual>();
	}
};
static_assert(alignof(UVisual) == 0x000004, "Wrong alignment on UVisual");
static_assert(sizeof(UVisual) == 0x00001C, "Wrong size on UVisual");

// Class UMG.PanelSlot
// 0x0008 (0x0024 - 0x001C)
class UPanelSlot : public UVisual
{
public:
	class UPanelWidget*                           Parent;                                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                Content;                                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PanelSlot">();
	}
	static class UPanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelSlot>();
	}
};
static_assert(alignof(UPanelSlot) == 0x000004, "Wrong alignment on UPanelSlot");
static_assert(sizeof(UPanelSlot) == 0x000024, "Wrong size on UPanelSlot");
static_assert(offsetof(UPanelSlot, Parent) == 0x00001C, "Member 'UPanelSlot::Parent' has a wrong offset!");
static_assert(offsetof(UPanelSlot, Content) == 0x000020, "Member 'UPanelSlot::Content' has a wrong offset!");

// Class UMG.BorderSlot
// 0x001C (0x0040 - 0x0024)
class UBorderSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BorderSlot">();
	}
	static class UBorderSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBorderSlot>();
	}
};
static_assert(alignof(UBorderSlot) == 0x000004, "Wrong alignment on UBorderSlot");
static_assert(sizeof(UBorderSlot) == 0x000040, "Wrong size on UBorderSlot");
static_assert(offsetof(UBorderSlot, Padding) == 0x000024, "Member 'UBorderSlot::Padding' has a wrong offset!");
static_assert(offsetof(UBorderSlot, HorizontalAlignment) == 0x000034, "Member 'UBorderSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UBorderSlot, VerticalAlignment) == 0x000035, "Member 'UBorderSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.ButtonSlot
// 0x001C (0x0040 - 0x0024)
class UButtonSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ButtonSlot">();
	}
	static class UButtonSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButtonSlot>();
	}
};
static_assert(alignof(UButtonSlot) == 0x000004, "Wrong alignment on UButtonSlot");
static_assert(sizeof(UButtonSlot) == 0x000040, "Wrong size on UButtonSlot");
static_assert(offsetof(UButtonSlot, Padding) == 0x000024, "Member 'UButtonSlot::Padding' has a wrong offset!");
static_assert(offsetof(UButtonSlot, HorizontalAlignment) == 0x000034, "Member 'UButtonSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UButtonSlot, VerticalAlignment) == 0x000035, "Member 'UButtonSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.CanvasPanelSlot
// 0x0034 (0x0058 - 0x0024)
class UCanvasPanelSlot final : public UPanelSlot
{
public:
	struct FAnchorData                            LayoutData;                                        // 0x0024(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bAutoSize;                                         // 0x004C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZOrder;                                            // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAlignment(const struct FVector2D& InAlignment);
	void SetAnchors(const struct FAnchors& InAnchors);
	void SetAutoSize(bool InbAutoSize);
	void SetLayout(const struct FAnchorData& InLayoutData);
	void SetMaximum(const struct FVector2D& InMaximumAnchors);
	void SetMinimum(const struct FVector2D& InMinimumAnchors);
	void SetOffsets(const struct FMargin& InOffset);
	void SetPosition(const struct FVector2D& InPosition);
	void SetSize(const struct FVector2D& InSize);
	void SetZOrder(int32 InZOrder);

	struct FVector2D GetAlignment() const;
	struct FAnchors GetAnchors() const;
	bool GetAutoSize() const;
	struct FAnchorData GetLayout() const;
	struct FMargin GetOffsets() const;
	struct FVector2D GetPosition() const;
	struct FVector2D GetSize() const;
	int32 GetZOrder() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CanvasPanelSlot">();
	}
	static class UCanvasPanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPanelSlot>();
	}
};
static_assert(alignof(UCanvasPanelSlot) == 0x000004, "Wrong alignment on UCanvasPanelSlot");
static_assert(sizeof(UCanvasPanelSlot) == 0x000058, "Wrong size on UCanvasPanelSlot");
static_assert(offsetof(UCanvasPanelSlot, LayoutData) == 0x000024, "Member 'UCanvasPanelSlot::LayoutData' has a wrong offset!");
static_assert(offsetof(UCanvasPanelSlot, bAutoSize) == 0x00004C, "Member 'UCanvasPanelSlot::bAutoSize' has a wrong offset!");
static_assert(offsetof(UCanvasPanelSlot, ZOrder) == 0x000050, "Member 'UCanvasPanelSlot::ZOrder' has a wrong offset!");

// Class UMG.GridSlot
// 0x0024 (0x0048 - 0x0024)
class UGridSlot final : public UPanelSlot
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Row;                                               // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RowSpan;                                           // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnSpan;                                        // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Layer;                                             // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Nudge;                                             // 0x003C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColumn(int32 InColumn);
	void SetColumnSpan(int32 InColumnSpan);
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetLayer(int32 InLayer);
	void SetRow(int32 InRow);
	void SetRowSpan(int32 InRowSpan);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GridSlot">();
	}
	static class UGridSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGridSlot>();
	}
};
static_assert(alignof(UGridSlot) == 0x000004, "Wrong alignment on UGridSlot");
static_assert(sizeof(UGridSlot) == 0x000048, "Wrong size on UGridSlot");
static_assert(offsetof(UGridSlot, HorizontalAlignment) == 0x000024, "Member 'UGridSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UGridSlot, VerticalAlignment) == 0x000025, "Member 'UGridSlot::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UGridSlot, Row) == 0x000028, "Member 'UGridSlot::Row' has a wrong offset!");
static_assert(offsetof(UGridSlot, RowSpan) == 0x00002C, "Member 'UGridSlot::RowSpan' has a wrong offset!");
static_assert(offsetof(UGridSlot, Column) == 0x000030, "Member 'UGridSlot::Column' has a wrong offset!");
static_assert(offsetof(UGridSlot, ColumnSpan) == 0x000034, "Member 'UGridSlot::ColumnSpan' has a wrong offset!");
static_assert(offsetof(UGridSlot, Layer) == 0x000038, "Member 'UGridSlot::Layer' has a wrong offset!");
static_assert(offsetof(UGridSlot, Nudge) == 0x00003C, "Member 'UGridSlot::Nudge' has a wrong offset!");

// Class UMG.HorizontalBoxSlot
// 0x0020 (0x0044 - 0x0024)
class UHorizontalBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateChildSize                        Size;                                              // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x003D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x6];                                       // 0x003E(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetSize(const struct FSlateChildSize& InSize);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HorizontalBoxSlot">();
	}
	static class UHorizontalBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHorizontalBoxSlot>();
	}
};
static_assert(alignof(UHorizontalBoxSlot) == 0x000004, "Wrong alignment on UHorizontalBoxSlot");
static_assert(sizeof(UHorizontalBoxSlot) == 0x000044, "Wrong size on UHorizontalBoxSlot");
static_assert(offsetof(UHorizontalBoxSlot, Padding) == 0x000024, "Member 'UHorizontalBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UHorizontalBoxSlot, Size) == 0x000034, "Member 'UHorizontalBoxSlot::Size' has a wrong offset!");
static_assert(offsetof(UHorizontalBoxSlot, HorizontalAlignment) == 0x00003C, "Member 'UHorizontalBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UHorizontalBoxSlot, VerticalAlignment) == 0x00003D, "Member 'UHorizontalBoxSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.OverlaySlot
// 0x0018 (0x003C - 0x0024)
class UOverlaySlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x6];                                       // 0x0036(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverlaySlot">();
	}
	static class UOverlaySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverlaySlot>();
	}
};
static_assert(alignof(UOverlaySlot) == 0x000004, "Wrong alignment on UOverlaySlot");
static_assert(sizeof(UOverlaySlot) == 0x00003C, "Wrong size on UOverlaySlot");
static_assert(offsetof(UOverlaySlot, Padding) == 0x000024, "Member 'UOverlaySlot::Padding' has a wrong offset!");
static_assert(offsetof(UOverlaySlot, HorizontalAlignment) == 0x000034, "Member 'UOverlaySlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UOverlaySlot, VerticalAlignment) == 0x000035, "Member 'UOverlaySlot::VerticalAlignment' has a wrong offset!");

// Class UMG.SafeZoneSlot
// 0x0014 (0x0038 - 0x0024)
class USafeZoneSlot final : public UPanelSlot
{
public:
	bool                                          bIsTitleSafe;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HAlign;                                            // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VAlign;                                            // 0x0026(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SafeZoneSlot">();
	}
	static class USafeZoneSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USafeZoneSlot>();
	}
};
static_assert(alignof(USafeZoneSlot) == 0x000004, "Wrong alignment on USafeZoneSlot");
static_assert(sizeof(USafeZoneSlot) == 0x000038, "Wrong size on USafeZoneSlot");
static_assert(offsetof(USafeZoneSlot, bIsTitleSafe) == 0x000024, "Member 'USafeZoneSlot::bIsTitleSafe' has a wrong offset!");
static_assert(offsetof(USafeZoneSlot, HAlign) == 0x000025, "Member 'USafeZoneSlot::HAlign' has a wrong offset!");
static_assert(offsetof(USafeZoneSlot, VAlign) == 0x000026, "Member 'USafeZoneSlot::VAlign' has a wrong offset!");
static_assert(offsetof(USafeZoneSlot, Padding) == 0x000028, "Member 'USafeZoneSlot::Padding' has a wrong offset!");

// Class UMG.ScaleBoxSlot
// 0x001C (0x0040 - 0x0024)
class UScaleBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScaleBoxSlot">();
	}
	static class UScaleBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScaleBoxSlot>();
	}
};
static_assert(alignof(UScaleBoxSlot) == 0x000004, "Wrong alignment on UScaleBoxSlot");
static_assert(sizeof(UScaleBoxSlot) == 0x000040, "Wrong size on UScaleBoxSlot");
static_assert(offsetof(UScaleBoxSlot, Padding) == 0x000024, "Member 'UScaleBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UScaleBoxSlot, HorizontalAlignment) == 0x000034, "Member 'UScaleBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UScaleBoxSlot, VerticalAlignment) == 0x000035, "Member 'UScaleBoxSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.ScrollBoxSlot
// 0x0018 (0x003C - 0x0024)
class UScrollBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x7];                                       // 0x0035(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScrollBoxSlot">();
	}
	static class UScrollBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollBoxSlot>();
	}
};
static_assert(alignof(UScrollBoxSlot) == 0x000004, "Wrong alignment on UScrollBoxSlot");
static_assert(sizeof(UScrollBoxSlot) == 0x00003C, "Wrong size on UScrollBoxSlot");
static_assert(offsetof(UScrollBoxSlot, Padding) == 0x000024, "Member 'UScrollBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UScrollBoxSlot, HorizontalAlignment) == 0x000034, "Member 'UScrollBoxSlot::HorizontalAlignment' has a wrong offset!");

// Class UMG.SizeBoxSlot
// 0x001C (0x0040 - 0x0024)
class USizeBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SizeBoxSlot">();
	}
	static class USizeBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USizeBoxSlot>();
	}
};
static_assert(alignof(USizeBoxSlot) == 0x000004, "Wrong alignment on USizeBoxSlot");
static_assert(sizeof(USizeBoxSlot) == 0x000040, "Wrong size on USizeBoxSlot");
static_assert(offsetof(USizeBoxSlot, Padding) == 0x000024, "Member 'USizeBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(USizeBoxSlot, HorizontalAlignment) == 0x000034, "Member 'USizeBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(USizeBoxSlot, VerticalAlignment) == 0x000035, "Member 'USizeBoxSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.UniformGridSlot
// 0x0010 (0x0034 - 0x0024)
class UUniformGridSlot final : public UPanelSlot
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Row;                                               // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColumn(int32 InColumn);
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetRow(int32 InRow);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UniformGridSlot">();
	}
	static class UUniformGridSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUniformGridSlot>();
	}
};
static_assert(alignof(UUniformGridSlot) == 0x000004, "Wrong alignment on UUniformGridSlot");
static_assert(sizeof(UUniformGridSlot) == 0x000034, "Wrong size on UUniformGridSlot");
static_assert(offsetof(UUniformGridSlot, HorizontalAlignment) == 0x000024, "Member 'UUniformGridSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UUniformGridSlot, VerticalAlignment) == 0x000025, "Member 'UUniformGridSlot::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UUniformGridSlot, Row) == 0x000028, "Member 'UUniformGridSlot::Row' has a wrong offset!");
static_assert(offsetof(UUniformGridSlot, Column) == 0x00002C, "Member 'UUniformGridSlot::Column' has a wrong offset!");

// Class UMG.VerticalBoxSlot
// 0x0020 (0x0044 - 0x0024)
class UVerticalBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateChildSize                        Size;                                              // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x003D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x6];                                       // 0x003E(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetSize(const struct FSlateChildSize& InSize);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerticalBoxSlot">();
	}
	static class UVerticalBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerticalBoxSlot>();
	}
};
static_assert(alignof(UVerticalBoxSlot) == 0x000004, "Wrong alignment on UVerticalBoxSlot");
static_assert(sizeof(UVerticalBoxSlot) == 0x000044, "Wrong size on UVerticalBoxSlot");
static_assert(offsetof(UVerticalBoxSlot, Padding) == 0x000024, "Member 'UVerticalBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UVerticalBoxSlot, Size) == 0x000034, "Member 'UVerticalBoxSlot::Size' has a wrong offset!");
static_assert(offsetof(UVerticalBoxSlot, HorizontalAlignment) == 0x00003C, "Member 'UVerticalBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UVerticalBoxSlot, VerticalAlignment) == 0x00003D, "Member 'UVerticalBoxSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.WidgetSwitcherSlot
// 0x0018 (0x003C - 0x0024)
class UWidgetSwitcherSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0035(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x6];                                       // 0x0036(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetSwitcherSlot">();
	}
	static class UWidgetSwitcherSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetSwitcherSlot>();
	}
};
static_assert(alignof(UWidgetSwitcherSlot) == 0x000004, "Wrong alignment on UWidgetSwitcherSlot");
static_assert(sizeof(UWidgetSwitcherSlot) == 0x00003C, "Wrong size on UWidgetSwitcherSlot");
static_assert(offsetof(UWidgetSwitcherSlot, Padding) == 0x000024, "Member 'UWidgetSwitcherSlot::Padding' has a wrong offset!");
static_assert(offsetof(UWidgetSwitcherSlot, HorizontalAlignment) == 0x000034, "Member 'UWidgetSwitcherSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UWidgetSwitcherSlot, VerticalAlignment) == 0x000035, "Member 'UWidgetSwitcherSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.WrapBoxSlot
// 0x0020 (0x0044 - 0x0024)
class UWrapBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bFillEmptySpace;                                   // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FillSpanWhenLessThan;                              // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x003D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x6];                                       // 0x003E(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFillEmptySpace(bool InbFillEmptySpace);
	void SetFillSpanWhenLessThan(float InFillSpanWhenLessThan);
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WrapBoxSlot">();
	}
	static class UWrapBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWrapBoxSlot>();
	}
};
static_assert(alignof(UWrapBoxSlot) == 0x000004, "Wrong alignment on UWrapBoxSlot");
static_assert(sizeof(UWrapBoxSlot) == 0x000044, "Wrong size on UWrapBoxSlot");
static_assert(offsetof(UWrapBoxSlot, Padding) == 0x000024, "Member 'UWrapBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UWrapBoxSlot, bFillEmptySpace) == 0x000034, "Member 'UWrapBoxSlot::bFillEmptySpace' has a wrong offset!");
static_assert(offsetof(UWrapBoxSlot, FillSpanWhenLessThan) == 0x000038, "Member 'UWrapBoxSlot::FillSpanWhenLessThan' has a wrong offset!");
static_assert(offsetof(UWrapBoxSlot, HorizontalAlignment) == 0x00003C, "Member 'UWrapBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UWrapBoxSlot, VerticalAlignment) == 0x00003D, "Member 'UWrapBoxSlot::VerticalAlignment' has a wrong offset!");

// Class UMG.Widget
// 0x00B4 (0x00D0 - 0x001C)
class UWidget : public UVisual
{
public:
	bool                                          bIsVariable;                                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCreatedByConstructionScript;                      // 0x001D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
