#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: V2_ItemCardFront

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function V2_ItemCardFront.V2_ItemCardFront_C.ExecuteUbergraph_V2_ItemCardFront
// 0x0010 (0x0010 - 0x0000)
struct V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortStoreState                               K2Node_CustomEvent_NewStoreState;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CardFrontRevealComplete_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront) == 0x000004, "Wrong alignment on V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront");
static_assert(sizeof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront) == 0x000010, "Wrong size on V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront");
static_assert(offsetof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront, EntryPoint) == 0x000000, "Member 'V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront::EntryPoint' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront, K2Node_CustomEvent_NewStoreState) == 0x000004, "Member 'V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront::K2Node_CustomEvent_NewStoreState' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront, CallFunc_CardFrontRevealComplete_ReturnValue) == 0x00000C, "Member 'V2_ItemCardFront_C_ExecuteUbergraph_V2_ItemCardFront::CallFunc_CardFrontRevealComplete_ReturnValue' has a wrong offset!");

// Function V2_ItemCardFront.V2_ItemCardFront_C.OnFortStoreStateChanged
// 0x0001 (0x0001 - 0x0000)
struct V2_ItemCardFront_C_OnFortStoreStateChanged final
{
public:
	EFortStoreState                               NewStoreState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(V2_ItemCardFront_C_OnFortStoreStateChanged) == 0x000001, "Wrong alignment on V2_ItemCardFront_C_OnFortStoreStateChanged");
static_assert(sizeof(V2_ItemCardFront_C_OnFortStoreStateChanged) == 0x000001, "Wrong size on V2_ItemCardFront_C_OnFortStoreStateChanged");
static_assert(offsetof(V2_ItemCardFront_C_OnFortStoreStateChanged, NewStoreState) == 0x000000, "Member 'V2_ItemCardFront_C_OnFortStoreStateChanged::NewStoreState' has a wrong offset!");

// Function V2_ItemCardFront.V2_ItemCardFront_C.Initialize_Card
// 0x0010 (0x0010 - 0x0000)
struct V2_ItemCardFront_C_Initialize_Card final
{
public:
	struct FCard                                  inCard;                                            // 0x0000(0x000C)(Parm)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(V2_ItemCardFront_C_Initialize_Card) == 0x000004, "Wrong alignment on V2_ItemCardFront_C_Initialize_Card");
static_assert(sizeof(V2_ItemCardFront_C_Initialize_Card) == 0x000010, "Wrong size on V2_ItemCardFront_C_Initialize_Card");
static_assert(offsetof(V2_ItemCardFront_C_Initialize_Card, inCard) == 0x000000, "Member 'V2_ItemCardFront_C_Initialize_Card::inCard' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Initialize_Card, CallFunc_GetRarity_ReturnValue) == 0x00000C, "Member 'V2_ItemCardFront_C_Initialize_Card::CallFunc_GetRarity_ReturnValue' has a wrong offset!");

// Function V2_ItemCardFront.V2_ItemCardFront_C.Draw_Card
// 0x01E8 (0x01E8 - 0x0000)
struct V2_ItemCardFront_C_Draw_Card final
{
public:
	bool                                          CallFunc_IsSchematic_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0004(0x0070)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0078(0x001C)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0094(0x000C)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue; // 0x00A0(0x000C)()
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue2;             // 0x00AC(0x0070)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x011C(0x001C)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0138(0x000C)()
	float                                         Override_Type;                                     // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           RarityHighlightColor_3;                            // 0x0148(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           RarityHighlightColor_2;                            // 0x0158(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           RarityHighlightColor_1;                            // 0x0168(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortRarityItemData                    RarityData;                                        // 0x0178(0x0070)(Edit)
};
static_assert(alignof(V2_ItemCardFront_C_Draw_Card) == 0x000004, "Wrong alignment on V2_ItemCardFront_C_Draw_Card");
static_assert(sizeof(V2_ItemCardFront_C_Draw_Card) == 0x0001E8, "Wrong size on V2_ItemCardFront_C_Draw_Card");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_IsSchematic_ReturnValue) == 0x000000, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_IsSchematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_BPGetRarityData_ReturnValue) == 0x000004, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_Greater_IntInt_ReturnValue) == 0x000074, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, K2Node_MakeStruct_SlateColor) == 0x000078, "Member 'V2_ItemCardFront_C_Draw_Card::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_GetDisplayName_ReturnValue) == 0x000094, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_TextTrimPrecedingAndTrailing_ReturnValue) == 0x0000A0, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_TextTrimPrecedingAndTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_BPGetRarityData_ReturnValue2) == 0x0000AC, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_BPGetRarityData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, K2Node_MakeStruct_SlateColor2) == 0x00011C, "Member 'V2_ItemCardFront_C_Draw_Card::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, CallFunc_Conv_IntToText_ReturnValue) == 0x000138, "Member 'V2_ItemCardFront_C_Draw_Card::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, Override_Type) == 0x000144, "Member 'V2_ItemCardFront_C_Draw_Card::Override_Type' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, RarityHighlightColor_3) == 0x000148, "Member 'V2_ItemCardFront_C_Draw_Card::RarityHighlightColor_3' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, RarityHighlightColor_2) == 0x000158, "Member 'V2_ItemCardFront_C_Draw_Card::RarityHighlightColor_2' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, RarityHighlightColor_1) == 0x000168, "Member 'V2_ItemCardFront_C_Draw_Card::RarityHighlightColor_1' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Draw_Card, RarityData) == 0x000178, "Member 'V2_ItemCardFront_C_Draw_Card::RarityData' has a wrong offset!");

// Function V2_ItemCardFront.V2_ItemCardFront_C.Get_CardOverlay_ToolTipWidget_1
// 0x000C (0x000C - 0x0000)
struct V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_Create_Item_Tooltip_Return_Value;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1) == 0x000004, "Wrong alignment on V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1");
static_assert(sizeof(V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1) == 0x00000C, "Wrong size on V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1");
static_assert(offsetof(V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1, ReturnValue) == 0x000000, "Member 'V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1, CallFunc_GetOwningPlayer_ReturnValue) == 0x000004, "Member 'V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1, CallFunc_Create_Item_Tooltip_Return_Value) == 0x000008, "Member 'V2_ItemCardFront_C_Get_CardOverlay_ToolTipWidget_1::CallFunc_Create_Item_Tooltip_Return_Value' has a wrong offset!");

}

#pragma pack(pop)
