#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCamera_Blueprint

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.ExecuteUbergraph_VaultCamera_Blueprint
// 0x00E4 (0x00E4 - 0x0000)
struct VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   Temp_struct_Variable;                              // 0x0004(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AB_Pickups_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x000C)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_Pickups_C*                           CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   UniqueObjectNameForCooking_Key2;                   // 0x0044(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue4;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors2;           // 0x008C(0x000C)(ZeroConstructor, ReferenceParm)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item2;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDay_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDaySpeed_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   UniqueObjectNameForCooking_Key;                    // 0x00A4(0x0010)()
	struct FKey                                   Temp_struct_Variable2;                             // 0x00B4(0x0010)()
	struct FKey                                   UniqueObjectNameForCooking_Key3;                   // 0x00C4(0x0010)()
	struct FKey                                   UniqueObjectNameForCooking_Key4;                   // 0x00D4(0x0010)()
};
static_assert(alignof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint");
static_assert(sizeof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint) == 0x0000E4, "Wrong size on VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, EntryPoint) == 0x000000, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, Temp_struct_Variable) == 0x000004, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000014, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaX) == 0x000018, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetInputMouseDelta_DeltaY) == 0x00001C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetInputMouseDelta_DeltaY' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000034, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue2) == 0x00003C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, UniqueObjectNameForCooking_Key2) == 0x000044, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::UniqueObjectNameForCooking_Key2' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000058, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_BreakRotator_Roll) == 0x000064, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_BreakRotator_Pitch) == 0x000068, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_BreakRotator_Yaw) == 0x00006C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue3) == 0x000070, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_SetActorRotation_ReturnValue) == 0x000084, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue4) == 0x000088, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors2) == 0x00008C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Array_Get_Item2) == 0x000098, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetTimeOfDay_ReturnValue) == 0x00009C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetTimeOfDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetTimeOfDaySpeed_ReturnValue) == 0x0000A0, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetTimeOfDaySpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, UniqueObjectNameForCooking_Key) == 0x0000A4, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::UniqueObjectNameForCooking_Key' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, Temp_struct_Variable2) == 0x0000B4, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, UniqueObjectNameForCooking_Key3) == 0x0000C4, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::UniqueObjectNameForCooking_Key3' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, UniqueObjectNameForCooking_Key4) == 0x0000D4, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::UniqueObjectNameForCooking_Key4' has a wrong offset!");

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct VaultCamera_Blueprint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VaultCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_ReceiveTick");
static_assert(sizeof(VaultCamera_Blueprint_C_ReceiveTick) == 0x000004, "Wrong size on VaultCamera_Blueprint_C_ReceiveTick");
static_assert(offsetof(VaultCamera_Blueprint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'VaultCamera_Blueprint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36
// 0x0010 (0x0010 - 0x0000)
struct VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36");
static_assert(sizeof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36) == 0x000010, "Wrong size on VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36");
static_assert(offsetof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36, Key) == 0x000000, "Member 'VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36::Key' has a wrong offset!");

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37
// 0x0010 (0x0010 - 0x0000)
struct VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37");
static_assert(sizeof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37) == 0x000010, "Wrong size on VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37");
static_assert(offsetof(VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37, Key) == 0x000000, "Member 'VaultCamera_Blueprint_C_InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37::Key' has a wrong offset!");

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38
// 0x0010 (0x0010 - 0x0000)
struct VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38");
static_assert(sizeof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38) == 0x000010, "Wrong size on VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38");
static_assert(offsetof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38, Key) == 0x000000, "Member 'VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38::Key' has a wrong offset!");

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39
// 0x0010 (0x0010 - 0x0000)
struct VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0010)(Parm)
};
static_assert(alignof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39) == 0x000004, "Wrong alignment on VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39");
static_assert(sizeof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39) == 0x000010, "Wrong size on VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39");
static_assert(offsetof(VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39, Key) == 0x000000, "Member 'VaultCamera_Blueprint_C_InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39::Key' has a wrong offset!");

}

#pragma pack(pop)
