#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VectorVM

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// Class VectorVM.NiagaraDataObject
// 0x0000 (0x001C - 0x001C)
class UNiagaraDataObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataObject">();
	}
	static class UNiagaraDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataObject>();
	}
};
static_assert(alignof(UNiagaraDataObject) == 0x000004, "Wrong alignment on UNiagaraDataObject");
static_assert(sizeof(UNiagaraDataObject) == 0x00001C, "Wrong size on UNiagaraDataObject");

// Class VectorVM.NiagaraCurveDataObject
// 0x0004 (0x0020 - 0x001C)
class UNiagaraCurveDataObject final : public UNiagaraDataObject
{
public:
	class UCurveVector*                           CurveObj;                                          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraCurveDataObject">();
	}
	static class UNiagaraCurveDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraCurveDataObject>();
	}
};
static_assert(alignof(UNiagaraCurveDataObject) == 0x000004, "Wrong alignment on UNiagaraCurveDataObject");
static_assert(sizeof(UNiagaraCurveDataObject) == 0x000020, "Wrong size on UNiagaraCurveDataObject");
static_assert(offsetof(UNiagaraCurveDataObject, CurveObj) == 0x00001C, "Member 'UNiagaraCurveDataObject::CurveObj' has a wrong offset!");

// Class VectorVM.NiagaraSparseVolumeDataObject
// 0x0018 (0x0034 - 0x001C)
class UNiagaraSparseVolumeDataObject final : public UNiagaraDataObject
{
public:
	uint8                                         Pad_1C[0x18];                                      // 0x001C(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraSparseVolumeDataObject">();
	}
	static class UNiagaraSparseVolumeDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSparseVolumeDataObject>();
	}
};
static_assert(alignof(UNiagaraSparseVolumeDataObject) == 0x000004, "Wrong alignment on UNiagaraSparseVolumeDataObject");
static_assert(sizeof(UNiagaraSparseVolumeDataObject) == 0x000034, "Wrong size on UNiagaraSparseVolumeDataObject");

}

#pragma pack(pop)
