#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersionInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass VersionInfo.VersionInfo_C
// 0x0090 (0x0248 - 0x01B8)
class UVersionInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             _Text__Backend_Name;                               // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Branch;                                     // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Build;                                      // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Build_Date;                                 // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Changelist;                                 // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Server_Date;                                // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             _Text__Version;                                    // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FFortBackendVersion                    Data;                                              // 0x01D8(0x0070)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_VersionInfo(int32 EntryPoint);
	void Construct();
	void Update(const struct FFortBackendVersion& In_Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VersionInfo_C">();
	}
	static class UVersionInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersionInfo_C>();
	}
};
static_assert(alignof(UVersionInfo_C) == 0x000004, "Wrong alignment on UVersionInfo_C");
static_assert(sizeof(UVersionInfo_C) == 0x000248, "Wrong size on UVersionInfo_C");
static_assert(offsetof(UVersionInfo_C, UberGraphFrame) == 0x0001B8, "Member 'UVersionInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Backend_Name) == 0x0001BC, "Member 'UVersionInfo_C::_Text__Backend_Name' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Branch) == 0x0001C0, "Member 'UVersionInfo_C::_Text__Branch' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Build) == 0x0001C4, "Member 'UVersionInfo_C::_Text__Build' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Build_Date) == 0x0001C8, "Member 'UVersionInfo_C::_Text__Build_Date' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Changelist) == 0x0001CC, "Member 'UVersionInfo_C::_Text__Changelist' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Server_Date) == 0x0001D0, "Member 'UVersionInfo_C::_Text__Server_Date' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, _Text__Version) == 0x0001D4, "Member 'UVersionInfo_C::_Text__Version' has a wrong offset!");
static_assert(offsetof(UVersionInfo_C, Data) == 0x0001D8, "Member 'UVersionInfo_C::Data' has a wrong offset!");

}

#pragma pack(pop)
