#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeakSpot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function WeakSpot.WeakSpot_C.ExecuteUbergraph_WeakSpot
// 0x0490 (0x0490 - 0x0000)
struct WeakSpot_C_ExecuteUbergraph_WeakSpot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasStartingPosition_ReturnValue;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortBounceData                        K2Node_Event_BounceData;                           // 0x0010(0x0030)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R2;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G2;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B2;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A2;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R3;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G3;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B3;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A3;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R4;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G4;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B4;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A4;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue3;    // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue2; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue2;     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue2;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0110(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortSpline*                            CallFunc_CreateNewSplineObject_ReturnValue;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue4;    // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue5;    // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue6;    // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue7;    // 0x01FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasStartingPosition_ReturnValue2;         // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue3;          // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array;                            // 0x0264(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             CallFunc_Array_Get_Item;                           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue2;           // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue3;                 // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue5;        // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue6;        // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue7;        // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue8;        // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0338(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult2;      // 0x03C4(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue4;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue4;          // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue5;                 // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue5;          // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeakSpot_C_ExecuteUbergraph_WeakSpot) == 0x000010, "Wrong alignment on WeakSpot_C_ExecuteUbergraph_WeakSpot");
static_assert(sizeof(WeakSpot_C_ExecuteUbergraph_WeakSpot) == 0x000490, "Wrong size on WeakSpot_C_ExecuteUbergraph_WeakSpot");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, EntryPoint) == 0x000000, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x000008, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_HasStartingPosition_ReturnValue) == 0x00000E, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_HasStartingPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00000F, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, K2Node_Event_BounceData) == 0x000010, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::K2Node_Event_BounceData' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000041, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_R) == 0x000044, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_G) == 0x000048, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_B) == 0x00004C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_A) == 0x000050, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_R2) == 0x000054, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_R2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_G2) == 0x000058, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_G2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_B2) == 0x00005C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_B2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_A2) == 0x000060, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_A2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_MakeVector_ReturnValue2) == 0x000070, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_R3) == 0x00007C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_R3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_G3) == 0x000080, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_G3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_B3) == 0x000084, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_B3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_A3) == 0x000088, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_A3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_R4) == 0x00008C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_R4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_G4) == 0x000090, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_G4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_B4) == 0x000094, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_B4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_BreakColor_A4) == 0x000098, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_BreakColor_A4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_MakeVector_ReturnValue3) == 0x00009C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_MakeVector_ReturnValue4) == 0x0000A8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000B8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue2) == 0x0000C8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000D8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue3) == 0x0000E4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue2) == 0x0000F4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x0000F8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetScalarParameterValue_ReturnValue2) == 0x0000FC, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_FloatToVector_ReturnValue2) == 0x000100, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_FloatToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsDedicatedServer_ReturnValue3) == 0x00010C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, Temp_struct_Variable) == 0x000110, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_AddComponent_ReturnValue) == 0x000140, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_MakeVector_ReturnValue5) == 0x000144, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_CreateNewSplineObject_ReturnValue) == 0x000150, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_CreateNewSplineObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetSplineLength_ReturnValue) == 0x000154, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SetStaticMesh_ReturnValue) == 0x000158, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x00015C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetTransform_ReturnValue) == 0x000160, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_TransformDirection_ReturnValue) == 0x00019C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue4) == 0x0001A8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue5) == 0x0001C4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001D4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue6) == 0x0001E0, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Add_VectorVector_ReturnValue2) == 0x0001F0, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_VectorToLinearColor_ReturnValue7) == 0x0001FC, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_VectorToLinearColor_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x00020C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_HasStartingPosition_ReturnValue2) == 0x00020D, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_HasStartingPosition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectFloat_ReturnValue) == 0x000210, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000214, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000218, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, Temp_bool_IsClosed_Variable) == 0x000224, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_FloatToVector_ReturnValue3) == 0x000228, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_FloatToVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsValid_ReturnValue) == 0x000234, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000238, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_CreateDynamicMaterialInstance_ReturnValue3) == 0x00023C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_CreateDynamicMaterialInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsDedicatedServer_ReturnValue4) == 0x000240, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetTimelineLength_ReturnValue) == 0x000244, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsValid_ReturnValue2) == 0x000248, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00024C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000250, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, Temp_bool_Has_Been_Initd_Variable) == 0x00025C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Array_LastIndex_ReturnValue) == 0x000260, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, K2Node_MakeArray_Array) == 0x000264, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Clamp_ReturnValue) == 0x000270, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Array_Get_Item) == 0x000274, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_GetTimelineLength_ReturnValue2) == 0x000278, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_GetTimelineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00027C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_IsValid_ReturnValue3) == 0x000288, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00028C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_VSize_ReturnValue) == 0x000298, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x00029C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002A8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_VSize_ReturnValue2) == 0x0002AC, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_FClamp_ReturnValue) == 0x0002B0, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x0002B4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002B8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_FClamp_ReturnValue2) == 0x0002BC, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectFloat_ReturnValue2) == 0x0002C0, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0002C4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x0002C8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectFloat_ReturnValue3) == 0x0002D4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue4) == 0x0002D8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue5) == 0x0002E4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue6) == 0x0002F0, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue7) == 0x0002FC, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Add_VectorVector_ReturnValue3) == 0x000308, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Multiply_VectorFloat_ReturnValue8) == 0x000314, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Multiply_VectorFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectVector_ReturnValue) == 0x000320, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Add_VectorVector_ReturnValue4) == 0x00032C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000338, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectVector_ReturnValue2) == 0x0003B8, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_SetWorldLocation_SweepHitResult2) == 0x0003C4, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_SetWorldLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000444, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x000445, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectFloat_ReturnValue4) == 0x000448, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_EqualEqual_IntInt_ReturnValue5) == 0x00044C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_EqualEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_FloatToVector_ReturnValue4) == 0x000450, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_FloatToVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_SelectFloat_ReturnValue5) == 0x00045C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_SelectFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_Conv_FloatToVector_ReturnValue5) == 0x000460, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_Conv_FloatToVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00046C, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_ExecuteUbergraph_WeakSpot, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000478, "Member 'WeakSpot_C_ExecuteUbergraph_WeakSpot::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");

// Function WeakSpot.WeakSpot_C.OnBounceAnimationUpdate
// 0x0030 (0x0030 - 0x0000)
struct WeakSpot_C_OnBounceAnimationUpdate final
{
public:
	struct FFortBounceData                        BounceData;                                        // 0x0000(0x0030)(Parm)
};
static_assert(alignof(WeakSpot_C_OnBounceAnimationUpdate) == 0x000004, "Wrong alignment on WeakSpot_C_OnBounceAnimationUpdate");
static_assert(sizeof(WeakSpot_C_OnBounceAnimationUpdate) == 0x000030, "Wrong size on WeakSpot_C_OnBounceAnimationUpdate");
static_assert(offsetof(WeakSpot_C_OnBounceAnimationUpdate, BounceData) == 0x000000, "Member 'WeakSpot_C_OnBounceAnimationUpdate::BounceData' has a wrong offset!");

// Function WeakSpot.WeakSpot_C.UserConstructionScript
// 0x0140 (0x0140 - 0x0000)
struct WeakSpot_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue2;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0030(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x00C0(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(WeakSpot_C_UserConstructionScript) == 0x000004, "Wrong alignment on WeakSpot_C_UserConstructionScript");
static_assert(sizeof(WeakSpot_C_UserConstructionScript) == 0x000140, "Wrong size on WeakSpot_C_UserConstructionScript");
static_assert(offsetof(WeakSpot_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'WeakSpot_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000004, "Member 'WeakSpot_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeakSpot_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'WeakSpot_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
