#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_Camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass WM_Camera.WM_Camera_C
// 0x0098 (0x06A0 - 0x0608)
class AWM_Camera_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1; // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1; // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_CameraDeactivateAnim;                           // 0x0614(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B; // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B; // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61D[0x3];                                      // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_CameraActivateAnim;                             // 0x0620(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraNoise;                                       // 0x0634(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         OldTimeofDay;                                      // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         OldTimeofDaySpeed;                                 // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             InitialPosition;                                   // 0x0640(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             ZoomPosition;                                      // 0x0670(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WM_Camera(int32 EntryPoint);
	void CameraDeactivateAnim();
	void StopWiggle();
	void ReceiveBeginPlay();
	void CameraActivateAnim();
	void CameraWiggle();
	void OnDeactivated();
	void OnActivated();
	void TL_CameraDeactivateAnim__UpdateFunc();
	void TL_CameraDeactivateAnim__FinishedFunc();
	void TL_CameraActivateAnim__UpdateFunc();
	void TL_CameraActivateAnim__FinishedFunc();
	void CameraNoise__UpdateFunc();
	void CameraNoise__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WM_Camera_C">();
	}
	static class AWM_Camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWM_Camera_C>();
	}
};
static_assert(alignof(AWM_Camera_C) == 0x000010, "Wrong alignment on AWM_Camera_C");
static_assert(sizeof(AWM_Camera_C) == 0x0006A0, "Wrong size on AWM_Camera_C");
static_assert(offsetof(AWM_Camera_C, UberGraphFrame) == 0x000608, "Member 'AWM_Camera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1) == 0x00060C, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1) == 0x000610, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim) == 0x000614, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B) == 0x000618, "Member 'AWM_Camera_C::TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B) == 0x00061C, "Member 'AWM_Camera_C::TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim) == 0x000620, "Member 'AWM_Camera_C::TL_CameraActivateAnim' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000624, "Member 'AWM_Camera_C::CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000628, "Member 'AWM_Camera_C::CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x00062C, "Member 'AWM_Camera_C::CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000630, "Member 'AWM_Camera_C::CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise) == 0x000634, "Member 'AWM_Camera_C::CameraNoise' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, OldTimeofDay) == 0x000638, "Member 'AWM_Camera_C::OldTimeofDay' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, OldTimeofDaySpeed) == 0x00063C, "Member 'AWM_Camera_C::OldTimeofDaySpeed' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, InitialPosition) == 0x000640, "Member 'AWM_Camera_C::InitialPosition' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, ZoomPosition) == 0x000670, "Member 'AWM_Camera_C::ZoomPosition' has a wrong offset!");

}

#pragma pack(pop)
