#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_Camera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function WM_Camera.WM_Camera_C.ExecuteUbergraph_WM_Camera
// 0x0430 (0x0430 - 0x0000)
struct WM_Camera_C_ExecuteUbergraph_WM_Camera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDay_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDaySpeed_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x000C(0x000C)(ZeroConstructor, ReferenceParm)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0050(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult2;     // 0x0150(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0270(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location3;                 // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation3;                 // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale3;                    // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0330(0x000C)(ZeroConstructor, ReferenceParm)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item2;                          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374[0xC];                                      // 0x0374(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue2;                       // 0x0380(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult2;  // 0x03B0(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(WM_Camera_C_ExecuteUbergraph_WM_Camera) == 0x000010, "Wrong alignment on WM_Camera_C_ExecuteUbergraph_WM_Camera");
static_assert(sizeof(WM_Camera_C_ExecuteUbergraph_WM_Camera) == 0x000430, "Wrong size on WM_Camera_C_ExecuteUbergraph_WM_Camera");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, EntryPoint) == 0x000000, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::EntryPoint' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_GetTimeOfDay_ReturnValue) == 0x000004, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_GetTimeOfDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_GetTimeOfDaySpeed_ReturnValue) == 0x000008, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_GetTimeOfDaySpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_GetAllActorsOfClass_OutActors) == 0x00000C, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Array_Get_Item) == 0x000018, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Location) == 0x00001C, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Rotation) == 0x000028, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Scale) == 0x000034, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_X) == 0x000040, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Y) == 0x000044, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Z) == 0x000048, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000050, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000D0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_VLerp_ReturnValue) == 0x0000E0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_K2_SetWorldTransform_SweepHitResult2) == 0x000150, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_K2_SetWorldTransform_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Location2) == 0x0001D0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Rotation2) == 0x0001DC, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Scale2) == 0x0001E8, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_X2) == 0x0001F4, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Y2) == 0x0001F8, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Z2) == 0x0001FC, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000200, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeVector_ReturnValue2) == 0x000204, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeTransform_ReturnValue2) == 0x000210, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_TLerp_ReturnValue) == 0x000240, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000270, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Location3) == 0x0002F0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Location3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Rotation3) == 0x0002FC, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Rotation3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakTransform_Scale3) == 0x000308, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakTransform_Scale3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_X3) == 0x000314, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Y3) == 0x000318, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_BreakVector_Z3) == 0x00031C, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000320, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeVector_ReturnValue3) == 0x000324, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_GetAllActorsOfClass_OutActors2) == 0x000330, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_MakeTransform_ReturnValue3) == 0x000340, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_Array_Get_Item2) == 0x000370, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_TLerp_ReturnValue2) == 0x000380, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_TLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WM_Camera_C_ExecuteUbergraph_WM_Camera, CallFunc_K2_SetRelativeTransform_SweepHitResult2) == 0x0003B0, "Member 'WM_Camera_C_ExecuteUbergraph_WM_Camera::CallFunc_K2_SetRelativeTransform_SweepHitResult2' has a wrong offset!");

}

#pragma pack(pop)
