#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkerTooltipStatsWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C.ExecuteUbergraph_WorkerTooltipStatsWidget
// 0x0184 (0x0184 - 0x0000)
struct WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Calculate_Current_Pulsing_Highlight_Color_Current_Color; // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x006C(0x001C)()
	bool                                          Temp_bool_Variable3;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0094(0x000C)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C4(0x000C)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetBuildingTemplateIdFromInstanceId_ReturnValue; // 0x00D8(0x000C)(ZeroConstructor)
	class UMyTownBuildingDefinitionData*          CallFunc_GetBuildingDefinition_ReturnValue;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWorkerPreviewStatus_OutIsPreviewing;   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorker*                            CallFunc_GetWorkerPreviewStatus_OutWorker;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWorkerPreviewStatus_OutMatchesPersonality; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWorkerPreviewStatus_OutMatchesBuildingType; // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorkerSetBonusState                   CallFunc_GetWorkerPreviewStatus_OutSetBonusState;  // 0x00FC(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0110(0x000C)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0120(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x013C(0x000C)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x014C(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0168(0x000C)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0174(0x000C)()
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget) == 0x000004, "Wrong alignment on WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget");
static_assert(sizeof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget) == 0x000184, "Wrong size on WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, EntryPoint) == 0x000000, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable) == 0x000004, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable2) == 0x000005, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_bool_Variable) == 0x00000C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable3) == 0x000020, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable4) == 0x000021, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_bool_Variable2) == 0x000022, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Event_MyGeometry) == 0x000024, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Calculate_Current_Pulsing_Highlight_Color_Current_Color) == 0x00005C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Calculate_Current_Pulsing_Highlight_Color_Current_Color' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeStruct_SlateColor) == 0x00006C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_bool_Variable3) == 0x000088, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Len_ReturnValue) == 0x00008C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000091, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000094, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Format_ReturnValue) == 0x0000C4, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_IsValid_ReturnValue2) == 0x0000D0, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable5) == 0x0000D1, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetContext_ReturnValue2) == 0x0000D4, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetBuildingTemplateIdFromInstanceId_ReturnValue) == 0x0000D8, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetBuildingTemplateIdFromInstanceId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetBuildingDefinition_ReturnValue) == 0x0000E4, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetBuildingDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable6) == 0x0000E8, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_bool_Variable4) == 0x0000E9, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetContext_ReturnValue3) == 0x0000EC, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable7) == 0x0000F0, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetWorkerPreviewStatus_OutIsPreviewing) == 0x0000F1, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetWorkerPreviewStatus_OutIsPreviewing' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetWorkerPreviewStatus_OutWorker) == 0x0000F4, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetWorkerPreviewStatus_OutWorker' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetWorkerPreviewStatus_OutMatchesPersonality) == 0x0000F8, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetWorkerPreviewStatus_OutMatchesPersonality' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetWorkerPreviewStatus_OutMatchesBuildingType) == 0x0000F9, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetWorkerPreviewStatus_OutMatchesBuildingType' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_GetWorkerPreviewStatus_OutSetBonusState) == 0x0000FC, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_GetWorkerPreviewStatus_OutSetBonusState' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00010C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000110, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_BooleanAND_ReturnValue) == 0x00011C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeStruct_FormatArgumentData2) == 0x000120, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_BooleanAND_ReturnValue2) == 0x000138, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_BooleanAND_ReturnValue3) == 0x000139, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Select_Default) == 0x00013A, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Select2_Default) == 0x00013B, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Conv_IntToText_ReturnValue2) == 0x00013C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Greater_IntInt_ReturnValue2) == 0x000148, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeStruct_FormatArgumentData3) == 0x00014C, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_BooleanAND_ReturnValue4) == 0x000164, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_MakeArray_Array2) == 0x000168, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, CallFunc_Format_ReturnValue2) == 0x000174, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Select3_Default) == 0x000180, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, Temp_byte_Variable8) == 0x000181, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget, K2Node_Select4_Default) == 0x000182, "Member 'WorkerTooltipStatsWidget_C_ExecuteUbergraph_WorkerTooltipStatsWidget::K2Node_Select4_Default' has a wrong offset!");

// Function WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct WorkerTooltipStatsWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorkerTooltipStatsWidget_C_Tick) == 0x000004, "Wrong alignment on WorkerTooltipStatsWidget_C_Tick");
static_assert(sizeof(WorkerTooltipStatsWidget_C_Tick) == 0x000038, "Wrong size on WorkerTooltipStatsWidget_C_Tick");
static_assert(offsetof(WorkerTooltipStatsWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WorkerTooltipStatsWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WorkerTooltipStatsWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'WorkerTooltipStatsWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

#pragma pack(pop)
