#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkerTooltipStatsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// WidgetBlueprintGeneratedClass WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C
// 0x0024 (0x01DC - 0x01B8)
class UWorkerTooltipStatsWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Building_Icon;                                     // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             Building_Name;                                     // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             BuildingSynergyTextBlock;                          // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         OccupyingBuildingBox;                              // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             PersonalityTextBlock;                              // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             SetBonusTextBlock;                                 // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMyTownBuildingDefinitionData*          OccupiedBuildingDefinition;                        // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortWorker*                            Worker_Item;                                       // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WorkerTooltipStatsWidget(int32 EntryPoint);
	void On_Worker_Preview_State_Changed();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorkerTooltipStatsWidget_C">();
	}
	static class UWorkerTooltipStatsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorkerTooltipStatsWidget_C>();
	}
};
static_assert(alignof(UWorkerTooltipStatsWidget_C) == 0x000004, "Wrong alignment on UWorkerTooltipStatsWidget_C");
static_assert(sizeof(UWorkerTooltipStatsWidget_C) == 0x0001DC, "Wrong size on UWorkerTooltipStatsWidget_C");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, UberGraphFrame) == 0x0001B8, "Member 'UWorkerTooltipStatsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, Building_Icon) == 0x0001BC, "Member 'UWorkerTooltipStatsWidget_C::Building_Icon' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, Building_Name) == 0x0001C0, "Member 'UWorkerTooltipStatsWidget_C::Building_Name' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, BuildingSynergyTextBlock) == 0x0001C4, "Member 'UWorkerTooltipStatsWidget_C::BuildingSynergyTextBlock' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, OccupyingBuildingBox) == 0x0001C8, "Member 'UWorkerTooltipStatsWidget_C::OccupyingBuildingBox' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, PersonalityTextBlock) == 0x0001CC, "Member 'UWorkerTooltipStatsWidget_C::PersonalityTextBlock' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, SetBonusTextBlock) == 0x0001D0, "Member 'UWorkerTooltipStatsWidget_C::SetBonusTextBlock' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, OccupiedBuildingDefinition) == 0x0001D4, "Member 'UWorkerTooltipStatsWidget_C::OccupiedBuildingDefinition' has a wrong offset!");
static_assert(offsetof(UWorkerTooltipStatsWidget_C, Worker_Item) == 0x0001D8, "Member 'UWorkerTooltipStatsWidget_C::Worker_Item' has a wrong offset!");

}

#pragma pack(pop)
